{"title":"Train Problem I","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1022","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1022&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1022","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1022"},"statement":[{"title":"Problem Description","content":"As the new term comes, the Ignatius Train Station is very busy nowadays. A lot of student want to get back to school by train(because the trains in the Ignatius Train Station is the fastest all over the world ^v^). But here comes a problem, there is only one railway where all the trains stop. So all the trains come in from one side and get out from the other side. For this problem, if train A gets into the railway first, and then train B gets into the railway before train A leaves, train A can&apos;t leave until train B leaves. The pictures below figure out the problem. Now the problem for you is, there are at most 9 trains in the station, all the trains has an ID(numbered from 1 to n), the trains get into the railway in an order O1, your task is to determine whether the trains can get out in an order O2.<br><img style=\"max-width:100%;\" src=\"/data/images/1022-1.jpg\"><img style=\"max-width:100%;\" src=\"/data/images/1022-2.jpg\"><img style=\"max-width:100%;\" src=\"/data/images/1022-3.jpg\">","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains several test cases. Each test case consists of an integer, the number of trains, and two strings, the order of the trains come in:O1, and the order of the trains leave:O2. The input is terminated by the end of file. More details in the Sample Input.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The output contains a string &quot;No.&quot; if you can&apos;t exchange O2 to O1, or you should output a line contains &quot;Yes.&quot;, and then output your way in exchanging the order(you should output &quot;in&quot; for a train getting into the railway, and &quot;out&quot; for a train getting out of the railway). Print a line contains &quot;FINISH&quot; after each test case. More details in the Sample Output.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 123 321\n3 123 312</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes.\nin\nin\nin\nout\nout\nout\nFINISH\nNo.\nFINISH\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>Hint</div><i style=\"font-size:1px\"> </i>\nFor the first Sample Input, we let train 1 get in, then train 2 and train 3.\nSo now train 3 is at the top of the railway, so train 3 can leave first, then train 2 and train 1.\nIn the second Sample input, we should let train 3 leave first, so we have to let train 1 get in, then train 2 and train 3.\nNow we can let train 3 leave.\nBut after that we can&apos;t let train 1 leave before train 2, because train 2 is at the top of the railway at the moment.\nSo we output &quot;No.&quot;.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Ignatius.L","type":"source","format":"html","require":["katex"]}]}