{"title":"Constructing Roads In JGShining's Kingdom","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1025","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1025&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1025","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1025"},"statement":[{"title":"Problem Description","content":"JGShining&apos;s kingdom consists of 2n(n is no more than 500,000) small cities which are located in two parallel lines.<br> <br>Half of these cities are rich in resource (we call them rich cities) while the others are short of resource (we call them poor cities). Each poor city is short of exactly one kind of resource and also each rich city is rich in exactly one kind of resource. You may assume no two poor cities are short of one same kind of resource and no two rich cities are rich in one same kind of resource. <br><br>With the development of industry, poor cities wanna import resource from rich ones. The roads existed are so small that they&apos;re unable to ensure the heavy trucks, so new roads should be built. The poor cities strongly BS each other, so are the rich ones. Poor cities don&apos;t wanna build a road with other poor ones, and rich ones also can&apos;t abide sharing an end of road with other rich ones. Because of economic benefit, any rich city will be willing to export resource to any poor one.<br><br>Rich citis marked from 1 to n are located in Line I and poor ones marked from 1 to n are located in Line II. <br><br>The location of Rich City 1 is on the left of all other cities, Rich City 2 is on the left of all other cities excluding Rich City 1,  Rich City 3 is on the right of Rich City 1 and Rich City 2 but on the left of all other cities ... And so as the poor ones. <br><br>But as you know, two crossed roads may cause a lot of traffic accident so JGShining has established a law to forbid constructing crossed roads.<br><br>For example, the roads in Figure I are forbidden.<br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1025-1.png\"></center><br><br>In order to build as many roads as possible, the young and handsome king of the kingdom - JGShining needs your help, please help him. ^_^<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Each test case will begin with a line containing an integer n(1 &#x2264; n &#x2264; 500,000). Then n lines follow. Each line contains two integers p and r which represents that Poor City p needs to import resources from Rich City r. Process to the end of file.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output the result in the form of sample. <br>You should tell JGShining what&apos;s the maximal number of road(s) can be built. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 2\n2 1\n3\n1 2\n2 3\n3 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\nMy king, at most 1 road can be built.\n\nCase 2:\nMy king, at most 2 roads can be built.\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nHuge input, scanf is recommended.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"JGShining&#xFF08;&#x6781;&#x5149;&#x70AB;&#x5F71;&#xFF09;","type":"source","format":"html","require":["katex"]}]}