{"title":"Robot Motion","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1035","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1035&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1035","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1035"},"statement":[{"title":"Problem Description","content":"<img style=\"max-width:100%;\" src=\"/data/images/1035-1.gif\"><br><br>A robot has been programmed to follow the instructions in its path. Instructions for the next direction the robot is to move are laid down in a grid. The possible instructions are <br><br>N north (up the page)<br>S south (down the page)<br>E east (to the right on the page)<br>W west (to the left on the page)<br><br>For example, suppose the robot starts on the north (top) side of Grid 1 and starts south (down). The path the robot follows is shown. The robot goes through 10 instructions in the grid before leaving the grid.<br><br>Compare what happens in Grid 2: the robot goes through 3 instructions only once, and then starts a loop through 8 instructions, and never exits.<br><br>You are to write a program that determines how long it takes a robot to get out of the grid or how the robot loops around.<br>","type":"description","format":"html"},{"title":"Input","content":"There will be one or more grids for robots to navigate. The data for each is in the following form. On the first line are three integers separated by blanks: the number of rows in the grid, the number of columns in the grid, and the number of the column in which the robot enters from the north. The possible entry columns are numbered starting with one at the left. Then come the rows of the direction instructions. Each grid will have at least one and at most 10 rows and columns of instructions. The lines of instructions contain only the characters N, S, E, or W with no blanks. The end of input is indicated by a row containing 0 0 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each grid in the input there is one line of output. Either the robot follows a certain number of instructions and exits the grid on any one the four sides or else the robot follows the instructions on a certain number of locations once, and then the instructions on some number of locations repeatedly. The sample input below corresponds to the two grids above and illustrates the two forms of output. The word &quot;step&quot; is always immediately followed by &quot;(s)&quot; whether or not the number before it is 1.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 6 5\nNEESWE\nWWWESS\nSNWWWW\n4 5 1\nSESWE\nEESNW\nNWEEN\nEWSEN\n0 0 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10 step(s) to exit\n3 step(s) before a loop of 8 step(s)</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+USA+1999&amp;source=1&amp;searchmode=source\"> Mid-Central USA 1999 </a> ","type":"source","format":"html"}]}