{"title":"Average is not Fast Enough!","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1036","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1036&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1036","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1036"},"statement":[{"title":"Problem Description","content":"A relay is a race for two or more teams of runners. Each member of a team runs one section of the race. Your task is to help to evaluate the results of a relay race. <br><br>You have to process several teams. For each team you are given a list with the running times for every section of the race. You are to compute the average time per kilometer over the whole distance. That&apos;s easy, isn&apos;t it? <br>So if you like the fun and challenge competing at this contest, perhaps you like a relay race, too. Students from Ulm participated e.g. at the &quot;SOLA&quot; relay in Zurich, Switzerland. For more information visit http://www.sola.asvz.ethz.ch/ after the contest is over.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input specifies the number of sections n followed by the total distance of the relay d in kilometers. You may safely assume that 1 &lt;= n &lt;= 20 and 0.0 &lt; d &lt; 200.0. Every following line gives information about one team: the team number t (an integer, right-justified in a field of width 3) is followed by the n results for each section, separated by a single space. These running times are given in the format &quot;h:mm:ss&quot; with integer numbers for the hours, minutes and seconds, respectively. In the special case of a runner being disqualified, the running time will be denoted by &quot;-:--:--&quot;. Finally, the data on every line is terminated by a newline character. Input is terminated by EOF.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each team output exactly one line giving the team&apos;s number t right aligned in a field of width 3, and the average time for this team rounded to whole seconds in the format &quot;m:ss&quot;. If at least one of the team&apos;s runners has been disqualified, output &quot;-&quot; instead. Adhere to the sample output for the exact format of presentation.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 12.5\n  5 0:23:21 0:25:01\n 42 0:23:32 -:--:--\n  7 0:33:20 0:41:35</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">  5: 3:52 min/km\n 42: -\n  7: 6:00 min/km</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Ulm+Local+Contest+2001&amp;source=1&amp;searchmode=source\"> University of Ulm Local Contest 2001 </a> ","type":"source","format":"html"}]}