{"title":"Fire Net","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1045","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1045&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1045","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1045"},"statement":[{"title":"Problem Description","content":"Suppose that we have a square city with straight streets. A map of a city is a square board with n rows and n columns, each representing a street or a piece of wall. <br><br>A blockhouse is a small castle that has four openings through which to shoot. The four openings are facing North, East, South, and West, respectively. There will be one machine gun shooting through each opening. <br><br>Here we assume that a bullet is so powerful that it can run across any distance and destroy a blockhouse on its way. On the other hand, a wall is so strongly built that can stop the bullets. <br><br>The goal is to place as many blockhouses in a city as possible so that no two can destroy each other. A configuration of blockhouses is legal provided that no two blockhouses are on the same horizontal row or vertical column in a map unless there is at least one wall separating them. In this problem we will consider small square cities (at most 4x4) that contain walls through which bullets cannot run through. <br><br>The following image shows five pictures of the same board. The first picture is the empty board, the second and third pictures show legal configurations, and the fourth and fifth pictures show illegal configurations. For this board, the maximum number of blockhouses in a legal configuration is 5; the second picture shows one way to do it, but there are several other ways. <br><br><img style=\"max-width:100%;\" src=\"/data/images/1045-1.jpg\"><br><br>Your task is to write a program that, given a description of a map, calculates the maximum number of blockhouses that can be placed in the city in a legal configuration. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input file contains one or more map descriptions, followed by a line containing the number 0 that signals the end of the file. Each map description begins with a line containing a positive integer n that is the size of the city; n will be at most 4. The next n lines each describe one row of the map, with a &apos;.&apos; indicating an open space and an uppercase &apos;X&apos; indicating a wall. There are no spaces in the input file. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output one line containing the maximum number of blockhouses that can be placed in the city in a legal configuration.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n.X..\n....\nXX..\n....\n2\nXX\n.X\n3\n.X.\nX.X\n.X.\n3\n...\n.XX\n.XX\n4\n....\n....\n....\n....\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n1\n5\n2\n4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Zhejiang+University+Local+Contest+2001&amp;source=1&amp;searchmode=source\"> Zhejiang University Local Contest 2001 </a> ","type":"source","format":"html","require":["katex"]}]}