{"title":"Gridland","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1046","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1046&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1046","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1046"},"statement":[{"title":"Problem Description","content":"For years, computer scientists have been trying to find efficient solutions to different computing problems. For some of them efficient algorithms are already available, these are the &#x201C;easy&#x201D; problems like sorting, evaluating a polynomial or finding the shortest path in a graph. For the &#x201C;hard&#x201D; ones only exponential-time algorithms are known. The traveling-salesman problem belongs to this latter group. Given a set of N towns and roads between these towns, the problem is to compute the shortest path allowing a salesman to visit each of the towns once and only once and return to the starting point.<br><br>The president of Gridland has hired you to design a program that calculates the length of the shortest traveling-salesman tour for the towns in the country. In Gridland, there is one town at each of the points of a rectangular grid. Roads run from every town in the directions North, Northwest, West, Southwest, South, Southeast, East, and Northeast, provided that there is a neighbouring town in that direction. The distance between neighbouring towns in directions North&#x2013;South or East&#x2013;West is 1 unit. The length of the roads is measured by the Euclidean distance. For example, Figure 7 shows 2 &#xD7; 3-Gridland, i.e., a rectangular grid of dimensions 2 by 3. In 2 &#xD7; 3-Gridland, the shortest tour has length 6. <br><br><img style=\"max-width:100%;\" src=\"/data/images/1046-1.jpg\"><br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains the number of scenarios.<br><br>For each scenario, the grid dimensions m and n will be given as two integer numbers in a single line, separated by a single blank, satisfying 1 &lt; m &lt; 50 and 1 &lt; n &lt; 50.<br>","type":"input_format","format":"html"},{"title":"Output","content":"The output for each scenario begins with a line containing &#x201C;Scenario #i:&#x201D;, where i is the number of the scenario starting at 1. In the next line, print the length of the shortest traveling-salesman tour rounded to two decimal digits. The output for every scenario ends with a blank line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 2\n2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Scenario #1:\n4.00\n\nScenario #2:\n6.00</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Northwestern+Europe+2001&amp;source=1&amp;searchmode=source\"> Northwestern Europe 2001 </a> ","type":"source","format":"html"}]}