{"title":"Moving Tables","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1050","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1050&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1050","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1050"},"statement":[{"title":"Problem Description","content":"The famous ACM (Advanced Computer Maker) Company has rented a floor of a building whose shape is in the following figure. <br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1050-1.gif\"></center><br><br>The floor has 200 rooms each on the north side and south side along the corridor. Recently the Company made a plan to reform its system. The reform includes moving a lot of tables between rooms. Because the corridor is narrow and all the tables are big, only one table can pass through the corridor. Some plan is needed to make the moving efficient. The manager figured out the following plan: Moving a table from a room to another room can be done within 10 minutes. When moving a table from room i to room j, the part of the corridor between the front of room i and the front of room j is used. So, during each 10 minutes, several moving between two rooms not sharing the same part of the corridor will be done simultaneously. To make it clear the manager illustrated the possible cases and impossible cases of simultaneous moving. <br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1050-2.gif\"></center><br><br>For each room, at most one table will be either moved in or moved out. Now, the manager seeks out a method to minimize the time to move all the tables. Your job is to write a program to solve the manager&#x2019;s problem.<br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of T test cases. The number of test cases ) (T is given in the first line of the input. Each test case begins with a line containing an integer N , 1&lt;=N&lt;=200 , that represents the number of tables to move. Each of the following N lines contains two positive integers s and t, representing that a table is to move from room number s to room number t (each room number appears at most once in the N lines). From the N+3-rd line, the remaining test cases are listed in the same manner as above.<br>","type":"input_format","format":"html"},{"title":"Output","content":"The output should contain the minimum time in minutes to complete the moving, one per line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 \n4 \n10 20 \n30 40 \n50 60 \n70 80 \n2 \n1 3 \n2 200 \n3 \n10 100 \n20 80 \n30 50 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10\n20\n30</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Asia+2001%2C+Taejon+%28South+Korea%29&amp;source=1&amp;searchmode=source\"> Asia 2001, Taejon (South Korea) </a> ","type":"source","format":"html"}]}