{"title":"Wooden Sticks","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1051","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1051&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1051","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1051"},"statement":[{"title":"Problem Description","content":"There is a pile of n wooden sticks. The length and weight of each stick are known in advance. The sticks are to be processed by a woodworking machine in one by one fashion. It needs some time, called setup time, for the machine to prepare processing a stick. The setup times are associated with cleaning operations and changing tools and shapes in the machine. The setup times of the woodworking machine are given as follows: <br><br>(a) The setup time for the first wooden stick is 1 minute. <br>(b) Right after processing a stick of length l and weight w , the machine will need no setup time for a stick of length l&apos; and weight w&apos; if l&lt;=l&apos; and w&lt;=w&apos;. Otherwise, it will need 1 minute for setup. <br><br>You are to find the minimum setup time to process a given pile of n wooden sticks. For example, if you have five sticks whose pairs of length and weight are (4,9), (5,2), (2,1), (3,5), and (1,4), then the minimum setup time should be 2 minutes since there is a sequence of pairs (1,4), (3,5), (4,9), (2,1), (5,2).<br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of T test cases. The number of test cases (T) is given in the first line of the input file. Each test case consists of two lines: The first line has an integer n , 1&lt;=n&lt;=5000, that represents the number of wooden sticks in the test case, and the second line contains n 2 positive integers l1, w1, l2, w2, ..., ln, wn, each of magnitude at most 10000 , where li and wi are the length and weight of the i th wooden stick, respectively. The 2n integers are delimited by one or more spaces.<br>","type":"input_format","format":"html"},{"title":"Output","content":"The output should contain the minimum setup time in minutes, one per line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 \n5 \n4 9 5 2 2 1 3 5 1 4 \n3 \n2 2 1 1 2 2 \n3 \n1 3 2 2 3 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Asia+2001%2C+Taejon+%28South+Korea%29&amp;source=1&amp;searchmode=source\"> Asia 2001, Taejon (South Korea) </a> ","type":"source","format":"html"}]}