{"title":"Entropy","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1053","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1053&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1053","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1053"},"statement":[{"title":"Problem Description","content":"An entropy encoder is a data encoding method that achieves lossless data compression by encoding a message with &#xFFFD;&#xFFFD;wasted&#xFFFD;&#xFFFD; or &#xFFFD;&#xFFFD;extra&#xFFFD;&#xFFFD; information removed. In other words, entropy encoding removes information that was not necessary in the first place to accurately encode the message. A high degree of entropy implies a message with a great deal of wasted information; english text encoded in ASCII is an example of a message type that has very high entropy. Already compressed messages, such as JPEG graphics or ZIP archives, have very little entropy and do not benefit from further attempts at entropy encoding.<br><br>English text encoded in ASCII has a high degree of entropy because all characters are encoded using the same number of bits, eight. It is a known fact that the letters E, L, N, R, S and T occur at a considerably higher frequency than do most other letters in english text. If a way could be found to encode just these letters with four bits, then the new encoding would be smaller, would contain all the original information, and would have less entropy. ASCII uses a fixed number of bits for a reason, however: it&#xFFFD;&#xFFFD;s easy, since one is always dealing with a fixed number of bits to represent each possible glyph or character. How would an encoding scheme that used four bits for the above letters be able to distinguish between the four-bit codes and eight-bit codes? This seemingly difficult problem is solved using what is known as a &#xFFFD;&#xFFFD;prefix-free variable-length&#xFFFD;&#xFFFD; encoding.<br><br>In such an encoding, any number of bits can be used to represent any glyph, and glyphs not present in the message are simply not encoded. However, in order to be able to recover the information, no bit pattern that encodes a glyph is allowed to be the prefix of any other encoding bit pattern. This allows the encoded bitstream to be read bit by bit, and whenever a set of bits is encountered that represents a glyph, that glyph can be decoded. If the prefix-free constraint was not enforced, then such a decoding would be impossible.<br><br>Consider the text &#xFFFD;&#xFFFD;AAAAABCD&#xFFFD;&#xFFFD;. Using ASCII, encoding this would require 64 bits. If, instead, we encode &#xFFFD;&#xFFFD;A&#xFFFD;&#xFFFD; with the bit pattern &#xFFFD;&#xFFFD;00&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;B&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;01&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;C&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;10&#xFFFD;&#xFFFD;, and &#xFFFD;&#xFFFD;D&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;11&#xFFFD;&#xFFFD; then we can encode this text in only 16 bits; the resulting bit pattern would be &#xFFFD;&#xFFFD;0000000000011011&#xFFFD;&#xFFFD;. This is still a fixed-length encoding, however; we&#xFFFD;&#xFFFD;re using two bits per glyph instead of eight. Since the glyph &#xFFFD;&#xFFFD;A&#xFFFD;&#xFFFD; occurs with greater frequency, could we do better by encoding it with fewer bits? In fact we can, but in order to maintain a prefix-free encoding, some of the other bit patterns will become longer than two bits. An optimal encoding is to encode &#xFFFD;&#xFFFD;A&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;0&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;B&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;10&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;C&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;110&#xFFFD;&#xFFFD;, and &#xFFFD;&#xFFFD;D&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;111&#xFFFD;&#xFFFD;. (This is clearly not the only optimal encoding, as it is obvious that the encodings for B, C and D could be interchanged freely for any given encoding without increasing the size of the final encoded message.) Using this encoding, the message encodes in only 13 bits to &#xFFFD;&#xFFFD;0000010110111&#xFFFD;&#xFFFD;, a compression ratio of 4.9 to 1 (that is, each bit in the final encoded message represents as much information as did 4.9 bits in the original encoding). Read through this bit pattern from left to right and you&#xFFFD;&#xFFFD;ll see that the prefix-free encoding makes it simple to decode this into the original text even though the codes have varying bit lengths.<br><br>As a second example, consider the text &#xFFFD;&#xFFFD;THE CAT IN THE HAT&#xFFFD;&#xFFFD;. In this text, the letter &#xFFFD;&#xFFFD;T&#xFFFD;&#xFFFD; and the space character both occur with the highest frequency, so they will clearly have the shortest encoding bit patterns in an optimal encoding. The letters &#xFFFD;&#xFFFD;C&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;I&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;N&#xFFFD;&#xFFFD; only occur once, however, so they will have the longest codes.<br><br>There are many possible sets of prefix-free variable-length bit patterns that would yield the optimal encoding, that is, that would allow the text to be encoded in the fewest number of bits. One such optimal encoding is to encode spaces with &#xFFFD;&#xFFFD;00&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;A&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;100&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;C&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;1110&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;E&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;1111&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;H&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;110&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;I&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;1010&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;N&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;1011&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;T&#xFFFD;&#xFFFD; with &#xFFFD;&#xFFFD;01&#xFFFD;&#xFFFD;. The optimal encoding therefore requires only 51 bits compared to the 144 that would be necessary to encode the message with 8-bit ASCII encoding, a compression ratio of 2.8 to 1.<br>","type":"description","format":"html"},{"title":"Input","content":"The input file will contain a list of text strings, one per line. The text strings will consist only of uppercase alphanumeric characters and underscores (which are used in place of spaces). The end of the input will be signalled by a line containing only the word &#xFFFD;&#xFFFD;END&#xFFFD;&#xFFFD; as the text string. This line should not be processed.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each text string in the input, output the length in bits of the 8-bit ASCII encoding, the length in bits of an optimal prefix-free variable-length encoding, and the compression ratio accurate to one decimal point.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">AAAAABCD\nTHE_CAT_IN_THE_HAT\nEND</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">64 13 4.9\n144 51 2.8</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Greater+New+York+2000&amp;source=1&amp;searchmode=source\"> Greater New York 2000 </a> ","type":"source","format":"html"}]}