{"title":"I Think I Need a Houseboat","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1065","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1065&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1065","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1065"},"statement":[{"title":"Problem Description","content":"<img style=\"max-width:100%;\" src=\"/data/images/1065-1.gif\"><br><br>Fred Mapper is considering purchasing some land in Louisiana to build his house on. In the process of investigating the land, he learned that the state of Louisiana is actually shrinking by 50 square miles each year, due to erosion caused by the Mississippi River. Since Fred is hoping to live in this house the rest of his life, he needs to know if his land is going to be lost to erosion. <br><br>After doing more research, Fred has learned that the land that is being lost forms a semicircle. This semicircle is part of a circle centered at (0,0), with the line that bisects the circle being the X axis. Locations below the X axis are in the water. The semicircle has an area of 0 at the beginning of year 1. (Semicircle illustrated in the Figure.) <br><br><img style=\"max-width:100%;\" src=\"/data/images/1065-2.gif\"><br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input will be a positive integer indicating how many data sets will be included (N). <br><br>Each of the next N lines will contain the X and Y Cartesian coordinates of the land Fred is considering. These will be floating point numbers measured in miles. The Y coordinate will be non-negative. (0,0) will not be given.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each data set, a single line of output should appear. This line should take the form of: <br><br>&#x201C;Property N: This property will begin eroding in year Z.&#x201D; <br><br>Where N is the data set (counting from 1), and Z is the first year (start from 1) this property will be within the semicircle AT THE END OF YEAR Z. Z must be an integer. <br><br>After the last data set, this should print out &#x201C;END OF OUTPUT.&#x201D; <br><br>Notes: <br><br>1. No property will appear exactly on the semicircle boundary: it will either be inside or outside. <br><br>2. This problem will be judged automatically. Your answer must match exactly, including the capitalization, punctuation, and white-space. This includes the periods at the ends of the lines. <br><br>3. All locations are given in miles.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 \n1.0 1.0 \n25.0 0.0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Property 1: This property will begin eroding in year 1. \nProperty 2: This property will begin eroding in year 20. \nEND OF OUTPUT. </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Atlantic+USA+2001&amp;source=1&amp;searchmode=source\"> Mid-Atlantic USA 2001 </a> ","type":"source","format":"html"}]}