{"title":"Nightmare","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1072","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1072&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1072","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1072"},"statement":[{"title":"Problem Description","content":"Ignatius had a nightmare last night. He found himself in a labyrinth with a time bomb on him. The labyrinth has an exit, Ignatius should get out of the labyrinth before the bomb explodes. The initial exploding time of the bomb is set to 6 minutes. To prevent the bomb from exploding by shake, Ignatius had to move slowly, that is to move from one area to the nearest area(that is, if Ignatius stands on (x,y) now, he could only on (x+1,y), (x-1,y), (x,y+1), or (x,y-1) in the next minute) takes him 1 minute. Some area in the labyrinth contains a Bomb-Reset-Equipment. They could reset the exploding time to 6 minutes.<br><br>Given the layout of the labyrinth and Ignatius&apos; start position, please tell Ignatius whether he could get out of the labyrinth, if he could, output the minimum time that he has to use to find the exit of the labyrinth, else output -1.<br><br>Here are some rules:<br>1. We can assume the labyrinth is a 2 array.<br>2. Each minute, Ignatius could only get to one of the nearest area, and he should not walk out of the border, of course he could not walk on a wall, too.<br>3. If Ignatius get to the exit when the exploding time turns to 0, he can&apos;t get out of the labyrinth.<br>4. If Ignatius get to the area which contains Bomb-Rest-Equipment when the exploding time turns to 0, he can&apos;t use the equipment to reset the bomb.<br>5. A Bomb-Reset-Equipment can be used as many times as you wish, if it is needed, Ignatius can get to any areas in the labyrinth as many times as you wish.<br>6. The time to reset the exploding time can be ignore, in other words, if Ignatius get to an area which contain Bomb-Rest-Equipment, and the exploding time is larger than 0, the exploding time would be reset to 6.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains several test cases. The first line of the input is a single integer T which is the number of test cases. T test cases follow.<br>Each test case starts with two integers N and M(1&lt;=N,Mm=8) which indicate the size of the labyrinth. Then N lines follow, each line contains M integers. The array indicates the layout of the labyrinth.<br>There are five integers which indicate the different type of area in the labyrinth:<br>0: The area is a wall, Ignatius should not walk on it.<br>1: The area contains nothing, Ignatius can walk on it.<br>2: Ignatius&apos; start position, Ignatius starts his escape from this position.<br>3: The exit of the labyrinth, Ignatius&apos; target position.<br>4: The area contains a Bomb-Reset-Equipment, Ignatius can delay the exploding time by walking to these areas.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, if Ignatius can get out of the labyrinth, you should output the minimum time he needs, else you should just output -1.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3 3\n2 1 1\n1 1 0\n1 1 3\n4 8\n2 1 1 0 1 1 1 0\n1 0 4 1 1 0 4 1\n1 0 0 0 0 0 0 1\n1 1 1 4 1 1 1 3\n5 8\n1 2 1 1 1 1 1 4 \n1 0 0 0 1 0 0 1 \n1 4 1 0 1 1 0 1 \n1 0 0 0 0 3 0 1 \n1 1 4 1 1 1 1 1 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n-1\n13</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Ignatius.L","type":"source","format":"html","require":["katex"]}]}