{"title":"Equipment Box","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1110","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1110&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1110","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1110"},"statement":[{"title":"Problem Description","content":"There is a large room in the Pyramid called Room-of-No-Return. Its floor is covered by rectangular tiles of equal size. The name of the room was chosen because of the very high number of traps and mechanisms in it. The ACM group has spent several years studying the secret plan of this room. It has made a clever plan to avoid all the traps. A specially trained mechanic was sent to deactivate the most feared trap called Shattered Bones. After deactivating the trap the mechanic had to escape from the room. It is very important to step on the center of the tiles only; he must not touch the edges. One wrong step and a large rock falls from the ceiling squashing the mechanic like a pancake. After deactivating the trap, he realized a horrible thing: the ACM plan did not take his equipment box into consideration. The box must be laid onto the ground because the mechanic must have both hands free to prevent contact with other traps. But when the box is laid on the ground, it could touch the line separating the tiles. And this is the main problem you are to solve. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of T test cases. The number of them (T) is given on the first line of the input. Each test case consists of a single line. The line contains exactly four integer numbers separated by spaces: A, B, X and Y. A and Bindicate the dimensions of the tiles, X and Y are the dimensions of the equipment box (1 &lt;= A, B, X, Y &lt;= 50000). <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Your task is to determine whether it is possible to put the box on a single tile -- that is, if the whole box fits on a single tile without touching its border. If so, you are to print one line with the sentence &quot;Escape is possible.&quot;. Otherwise print the sentence &quot;Box cannot be dropped.&quot;. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n10 10 8 8\n8 8 10 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Escape is possible.\nBox cannot be dropped.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Central+Europe+1999&amp;source=1&amp;searchmode=source\"> Central Europe 1999 </a> ","type":"source","format":"html","require":["katex"]}]}