{"title":"Complete the Sequence","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1121","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1121&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1121","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1121"},"statement":[{"title":"Problem Description","content":"You probably know those quizzes in Sunday magazines: given the sequence 1, 2, 3, 4, 5, what is the next number? Sometimes it is very easy to answer, sometimes it could be pretty hard. Because these &quot;sequence problems&quot; are very popular, ACM wants to implement them into the &quot;Free Time&quot; section of their new WAP portal. <br>ACM programmers have noticed that some of the quizzes can be solved by describing the sequence by polynomials. For example, the sequence 1, 2, 3, 4, 5 can be easily understood as a trivial polynomial. The next number is 6. But even more complex sequences, like 1, 2, 4, 7, 11, can be described by a polynomial. In this case, 1/2.n^2-1/2.n+1 can be used. Note that even if the members of the sequence are integers, polynomial coefficients may be any real numbers. <br><br>Polynomial is an expression in the following form: <br><br><br>P(n) = aD.n^D+aD-1.n^D-1+...+a1.n+a0 <br><br><br>. If aD &lt;&gt; 0, the number D is called a degree of the polynomial. Note that constant function P(n) = C can be considered as polynomial of degree 0, and the zero function P(n) = 0 is usually defined to have degree -1.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There is a single positive integer T on the first line of input. It stands for the number of test cases to follow. Each test case consists of two lines. First line of each test case contains two integer numbers S and C separated by a single space, 1 &lt;= S &lt; 100, 1 &lt;= C &lt; 100, (S+C) &lt;= 100. The first number, S, stands for the length of the given sequence, the second number, C is the amount of numbers you are to find to complete the sequence. <br><br>The second line of each test case contains S integer numbers X1, X2, ... XS separated by a space. These numbers form the given sequence. The sequence can always be described by a polynomial P(n) such that for every i, Xi = P(i). Among these polynomials, we can find the polynomial Pmin with the lowest possible degree. This polynomial should be used for completing the sequence.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case, your program must print a single line containing C integer numbers, separated by a space. These numbers are the values completing the sequence according to the polynomial of the lowest possible degree. In other words, you are to print values Pmin(S+1), Pmin(S+2), .... Pmin(S+C). <br><br>It is guaranteed that the results Pmin(S+i) will be non-negative and will fit into the standard integer type.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n6 3\n1 2 3 4 5 6\n8 2\n1 2 4 7 11 16 22 29\n10 2\n1 1 1 1 1 1 1 1 1 2\n1 10\n3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 8 9\n37 46\n11 56\n3 3 3 3 3 3 3 3 3 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Central+Europe+2000&amp;source=1&amp;searchmode=source\"> Central Europe 2000 </a> ","type":"source","format":"html","require":["katex"]}]}