{"title":"Factorial","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1124","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1124&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1124","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1124"},"statement":[{"title":"Problem Description","content":"The most important part of a GSM network is so called Base Transceiver Station (BTS). These transceivers form the areas called cells (this term gave the name to the cellular phone) and every phone connects to the BTS with the strongest signal (in a little simplified view). Of course, BTSes need some attention and technicians need to check their function periodically. <br>ACM technicians faced a very interesting problem recently. Given a set of BTSes to visit, they needed to find the shortest path to visit all of the given points and return back to the central company building. Programmers have spent several months studying this problem but with no results. They were unable to find the solution fast enough. After a long time, one of the programmers found this problem in a conference article. Unfortunately, he found that the problem is so called &quot;Travelling Salesman Problem&quot; and it is very hard to solve. If we have N BTSes to be visited, we can visit them in any order, giving us N! possibilities to examine. The function expressing that number is called factorial and can be computed as a product 1.2.3.4....N. The number is very high even for a relatively small N. <br><br>The programmers understood they had no chance to solve the problem. But because they have already received the research grant from the government, they needed to continue with their studies and produce at least some results. So they started to study behaviour of the factorial function. <br><br>For example, they defined the function Z. For any positive integer N, Z(N) is the number of zeros at the end of the decimal form of number N!. They noticed that this function never decreases. If we have two numbers N1&lt;N2, then Z(N1) &lt;= Z(N2). It is because we can never &quot;lose&quot; any trailing zero by multiplying by any positive number. We can only get new and new zeros. The function Z is very interesting, so we need a computer program that can determine its value efficiently.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There is a single positive integer T on the first line of input. It stands for the number of numbers to follow. Then there is T lines, each containing exactly one positive integer number N, 1 &lt;= N &lt;= 1000000000. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every number N, output a single line containing the single non-negative integer Z(N).<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n3\n60\n100\n1024\n23456\n8735373</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n14\n24\n253\n5861\n2183837</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Central+Europe+2000&amp;source=1&amp;searchmode=source\"> Central Europe 2000 </a> ","type":"source","format":"html","require":["katex"]}]}