{"title":"Ferry Loading III","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1146","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1146&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1146","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1146"},"statement":[{"title":"Problem Description","content":"Before bridges were common, ferries were used to transport cars across rivers. River ferries, unlike their larger cousins, run on a guide line and are powered by the river&apos;s current. Cars drive onto the ferry from one end, the ferry crosses the river, and the cars exit from the other end of the ferry. <br>There is a ferry across the river that can take n cars across the river in t minutes and return in t minutes. A car may arrive at either river bank to be transported by the ferry to the opposite bank. The ferry travels continuously back and forth between the banks so long it is carrying a car or there is at least one car waiting at either bank. Whenever the ferry arrives at one of the banks, it unloads its cargo and loads up to n cars that are waiting to cross. If there are more than n, those that have been waiting the longest are loaded. If there are no cars waiting on either bank, the ferry waits until one arrives, loads it (if it arrives on the same bank of the ferry), and crosses the river. At what time does each car reach the other side of the river? <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains c, the number of test cases. Each test case begins with n, t, m. m lines follow, each giving the arrival time for a car (in minutes since the beginning of the day), and the bank at which the car arrives (&quot;left&quot; or &quot;right&quot;). For each test case, output one line per car, in the same order as the input, giving the time at which that car is unloaded at the opposite bank. Output an empty line between cases.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"You may assume that 0 &lt; n, t, m &#x2264; 10000. The arrival times for each test case are strictly increasing. The ferry is initially on the left bank. Loading and unloading time may be considered to be 0.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 10 10\n0 left\n10 left\n20 left\n30 left\n40 left\n50 left\n60 left\n70 left\n80 left\n90 left\n2 10 3\n10 right\n25 left\n40 left</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10\n30\n30\n50\n50\n70\n70\n90\n90\n110\n\n30\n40\n60</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2005.09.17&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2005.09.17 </a> ","type":"source","format":"html","require":["katex"]}]}