{"title":"Machine Schedule","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1150","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1150&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1150","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1150"},"statement":[{"title":"Problem Description","content":"As we all know, machine scheduling is a very classical problem in computer science and has been studied for a very long history. Scheduling problems differ widely in the nature of the constraints that must be satisfied and the type of schedule desired. Here we consider a 2-machine scheduling problem.<br><br>There are two machines A and B. Machine A has n kinds of working modes, which is called mode_0, mode_1, &#x2026;, mode_n-1, likewise machine B has m kinds of working modes, mode_0, mode_1, &#x2026; , mode_m-1. At the beginning they are both work at mode_0.<br><br>For k jobs given, each of them can be processed in either one of the two machines in particular mode. For example, job 0 can either be processed in machine A at mode_3 or in machine B at mode_4, job 1 can either be processed in machine A at mode_2 or in machine B at mode_4, and so on. Thus, for job i, the constraint can be represent as a triple (i, x, y), which means it can be processed either in machine A at mode_x, or in machine B at mode_y.<br><br>Obviously, to accomplish all the jobs, we need to change the machine&apos;s working mode from time to time, but unfortunately, the machine&apos;s working mode can only be changed by restarting it manually. By changing the sequence of the jobs and assigning each job to a suitable machine, please write a program to minimize the times of restarting machines. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input file for this program consists of several configurations. The first line of one configuration contains three positive integers: n, m (n, m &lt; 100) and k (k &lt; 1000). The following k lines give the constrains of the k jobs, each line is a triple: i, x, y.<br><br>The input will be terminated by a line containing a single zero.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The output should be one integer per line, which means the minimal times of restarting machine.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5 10\n0 1 1\n1 1 2\n2 1 3\n3 1 4\n4 2 1\n5 2 2\n6 2 3\n7 2 4\n8 3 3\n9 4 3\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Asia+2002%2C+Beijing+%28Mainland+China%29&amp;source=1&amp;searchmode=source\"> Asia 2002, Beijing (Mainland China) </a> ","type":"source","format":"html","require":["katex"]}]}