{"title":"Brownie Points I","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1152","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1152&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1152","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1152"},"statement":[{"title":"Problem Description","content":" Stan and Ollie play the game of Odd Brownie Points. Some brownie points are located in the plane, at integer coordinates. Stan plays first and places a vertical line in the plane. The line must go through a brownie point and may cross many (with the same x-coordinate). Then Ollie places a horizontal line that must cross a brownie point already crossed by the vertical line. <br>Those lines divide the plane into four quadrants. The quadrant containing points with arbitrarily large positive coordinates is the top-right quadrant. <br><br>The players score according to the number of brownie points in the quadrants. If a brownie point is crossed by a line, it doesn&apos;t count. Stan gets a point for each (uncrossed) brownie point in the top-right and bottom-left quadrants. Ollie gets a point for each (uncrossed) brownie point in the top-left and bottom-right quadrants. <br><br>Your task is to compute the scores of Stan and Ollie given the point through which they draw their lines. <br>","type":"description","format":"html"},{"title":"Input","content":"Input contains a number of test cases. The data of each test case appear on a sequence of input lines. The first line of each test case contains a positive odd integer 1 &lt; n &lt; 200000 which is the number of brownie points. Each of the following n lines contains two integers, the horizontal (x) and vertical (y) coordinates of a brownie point. No two brownie points occupy the same place. The input ends with a line containing 0 (instead of the n of a test). <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case of input, print a line with two numbers separated by a single space. The first number is Stan&apos;s score, the second is the score of Ollie when their lines cross the point whose coordinates are given at the center of the input sequence of points for this case. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">11\n3 2\n3 3\n3 4\n3 6\n2 -2\n1 -3\n0 0\n-3 -3\n-3 -2\n-3 -4\n3 -7\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2005.06.11&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2005.06.11 </a> ","type":"source","format":"html"}]}