{"title":"Free DIY Tour","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1224","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1224&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1224","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1224"},"statement":[{"title":"Problem Description","content":"Weiwei is a software engineer of ShiningSoft. He has just excellently fulfilled a software project with his fellow workers. His boss is so satisfied with their job that he decide to provide them a free tour around the world. It&apos;s a good chance to relax themselves. To most of them, it&apos;s the first time to go abroad so they decide to make a collective tour.<br><br>The tour company shows them a new kind of tour circuit - DIY circuit. Each circuit contains some cities which can be selected by tourists themselves. According to the company&apos;s statistic, each city has its own interesting point. For instance, Paris has its interesting point of 90, New York has its interesting point of 70, ect. Not any two cities in the world have straight flight so the tour company provide a map to tell its tourists whether they can got a straight flight between any two cities on the map. In order to fly back, the company has made it impossible to make a circle-flight on the half way, using the cities on the map. That is, they marked each city on the map with one number, a city with higher number has no straight flight to a city with lower number. <br><br>Note: Weiwei always starts from Hangzhou(in this problem, we assume Hangzhou is always the first city and also the last city, so we mark Hangzhou both <b>1</b> and <b>N+1</b>), and its interesting point is always 0.<br><br>Now as the leader of the team, Weiwei wants to make a tour as interesting as possible. If you were Weiwei, how did you DIY it?<br>","type":"description","format":"html"},{"title":"Input","content":"The input will contain several cases. The first line is an integer T which suggests the number of cases. Then T cases follows.<br>Each case will begin with an integer N(2 &#x2264; N &#x2264; 100) which is the number of cities on the map.<br>Then N integers follows, representing the interesting point list of the cities.<br>And then it is an integer M followed by M pairs of integers [Ai, Bi] (1 &#x2264; i &#x2264;  M). Each pair of [Ai, Bi] indicates that a straight flight is available from City Ai to City Bi.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, your task is to output the maximal summation of interesting points Weiwei and his fellow workers can get through optimal DIYing and the optimal circuit. The format is as the sample. You may assume that there is only one optimal circuit. <br><br>Output a blank line between two cases.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n0 70 90\n4\n1 2\n1 3\n2 4\n3 4\n3\n0 90 70\n4\n1 2\n1 3\n2 4\n3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">CASE 1#\npoints : 90\ncircuit : 1-&gt;3-&gt;1\n\nCASE 2#\npoints : 90\ncircuit : 1-&gt;2-&gt;1</div></pre>","type":"example","format":"html"},{"title":"Author","content":"JGShining&#xFF08;&#x6781;&#x5149;&#x70AB;&#x5F71;&#xFF09;","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BA%BC%D6%DD%B5%E7%D7%D3%BF%C6%BC%BC%B4%F3%D1%A7%B5%DA%C8%FD%BD%EC%B3%CC%D0%F2%C9%E8%BC%C6%B4%F3%C8%FC&amp;source=1&amp;searchmode=source\"> &#x676D;&#x5DDE;&#x7535;&#x5B50;&#x79D1;&#x6280;&#x5927;&#x5B66;&#x7B2C;&#x4E09;&#x5C4A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5927;&#x8D5B; </a> ","type":"source","format":"html"}]}