{"title":"Saving James Bond","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1245","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1245&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1245","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1245"},"statement":[{"title":"Problem Description","content":"This time let us consider the situation in the movie &quot;Live and Let Die&quot; in which James Bond, the world&apos;s most famous spy, was captured by a group of drug dealers. He was sent to a small piece of land at the center of a lake filled with crocodiles. There he performed the most daring action to escape -- he jumped onto the head of the nearest crocodile! Before the animal realized what was happening, James jumped again onto the next big head... Finally he reached the bank before the last crocodile could bite him (actually the stunt man was caught by the big mouth and barely escaped with his extra thick boot).<br>Assume that the lake is a 100&#xD7;100 square one. Assume that the center of the lake is at (0,0) and the northeast corner at (50,50). The central island is a disk centered at (0,0) with the diameter of 15. A number of crocodiles are in the lake at various positions. Given the coordinates of each crocodile and the distance that James could jump, you must tell him whether he could escape.If he could,tell him the shortest length he has to jump and the min-steps he has to jump for shortest length.<br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of several test cases. Each case starts with a line containing n &lt;= 100, the number of crocodiles, and d &gt; 0, the distance that James could jump. Then one line follows for each crocodile, containing the (x, y) location of the crocodile. Note that x and y are both integers, and no two crocodiles are staying at the same position. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, if James can escape, output in one line the shortest length he has to jump and the min-steps he has to jump for shortest length. If it is impossible for James to escape that way, simply ouput &quot;can&apos;t be saved&quot;.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 10\n17 0\n27 0\n37 0\n45 0\n1 10\n20 30</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">42.50 5\ncan&apos;t be saved</div></pre>","type":"example","format":"html"},{"title":"Author","content":"weigang Lee","type":"source","format":"html"}]}