{"title":"What Day Is It?","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1308","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1308&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1308","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1308"},"statement":[{"title":"Problem Description","content":"The calendar now in use evolved from the Romans. Julius Caesar codified a calendar system that came to be known as the Julian calendar. In this system, all months have 31 days, except for April, June, September, and November, which have 30 days, and February, which has 28 days in non-leap years, and 29 days in leap years. Also, in this system, leap years happened every four years. That is because the astronomers of ancient Rome computed the year to be 365.25 days long, so that after every four years, one needed to add an extra day to keep the calendar on track with the seasons. To do this, they added an extra day (February 29) to every year that was a multiple of four. <br><br><br>Julian Rule: <br><br>Every year that is a multiple of 4 is a leap year, i.e. has an extra day (February 29). <br><br>In 1582, Pope Gregory&apos;s astronomers noticed that the year was not 365.25 days long, but closer to 365.2425. Therefore, the leap year rule would be revised to the following: <br><br><br><br>Gregorian Rule: <br><br>Every year that is a multiple of 4 is a leap year, unless it is a multiple of 100 that is not a multiple of 400. <br><br>To compensate for how the seasons had shifted against the calendar up until that time, the calendar was actually shifted 10 days: the day following October 4, 1582 was declared to be October 15. <br><br><br>England and its empire (including the United States) didn&apos;t switch to the Gregorian calendar system until 1752, when the day following September 2 was declared to be September 14. (The delay was caused by the poor relationship between Henry VIII and the Pope.) <br><br><br>Write a program that converts dates in the United States using a calendar of the time and outputs weekdays. <br>","type":"description","format":"html"},{"title":"Input","content":"The input will be a series of positive integers greater than zero, three integers per line, which represent dates, one date per line. The format for a date is ``month day year&quot; where month is a number between 1 (which indicates January) and 12 (which indicates December), day is a number between 1 and 31, and year is positive number. <br>","type":"input_format","format":"html"},{"title":"Output","content":"The output will be the input date and name of the weekday on which the given date falls in the format shown in the sample. An invalid date or nonexistent date for the calendar used in the United States at the time should generate an error message indicating a invalid date. The input will end with three zeroes<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">11 15 1997\n1 1 2000\n7 4 1998\n2 11 1732\n9 2 1752\n9 14 1752\n4 33 1997\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">November 15, 1997 is a Saturday\nJanuary 1, 2000 is a Saturday\nJuly 4, 1998 is a Saturday\nFebruary 11, 1732 is a Friday\nSeptember 2, 1752 is a Wednesday \nSeptember 14, 1752 is a Thursday\n4/33/1997 is an invalid date.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Pacific+Northwest+1997&amp;source=1&amp;searchmode=source\"> Pacific Northwest 1997 </a> ","type":"source","format":"html"}]}