{"title":"IBM Minus One","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1328","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1328&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1328","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1328"},"statement":[{"title":"Problem Description","content":"You may have heard of the book &apos;2001 - A Space Odyssey&apos; by Arthur C. Clarke, or the film of the same name by Stanley Kubrick. In it a spaceship is sent from Earth to Saturn. The crew is put into stasis for the long flight, only two men are awake, and the ship is controlled by the intelligent computer HAL. But during the flight HAL is acting more and more strangely, and even starts to kill the crew on board. We don&apos;t tell you how the story ends, in case you want to read the book for yourself :-)<br><br>After the movie was released and became very popular, there was some discussion as to what the name &apos;HAL&apos; actually meant. Some thought that it might be an abbreviation for &apos;Heuristic ALgorithm&apos;. But the most popular explanation is the following: if you replace every letter in the word HAL by its successor in the alphabet, you get ... IBM.<br><br>Perhaps there are even more acronyms related in this strange way! You are to write a program that may help to find this out.<br>","type":"description","format":"html"},{"title":"Input","content":"The input starts with the integer n on a line by itself - this is the number of strings to follow. The following n lines each contain one string of at most 50 upper-case letters.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each string in the input, first output the number of the string, as shown in the sample output. The print the string start is derived from the input string by replacing every time by the following letter in the alphabet, and replacing &apos;Z&apos; by &apos;A&apos;.<br><br>Print a blank line after each test case.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nHAL\nSWERC</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">String #1\nIBM\n\nString #2\nTXFSD</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Southwestern+Europe+1997%2C+Practice&amp;source=1&amp;searchmode=source\"> Southwestern Europe 1997, Practice </a> ","type":"source","format":"html"}]}