{"title":"Deck","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1330","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1330&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1330","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1330"},"statement":[{"title":"Problem Description","content":"A single playing card can be placed on a table, carefully, so that the short edges of the card are parallel to the table&apos;s edge, and half the length of the card hangs over the edge of the table. If the card hung any further out, with its center of gravity off the table, it would fall off the table and flutter to the floor. The same reasoning applies if the card were placed on another card, rather than on a table. <br><br>Two playing cards can be arranged, carefully, with short edges parallel to table edges, to extend 3/4 of a card length beyond the edge of the table. The top card hangs half a card length past the edge of the bottom card. The bottom card hangs with only 1/4 of its length past the table&apos;s edge. The center of gravity of the two cards combined lies just over the edge of the table. <br><br>Three playing cards can be arranged, with short edges parallel to table edges, and each card touching at most one other card, to extend 11/12 of a card length beyond the edge of the table. The top two cards extend 3/4 of a card length beyond the edge of the bottom card, and the bottom card extends only 1/6 over the table&apos;s edge; the center of gravity of the three cards lines over the edges of the table. <br><br>If you keep stacking cards so that the edges are aligned and every card has at most one card above it and one below it, how far out can 4 cards extend over the table&apos;s edge? Or 52 cards? Or 1000 cards? Or 99999?<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input contains several nonnegative integers, one to a line. No integer exceeds 99999.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The standard output will contain, on successful completion of the program, a heading: <br><br># Cards Overhang <br><br>(that&apos;s two spaces between the words) and, following, a line for each input integer giving the length of the longest overhang achievable with the given number of cards, measured in cardlengths, and rounded to the nearest thousandth. The length must be expressed with at least one digit before the decimal point and exactly three digits after it. The number of cards is right-justified in column 5, and the decimal points for the lengths lie in column 12.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 \n2 \n3 \n4 \n30 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">The line of digits is intended to guide you in proper output alignment, and is not part of the output that your solution should produce. \n\n12345678901234567\n# Cards  Overhang\n    1     0.500\n    2     0.750\n    3     0.917\n    4     1.042\n   30     1.997</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=South+Central+USA+1998&amp;source=1&amp;searchmode=source\"> South Central USA 1998 </a> ","type":"source","format":"html","require":["katex"]}]}