{"title":"Smith Numbers","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1333","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1333&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1333","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1333"},"statement":[{"title":"Problem Description","content":"While skimming his phone directory in 1982, Albert Wilansky, a mathematician of Lehigh University, noticed that the telephone number of his brother-in-law H. Smith had the following peculiar property: The sum of the digits of that number was equal to the sum of the digits of the prime factors of that number. Got it? Smith&#x2019;s telephone number was 493-7775. This number can be written as the product of its prime factors in the following way: <br><br><center>4937775 = 3 * 5 * 5 * 65837</center><br>The sum of all digits of the telephone number is 4+9+3+7+7+7+5= 42?, and the sum of the digits of its prime factors is equally 3+5+5+6+5+8+3+7= 42. Wilansky was so amazed by his discovery that he named this kind of numbers after his brother-in-law: Smith numbers.<br><br>As this observation is also true for every prime number, Wilansky decided later that a (simple and unsophisticated) prime number is not worth being a Smith number, so he excluded them from the definition.<br><br>Wilansky published an article about Smith numbers in the Two Year College Mathematics Journal and was able to present a whole collection of different Smith numbers: For example, 9985 is a Smith number and so is 6036. However,Wilansky was not able to find a Smith number that was larger than the telephone number of his brother-in-law. It is your task to find Smith numbers that are larger than 4937775!<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of a sequence of positive integers, one integer per line. Each integer will have at most 8 digits. The input is terminated by a line containing the number 0.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every number n &gt; 0 in the input, you are to compute the smallest Smith number which is larger than n, and print it on a line by itself. You can assume that such a number exists.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4937774\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4937775 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+European+Regional+Contest+2000&amp;source=1&amp;searchmode=source\"> Mid-Central European Regional Contest 2000 </a> ","type":"source","format":"html","require":["katex"]}]}