{"title":"Perfect Cubes","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1334","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1334&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1334","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1334"},"statement":[{"title":"Problem Description","content":"For hundreds of years Fermat&apos;s Last Theorem, which stated simply that for n &gt; 2 there exist no integers a, b, c &gt; 1 such that a^n = b^n + c^n, has remained elusively unproven. (A recent proof is believed to be correct, though it is still undergoing scrutiny.) It is possible, however, to find integers greater than 1 that satisfy the ``perfect cube&apos;&apos; equation a^3 = b^3 + c^3 + d^3 (e.g. a quick calculation will show that the equation 12^3 = 6^3 + 8^3 + 10^3 is indeed true). This problem requires that you write a program to find all sets of numbers {a, b, c, d} which satisfy this equation for a &lt;= 200. <br>","type":"description","format":"html","require":["katex"]},{"title":"Output","content":"The output should be listed as shown below, one perfect cube per line, in non-decreasing order of a (i.e. the lines should be sorted by their a values). The values of b, c, and d should also be listed in non-decreasing order on the line itself. There do exist several values of a which can be produced from multiple distinct sets of b, c, and d triples. In these cases, the triples with the smaller b values should be listed first. <br><br>The first part of the output is shown here: <br><br>Cube = 6, Triple = (3,4,5)<br>Cube = 12, Triple = (6,8,10)<br>Cube = 18, Triple = (2,12,16)<br>Cube = 18, Triple = (9,12,15)<br>Cube = 19, Triple = (3,10,18)<br>Cube = 20, Triple = (7,14,17)<br>Cube = 24, Triple = (12,16,20)<br><br>Note: The programmer will need to be concerned with an efficient implementation. The official time limit for this problem is 2 minutes, and it is indeed possible to write a solution to this problem which executes in under 2 minutes on a 33 MHz 80386 machine. Due to the distributed nature of the contest in this region, judges have been instructed to make the official time limit at their site the greater of 2 minutes or twice the time taken by the judge&apos;s solution on the machine being used to judge this problem.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+USA+1995&amp;source=1&amp;searchmode=source\"> Mid-Central USA 1995 </a> ","type":"source","format":"html","require":["katex"]}]}