{"title":"The Drunk Jailer","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1337","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1337&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1337","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1337"},"statement":[{"title":"Problem Description","content":"A certain prison contains a long hall of n cells, each right next to each other. Each cell has a prisoner in it, and each cell is locked. <br>One night, the jailer gets bored and decides to play a game. For round 1 of the game, he takes a drink of whiskey, and then runs down the hall unlocking each cell. For round 2, he takes a drink of whiskey, and then runs down the hall locking every other cell (cells 2, 4, 6, &#x2026;). For round 3, he takes a drink of whiskey, and then runs down the hall. He visits every third cell (cells 3, 6, 9, &#x2026;). If the cell is locked, he unlocks it; if it is unlocked, he locks it. He repeats this for n rounds, takes a final drink, and passes out.<br><br>Some number of prisoners, possibly zero, realizes that their cells are unlocked and the jailer is incapacitated. They immediately escape.<br><br>Given the number of cells, determine how many prisoners escape jail.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a single positive integer. This is the number of lines that follow. Each of the following lines contains a single integer between 5 and 100, inclusive, which is the number of cells n.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each line, you must print out the number of prisoners that escape when the prison has n cells.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5\n100 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Greater+New+York+2002&amp;source=1&amp;searchmode=source\"> Greater New York 2002 </a> ","type":"source","format":"html"}]}