{"title":"Wall","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1348","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1348&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1348","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1348"},"statement":[{"title":"Problem Description","content":"Once upon a time there was a greedy King who ordered his chief Architect to build a wall around the King&apos;s castle. The King was so greedy, that he would not listen to his Architect&apos;s proposals to build a beautiful brick wall with a perfect shape and nice tall towers. Instead, he ordered to build the wall around the whole castle using the least amount of stone and labor, but demanded that the wall should not come closer to the castle than a certain distance. If the King finds that the Architect has used more resources to build the wall than it was absolutely necessary to satisfy those requirements, then the Architect will loose his head. Moreover, he demanded Architect to introduce at once a plan of the wall listing the exact amount of resources that are needed to build the wall.<br>Your task is to help poor Architect to save his head, by writing a program that will find the minimum possible length of the wall that he could build around the castle to satisfy King&apos;s requirements.<br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1348-1.gif\"></center><br><br>The task is somewhat simplified by the fact, that the King&apos;s castle has a polygonal shape and is situated on a flat ground. The Architect has already established a Cartesian coordinate system and has precisely measured the coordinates of all castle&apos;s vertices in feet.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input file contains two integer numbers N and L separated by a space. N (3 &lt;= N &lt;= 1000) is the number of vertices in the King&apos;s castle, and L (1 &lt;= L &lt;= 1000) is the minimal number of feet that King allows for the wall to come close to the castle.<br><br>Next N lines describe coordinates of castle&apos;s vertices in a clockwise order. Each line contains two integer numbers Xi and Yi separated by a space (-10000 &lt;= Xi, Yi &lt;= 10000) that represent the coordinates of ith vertex. All vertices are different and the sides of the castle do not intersect anywhere except for vertices.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Write to the output file the single number that represents the minimal possible length of the wall in feet that could be built around the castle to satisfy King&apos;s requirements. You must present the integer number of feet to the King, because the floating numbers are not invented yet. However, you must round the result in such a way, that it is accurate to 8 inches (1 foot is equal to 12 inches), since the King will not tolerate larger error in the estimates.<br><br>This problem contains multiple test cases!<br><br>The first line of a multiple input is an integer N, then a blank line followed by N input blocks. Each input block is in the format indicated in the problem description. There is a blank line between input blocks.<br><br>The output format consists of N output blocks. There is a blank line between output blocks.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n\n9 100\n200 400\n300 400\n300 300\n400 300\n400 400\n500 400\n500 200\n350 200\n200 200</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1628</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Northeastern+Europe+2001&amp;source=1&amp;searchmode=source\"> Northeastern Europe 2001 </a> ","type":"source","format":"html","require":["katex"]}]}