{"title":"Fold-up Patterns","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1349","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1349&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1349","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1349"},"statement":[{"title":"Problem Description","content":"Fold-up patterns for solids like cubes or octahedrons can be found in many books on geometry, but without actually folding them it is hard to tell whether the constructions really work. In this problem, we will consider a special class of such patterns. <br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1349-1.gif\"></center><br><br>Given a fold-up pattern built from unit squares in the plane, together with a description along what edges it should be folded in what direction, decide whether it will result in a closed surface of a solid in three dimensions. If it does, find the volume of the solid.<br><br>More precisely, the pattern consists of a connected set of unit squares in the plane. For any edge between connected sides you are told whether to fold forward, backward (always at a right angle), or not at all along that edge. If an edge between two adjacent squares in the pattern is not mentioned in the input, you may assume that the squares are not connected and can be ripped apart when folding. However, connected edges must always be folded according to the description.<br><br>For our purposes a closed surface is one where every square in the pattern separates the inside from the outside. When folded, the squares of the pattern lie on a rectangular, 3-dimensional grid, and each separates a cell (cubes of side length one unit) on the inside from one on the outside. For every cell it must be clear whether it is inside or outside. The following sketch illustrates this rule in two dimensions. <br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1349-2.gif\"></center><br><br>Note that even the second pattern above satisfies our definition of a closed surface, but the interior is not connected.<br><br>Two different squares may not occupy exactly the same position in space, though they may (and will for a closed surface) touch at edges and vertices. Make sure that the pattern does not interpenetrate itself through connected edges. Apart from that, do not worry about the process of folding, e.g. what edges are folded first or whether part of the structure is in the way for the rest.<br>","type":"description","format":"html"},{"title":"Input","content":"The input file consists of several test cases.<br><br>For each test case, the first line contains two integers n and e. These are the number n (1 &lt;= n &lt;= 200) of squares in the pattern and the number e (0 &lt;= e &lt;= 300) of edges. Squares are labelled by the integers 0 to n - 1. The following e lines describe one edge each using the four numbers s1; s2; p; f :<br><br>The two numbers s1 and s2 (with 0 &lt;= s1 &lt; s2 &lt; n) of the squares that are joined by the edge.<br><br>The position p of the square s2 with respect to the square s1 in the pattern. Here p = 0;1;2;3 mean above, to the left, below, or to the right of s1, respectively (see sketch below).<br><br>The number f =0;1;2 tells you to fold along the edge either not at all, forward, or back, respectively (see sketch).<br><br><center><img style=\"max-width:100%;\" src=\"/data/images/1349-3.gif\"></center><br><br>You can also assume that the pattern is connected and can be drawn in the plane without overlapping.<br><br>At the end of the input file, there will be a line containing two zeros (instead of n and e). Do not process that line.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each scenario print &#x201C;Test case #k:&#x201D;, where k is the number of the test case (starting from 1).<br><br>Then, on the same line, print either &#x201C;not a closed surface&#x201D; if the pattern does not form a closed surface or &#x201C;closed surface, volume=&#x201D; and the volume as an integer if it does.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 5\n0 2 2 1\n1 2 3 1\n2 3 3 1\n2 4 2 1\n4 5 2 1\n5 4\n0 2 2 1\n1 2 3 1\n2 3 3 1\n2 4 2 1\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Test case #1: closed surface, volume=1\nTest case #2: not a closed surface\n\n<img src=\"/data/images/1349-4.gif\"></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+European+Regional+Contest+2000&amp;source=1&amp;searchmode=source\"> Mid-Central European Regional Contest 2000 </a> ","type":"source","format":"html"}]}