{"title":"Choose Your Own Adventure","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1354","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1354&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1354","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1354"},"statement":[{"title":"Problem Description","content":"After reading the book Tim and Marc Kill Kenny about fifty zillion times, James decided he&apos;d had it with choose-your-own-adventure stories. No matter what choices he made, it seemed like Kenny always fell down an abandoned mine shaft, got run over by a bus load of nuns, or was messily devoured by stray cats. James eventually found the page with the happy ending (where Kenny saves himself by trapping Tim and Marc between the pizza and the hungry programmers) by flipping through the book, but he can&apos;t figure out how to get there by following the rules. Luckily, he owns a C compiler...<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input to this problem will consist of a (non-empty) series of up to 100 data sets, each representing a choose-your-own-adventure story. Each data set will be formatted according to the following description, and there will be no blank lines separating data sets. <br><br>The first line contains a single integer n indicating the number of data sets. <br><br>A single data set has 2 components: <br><br>1. Page Count - A line containing a single integer X, where 1 &lt; X &lt; 100, indicating the number of pages in the story.<br>2. Page List - A sequence of X lines, each of which represents a page from the book. Each line has the following components separated from one another by single spaces:<br><ul><li>Line type - A single character indicating what type of line this is. It will represent either a &quot;C&quot; choice page, or an &quot;E&quot; end page. Page 1 is always a choice page.</li><br><li>Text - A string of text surrounded by double quotes. Including the quotes, this component will not exceed 256 characters. The quotes are given for input purposes only and should not be considered part of the text. The text will not contain embedded double quotes.</li><br><li>Choices - Two positive integers from 1 to X indicating the pages where the reader can go from this page. Only choice pages have this component.</li><br><li>Ending Type - Either the text &quot;HAPPY&quot; or &quot;GRISLY&quot;. There will only be one happy ending per story, and only end pages have this component.</li></ul><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each story in the input: <br><br><ul><li>Output a single line, &quot;STORY #&quot; where # is 1 for the first story, 2 for the second story, etc.</li> <br><li>Determine the story that begins on page 1 and ends on the happy ending page. Output the text of this story, printing one &quot;page&quot; of text per line. Note that there is only one such story for each data set. </li></ul><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\nC &quot;Arrived at LSU for the contest&quot; 2 3\nE &quot;Was devoured by sidewalk ants&quot; GRISLY\nE &quot;Won the contest. Received glory and nachos.&quot; HAPPY\n5\nC &quot;Saw a peanut&quot; 3 5\nE &quot;Made peanut butter sandwich&quot; HAPPY\nC &quot;Found a hammer&quot; 4 2\nE &quot;Hit self on head with hammer, ouch!&quot; GRISLY\nE &quot;Ate the peanut, choked on it, and died&quot; GRISLY</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">STORY 1\nArrived at LSU for the contest\nWon the contest. Received glory and nachos.\nSTORY 2\nSaw a peanut\nFound a hammer\nMade peanut butter sandwich</div></pre>","type":"example","format":"html","require":["katex"]}]}