{"title":"Cave Exploration","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1357","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1357&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1357","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1357"},"statement":[{"title":"Problem Description","content":"Long time ago one man said, that he had explored the corridors of one cave. It means, that he was in all corridors of the cave.Corridors are really horizontal or vertical segments. Corridor counted visited if he was in at least one point of corridor.<br><br>Now you want to know, is it true. You have a map of the cave, and you know that explorer used the following algorithm: he turns left if he can, if he can&apos;t he goes straight, if he can&apos;t he turns right, if he can&apos;t he turns back.Exploration ends when the man reaches entry point second time. You task to count how many corridors wasn&apos;t visited by explorer.<br>","type":"description","format":"html"},{"title":"Input","content":"In the first line there is an integer T (T&lt;=20) &#xFFFD;C the number of different maps. For each map in first line there is an integer N (N&lt;=1000) &#xFFFD;C the number of corridors. It is known that no two vertical corridors have common point and no two horizontal corridors have common point.So the next N lines contain such information: the line starts with one of the characters V or H &#xFFFD;Cvertical or horizontal corridor. Then one Y-coordinate and two X-coordinates are given for a horizontal corridor or one X-coordinate and two Y-coordinates for a vertical corridor. The last line for each map contains X and Y coordinates of the entry point (start and end point of travel) and the direction (W &#xFFFD;C left, E &#xFFFD;C right, N &#xFFFD;C up and S &#xFFFD;C down). You may assume that: entry point is not located in the cross-point of two corridors, and explorer can always moves forward by the direction given in the input. All coordinates are integers and do not exceed 32767 by absolute value and there is no more than 500 vertical corridors and no more than 500 horizontal corridors.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each map the program has to print the number of unvisited corridors in separate line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6\nH 0 6 0\nH 2 1 6\nV 1 0 4\nV 5 3 0\nV 3 0 2\nH 1 2 4\n6 0 W\n1\nV 0 -5 5\n0 0 S</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n0</div></pre>","type":"example","format":"html"}]}