{"title":"As the Crow Flies","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1359","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1359&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1359","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1359"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"/data/images/1359-1.gif\"></center><br><br>As president of a startup airline company, you have started a frequent flier program that rewards customers for every mile they travel. As a for-profit company, you have a vested interest in minimizing the number of frequent flier miles that a person can earn on any one trip. To get an idea of how many miles a customer could earn flying the existing network, you&apos;ve decided to write a program. <br><br>Assumptions: <br><br><ul><li>A passenger&apos;s itinerary is one-way (no return flight). </li><br><li>Every itinerary takes the shortest route from the departing city to the destination city. </li><br><li>Frequent flier miles are counted &quot;as the crow flies&quot; (i.e., the shortest route across the earth&apos;s surface that connects the cities along the route). </li><br><li>The earth&apos;s surface is a perfect sphere with radius 4000 miles. </li></ul><br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer n indicating the number of data sets. Each data set will be formatted according to the following description: <br><br>A single data set has 3 components: <br><br>1. Header Line - A single line, &quot;X Y&quot;, where X is the number of cities and Y is the number of flight legs in the airline&apos;s network. Both will be positive integers less than 100. <br>2. City List - A list of cities and their locations, one city per line. The line will be of the format<br><br>&#xA0; &#xA0;&quot;C LA NS LO EW&quot; where: <br><br><ul><li>C is the name of the city (no spaces, alphabetical, first letter only upper case)</li> <br><li>LA is the degrees of latitude where the city is located (from 0 to 90) </li><br><li>NS is the direction of latitude (&apos;N&apos;orth or &apos;S&apos;outh of the equator) </li><br><li>LO is the degrees of longitude where the city is located (from 0 to 180) </li><br><li>EW is the direction of longitude (&apos;E&apos;ast or &apos;W&apos;est of the prime meridian) </li></ul><br><br>3. Flight List - A list of city pairs of the format &quot;B C&quot; representing different cities that are directly connected by flight legs, one pair per line. Note that &quot;B C&quot; is equivalent to &quot;C B&quot;.<br><br>Note: <br><br><ul><li>Some longitude measurements can be represented in multiple ways (i.e., 180E = 180W) </li><br><li>All degrees of latitude and longitude given in the input will be integers. </li><br><li>The airline&apos;s network is connected (i.e., there is at least one route between any two cities). </li></ul>","type":"input_format","format":"html"},{"title":"Output","content":"For each data set, output the two cities that are farthest from each other (farthest in the sense that the shortest route between them is the longest of any city pair). You are guaranteed that there will be no ties. Display the city names on the same line, separated by a single space, sorted in dictionary order.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6 5\nNorthpole 90 N 87 E\nSouthpole 90 S 180 W\nEquatorone 0 N 45 W\nEquatortwo 0 S 90 E\nEquatorthree 0 S 180 E\nEquatorfour 0 N 46 W\nEquatorone Equatortwo\nEquatortwo Equatorthree\nEquatorthree Equatorfour\nNorthpole Equatortwo\nSouthpole Equatorthree\n2 1\nNorthpole 90 N 0 E\nSouthpole 90 S 0 W\nSouthpole Northpole</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Equatorfour Equatorone\nNorthpole Southpole</div></pre>","type":"example","format":"html"}]}