{"title":"Formatting Text","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1378","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1378&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1378","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1378"},"statement":[{"title":"Problem Description","content":"Writings e-mails is fun, but, unfortunately, they do not look very nice, mainly because not all lines have the same lengths. In this problem, your task is to write an e-mail formatting program which reformats a paragraph of an e-mail (e.g. by inserting spaces) so that, afterwards, all lines have the same length (even the last one of each paragraph). <br>The easiest way to perform this task would be to insert more spaces between the words in lines which are too short. But this is not the best way. Consider the following example: <br><br>****************************<br>This is the example you are<br>actually considering.<br><br>Let us assume that we want to get lines as long as the row of stars. Then, by simply inserting spaces, we would get <br><br>****************************<br>This is the example you  are<br>actually        considering.<br><br>But this looks rather odd because of the big gap in the second line. By moving the word ``are&apos;&apos; from the first to the second line, we get a better result: <br><br>****************************<br>This  is  the  example   you<br>are  actually   considering.<br><br>Of course, this has to be formalized. To do this, we assign a badness to each gap between words. The badness assigned to a gap of n spaces is (n - 1)^2. The goal of the program is to minimize the sum of all badnesses. For example, the badness of the first example is 1 + 7^2 = 50 whereas the badness of the second one is only 1 + 1 + 1 + 4 + 1 + 4 = 12. <br><br>In the output, every line has to start and to end with a word. (I.e. there cannot be a gap at the beginning or the end of a line.) The only exception to this is the following: <br><br>If a line contains only one word this word shall be put at the beginning of the line, and a badness of 500 is assigned to this line if it is shorter than it should be. (Of course, in this case, the length of the line is simply the length of the word.) <br>","type":"description","format":"html"},{"title":"Input","content":"The input contains a text consisting of several paragraphs. Each paragraph is preceded by a line containing a single integer n, the desired width of the paragraph (1 &lt;= n &lt;= 80). <br><br>Paragraphs consist of one or more lines which contain one or more words each. Words consist of characters with ASCII codes between 33 and 126, inclusive, and are separated by spaces (possibly more than one). No word will be longer than the desired width of the paragraph. The total length of all words of one paragraph will not be more than 10000 characters. <br><br>Each paragraph is terminated by exactly one blank line. There is no limit on the number of paragraphs in the input file. <br><br>The input file will be terminated by a paragraph description starting with n=0. This paragraph should not be processed. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output the same text, formatted in the way described above (processing each paragraph separately). <br><br>If there are several ways to format a paragraph with the same badness, use the following algorithm to choose which one to output: Let A and B be two solutions. Find the first gap which has not the same length in A and B. Do not output the solution in which this gap is bigger. <br><br>Output a blank line after each paragraph.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">28\nThis is the example you are\nactually considering.\n\n25\nWriting e-mails is fun, and with this program,\nthey even look nice.\n\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">This  is  the  example   you\nare  actually   considering.\n\nWriting e-mails  is  fun,\nand  with  this  program,\nthey  even   look   nice.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+European+Regional+Contest+1999&amp;source=1&amp;searchmode=source\"> Mid-Central European Regional Contest 1999 </a> ","type":"source","format":"html"}]}