{"title":"Crazy Search","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1381","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1381&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1381","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1381"},"statement":[{"title":"Problem Description","content":"Many people like to solve hard puzzles some of which may lead them to madness. One such puzzle could be finding a hidden prime number in a given text. Such number could be the number of different substrings of a given size that exist in the text. As you soon will discover, you really need the help of a computer and a good algorithm to solve such a puzzle.<br><br>Your task is to write a program that given the size, N, of the substring, the number of different characters that may occur in the text, NC, and the text itself, determines the number of different substrings of size N that appear in the text.<br><br>As an example, consider N=3, NC=4 and the text &quot;daababac&quot;. The different substrings of size 3 that can be found in this text are: &quot;daa&quot;, &quot;aab&quot;, &quot;aba&quot;, &quot;bab&quot;, &quot;bac&quot;. Therefore, the answer should be 5. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input consists of two numbers, N and NC, separated by exactly one space. This is followed by the text where the search takes place. You may assume that the maximum number of substrings formed by the possible set of characters does not exceed 16 Millions.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The program should output just an integer corresponding to the number of different substrings of size N found in the given text.<br>The first line of a multiple input is an integer N, then a blank line followed by N input blocks. Each input block is in the format indicated in the problem description. There is a blank line between input blocks.<br><br>The output format consists of N output blocks. There is a blank line between output blocks.<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n\n3 4\ndaababac</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5</div></pre>","type":"example","format":"html","require":["katex"]}]}