{"title":"Ball Toss","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1382","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1382&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1382","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1382"},"statement":[{"title":"Problem Description","content":"Classmates stand in a circle facing inward, each with the direction left or right in mind. One of the students has a ball and begins by tossing it to another student. (It doesn&apos;t really matter which one.) When one catches the ball and is thinking left, she throws it back across the circle one place to the left (from her perspective) of the person who threw her the ball. Then she switches from thinking left to thinking right. Similarly, if she is thinking right, she throws the ball to the right of the person who threw it to her and then switches from thinking right to thinking left.<br><br>There are two exceptions to this rule: If one catches the ball from the classmate to her immediate left and is also thinking left, she passes the ball to the classmate to her immediate right, and then switches to thinking right. Similarly, if she gets the ball from the classmate to her immediate right and is thinking right, she passes the ball to the classmate to her immediate left, and then switches to thinking left. (Note that these rules are given to avoid the problem of tossing the ball to oneself.)<br><br>No matter what the initial pattern of left and right thinking is and who first gets tossed the ball, everyone will get tossed the ball eventually! In this problem, you will figure out how long it takes.<br><br>You&apos;ll be given the initial directions of n classmates (numbered clockwise), and the classmate to whom classmate 1 initially tosses the ball. (Classmate 1 will always have the ball initially.) <br>","type":"description","format":"html"},{"title":"Input","content":"There will be multiple problem instances. Each problem instance will be of the form<br><br>n k t1 t2 t3 ... tn<br><br>where n (2 &lt;= n &lt;= 30) is the number of classmates, numbered 1 through n clockwise around the circle, k (&gt; 1) is the classmate to whom classmate 1 initially tosses the ball, and ti (i = 1, 2, ..., n) are each either L or R, indicating the initial direction thought by classmate i. (n = 0 indicates end of input.)<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each problem instance, you should generate one line of output of the form:<br><br>Classmate m got the ball last after t tosses.<br><br>where m and t are for you to determine. You may assume that t will be no larger than 100,000.<br><br>Note that classmate number 1 initially has the ball and tosses it to classmate k. Thus, number 1 has not yet been tossed the ball and so does not switch the direction he is thinking.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2 L L L L\n4 3 R L L R\n10 4 R R L R L L R R L R\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Classmate 3 got the ball last after 4 tosses.\nClassmate 2 got the ball last after 4 tosses.\nClassmate 9 got the ball last after 69 tosses.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=East+Central+North+America+2002&amp;source=1&amp;searchmode=source\"> East Central North America 2002 </a> ","type":"source","format":"html"}]}