{"title":"Company","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1383","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1383&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1383","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1383"},"statement":[{"title":"Problem Description","content":"company pays different hourly wages for different job types. Each week the company keeps evidence of the total number of work hours for every job type and the total amount paid to all employees for that week. In different weeks different job types can be accomplished. The hourly wage for any job type in the same company remains unchanged. The hourly wage for any job type is a positive integer and the ratio between the maximum wage and the minimum wage is less than 20.<br><br>You are asked to write a program that computes the hourly wage for every job type using the data collected a period of time (one or several weeks). The number of job types is limited to 200 and the number of weeks in one data set is limited to 50.<br><br>The input contains several data sets in text format.<br><br>The format for the data set is:<br><br>The number of lines for the data set;<br>information_for__one_or_more_weeks<br>The format of the information for a week is the following:<br>job_type1 number_of _hours1<br>job_type2 number_of _hours2<br>job_type3 number_of _hours3<br>……<br>. total_paid ( the dot marks the ending of info for a week)<br><br>The job type is represented as a string of characters (limited to 20). The number of hours is a positive integer (smaller than 1E5). The total paid is a positive integer (smaller than 2E10).<br><br>The program should write to standard output (for every job type involved in the data set) a line containing the job type and the hourly wage. The output for a data set ends with a line containing a dot.<br><br>If the program cannot compute a unique hourly wage for every job type it will print &quot;Incomplete data&quot; and if it cannot compute an integer hourly wage it will print &quot;Inconsistent data&quot;<br><br>An example is given in the following table: <br>","type":"description","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\njob1 6\njob2 5\njob8 4\njob10 3\n. 100\n13\njob3 1\njob2 2\n. 40\njob1 3\njob2 1\n. 100\njob1 1\njob3 2\njob2 3\n. 100\njob1 1\njob2 5\n. 80</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Incomplete data\n.\n         job3   20\n         job2   10\n         job1   30\n. </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Southeastern+Europe+2000&amp;source=1&amp;searchmode=source\"> Southeastern Europe 2000 </a> ","type":"source","format":"html"}]}