{"title":"Gizilch ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1416","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1416&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1416","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1416"},"statement":[{"title":"Problem Description","content":"The game of gizilch has very simple rules.  First 100 grapes are labeled, in nontoxic ink, with the numbers 1 to 100.  Then, with a cry of ``GIZILCH!&apos;&apos;, the referee fires the grapes up into the air with a giant gizilcher.  The two players, who each start with a score of  ``1&apos;&apos;, race to eat the falling (or, shortly thereafter, fallen) grapes and, at the same time, multiply their scores by the numbers written on the grapes they eat.  After a minute, the hungry squirrels are let loose to finish the remaining grapes, and each contestant reports his score, the product of the numbers on the grapes he&apos;s eaten.  The unofficial winner is the player who announces the highest score. <br>Inevitably, though, disputes arise, and so the official winner is not determined until the disputes are resolved.  The player who claims the lower score is entitled to challenge his opponent&apos;s score.  The player with the lower score is presumed to have told the truth, because if he were to lie about his score, he would surely come up with a bigger better lie.  The challenge is upheld if the player with the higher score has a score that cannot be achieved with grapes not eaten by the challenging player.  So, if the challenge is successful, the player claiming the lower score wins. <br><br>So, for example, if one player claims 343 points and the other claims 49, then clearly the first player is lying; the only way to score 343 is by eating grapes labeled 7 and 49, and the only way to score 49 is by eating a grape labeled 49.  Since each of two scores requires eating the grape labeled 49, the one claiming 343 points is presumed to be lying. <br><br>On the other hand, if one player claims 162 points and the other claims 81, it is possible for both to be telling the truth (e.g. one eats grapes 2, 3 and 27, while the other eats grape 81), so the challenge would not be upheld. <br><br>Unfortunately, anyone who is willing to referee a game of gizilch is likely to have himself consumed so many grapes (in a liquid form) that he or she could not reasonably be expected to perform the intricate calculations that refereeing requires.  Hence the need for you, sober programmer, to provide a software solution. <br>","type":"description","format":"html"},{"title":"Input","content":"Pairs of unequal, positive numbers, with each pair on a single line, that are claimed scores from a game of gizilch. <br>","type":"input_format","format":"html"},{"title":"Output","content":"Numbers, one to a line, that are the winning scores, assuming that the player with the lower score always challenges the outcome. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">343 49 \n3599 610 \n62 36 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">49 \n610 \n62 </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%D2%BB%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#xFFFD;&#xFFFD;&#xFFFD;&#x6BC;&#xFFFD;&#x475;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x3F0;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x4BB;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}