{"title":"Cipher","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1439","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1439&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1439","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1439"},"statement":[{"title":"Problem Description","content":"Bob and Alice started to use a brand-new encoding scheme. Surprisingly it is not a Public Key Cryptosystem, but their encoding and decoding is based on secret keys. They chose the secret key at their last meeting in Philadelphia on February 16th, 1996. They chose as a secret key a sequence of n distinct integers, a1 ; . . .; an, greater than zero and less or equal to n. The encoding is based on the following principle. The message is written down below the key, so that characters in the message and numbers in the key are correspondingly aligned. Character in the message at the position i is written in the encoded message at the position ai, where ai is the corresponding number in the key. And then the encoded message is encoded in the same way. This process is repeated k times. After kth encoding they exchange their message.<br><br>The length of the message is always less or equal than n. If the message is shorter than n, then spaces are added to the end of the message to get the message with the length n.<br><br>Help Alice and Bob and write program which reads the key and then a sequence of pairs consisting of k and message to be encoded k times and produces a list of encoded messages. <br><br>","type":"description","format":"html"},{"title":"Input","content":"The input file consists of several blocks. Each block has a number 0 &lt; n &lt;= 200 in the first line. The next line contains a sequence of n numbers pairwise distinct and each greater than zero and less or equal than n. Next lines contain integer number k and one message of ascii characters separated by one space. The lines are ended with eol, this eol does not belong to the message. The block ends with the separate line with the number 0. After the last block there is in separate line the number 0. <br>","type":"input_format","format":"html"},{"title":"Output","content":"Output is divided into blocks corresponding to the input blocks. Each block contains the encoded input messages in the same order as in input file. Each encoded message in the output file has the lenght n. After each block there is one empty line. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10\n4 5 3 7 2 8 1 6 10 9\n1 Hello Bob\n1995 CERC\n0\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">BolHeol  b\nC RCE</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A85%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#xFFFD;&#xFFFD;&#xFFFD;&#x6BC;&#xFFFD;&#x475;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x3F0;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;5&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}