{"title":"Department","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1440","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1440&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1440","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1440"},"statement":[{"title":"Problem Description","content":"The Department of Security has a new headquarters building. The building has several floors, and on each floor there are rooms numbered xxyy where yy stands for the room number and xx for the floor number, 0 &lt; xx; yy &lt;= 10. The building has `pater-noster&apos; elevator, i.e. elevator build up from several cabins running all around. From time to time the agents must visit the headquarters. During their visit they want to visit several rooms and in each room they want to stay for some time. Due to the security reasons, there can be only one agent in the same room at the same time, The same rule applies to the elevators. The visits are planned in the way ensuring they can be accomplished within one day. Each agent visits the headquarters at most once a day.<br><br>Each agent enters the building at the 1st floor, passes the reception and then starts to visit the rooms according to his/her list. Agents always visit the rooms by the increasing room numbers. The agents form a linear hierarchy according to which they have assigned their one letter personal codes. The agents with higher seniority have lexicographically smaller codes. No two agents have the same code.<br><br>If more then one agent want to enter a room, or an elevator, the agents have to form a queue. In each queue, they always stand according to their codes. The higher the seniority of the agent, the closer to the top of the queue he stands. Every 5 s (seconds) the first agent in the queue in front of the elevator enters the elevator. After visiting the last room in the headquarters each agent uses if necessary elevator to the first floor and exits the building.<br><br>The times necessary to move from a certain point in the headquarters to another are set as follows: Entering the building, i.e. passing the reception and reaching the elevator, or a room on the first floor takes 30 s. Exiting the building, i.e. stepping out of the elevator or a room on the first floor and passing the reception takes also 30 s. On the same floor, the transfer from the elevator to the room (or to the queue in front of the room), or from the room to the elevator (or to the queue in front of the elevator), or from one room to another (or to the queue in front of the room) takes 10 s. The transfer from one floor to the next floor above or below in an elevator takes 30 s. Write a program that determines time course of agent&apos;s visits in the headquarters. <br><br>","type":"description","format":"html"},{"title":"Input","content":"The input file contains the descriptions of n &gt;= 0 visits of different agents. The first line of the description of each visit consists of agent&apos;s one character code C, C = A, . . ., Z, and the time when the agent enters the headquarters. The time is in the format HH:MM:SS (hours, minutes, seconds). The next lines (there will be at least one) contain the room number, and the length of time intended to stay in the room, time is in seconds. Each room is in a separate line. The list of rooms is sorted according to the increasing room number. The list of rooms ends by the line containing 0. The list of the descriptions of visits ends by the line containing the character dot. ","type":"input_format","format":"html"},{"title":"Output","content":"The output contains detailed records of each agent&apos;s visit in the headquarters. For each agent, there will be a block. Blocks are ordered in the order of increasing agent&apos;s codes. Blocks are separated by an empty line. After the last block there is an empty line too. The first line of a block contains the code of agent. Next lines contain the starting and ending time (in format HH:MM:SS) and the descriptions of his/her activity. Time data will be separated by one blank character. Description will be separated from time by one blank character. Description will have a form Entry, Exit or Message. The Message can be one of the following: Waiting in elevator queue, Waiting in front of room RoomNumber, Transfer from room RoomNumber to room RoomNumber, Transfer from elevator to room RoomNumber, Transfer from RoomNumber to elevator, Stay in room RoomNumber, Stay in elevator. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">A 10:00:00\n0101 100\n0110 50\n0202 90\n0205 50\n0\nB 10:01:00\n0105 100\n0201 5\n0205 200\n0\n.</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">A\n10:00:00 10:00:30 Entry\n10:00:30 10:02:10 Stay in room 0101\n10:02:10 10:02:20 Transfer from room 0101 to room 0110\n10:02:20 10:03:10 Stay in room 0110\n10:03:10 10:03:20 Transfer from room 0110 to elevator\n10:03:20 10:03:50 Stay in elevator\n10:03:50 10:04:00 Transfer from elevator to room 0202\n10:04:00 10:05:30 Stay in room 0202\n10:05:30 10:05:40 Transfer from room 0202 to room 0205\n10:05:40 10:07:40 Waiting in front of room 0205\n10:07:40 10:08:30 Stay in room 0205\n10:08:30 10:08:40 Transfer from room 0205 to elevator\n10:08:40 10:09:10 Stay in elevator\n10:09:10 10:09:40 Exit\n\nB\n10:01:00 10:01:30 Entry\n10:01:30 10:03:10 Stay in room 0105\n10:03:10 10:03:20 Transfer from room 0105 to elevator\n10:03:20 10:03:25 Waiting in elevator queue\n10:03:25 10:03:55 Stay in elevator\n10:03:55 10:04:05 Transfer from elevator to room 0201\n10:04:05 10:04:10 Stay in room 0201\n10:04:10 10:04:20 Transfer from room 0201 to room 0205\n10:04:20 10:07:40 Stay in room 0205\n10:07:40 10:07:50 Transfer from room 0205 to elevator\n10:07:50 10:08:20 Stay in elevator\n10:08:20 10:08:50 Exit</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A85%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;5&#xFF09; </a> ","type":"source","format":"html"}]}