{"title":"Fourier's Lines","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1447","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1447&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1447","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1447"},"statement":[{"title":"Problem Description","content":"Joseph Fourier was a great mathematician and physicist and is well known for his mathematic series. Among all the nineteen children in his family, Joseph was the youngest and the smartest. He began to show his interest in mathematics when he was very young. After he grew up, he often corresponded with C. Bonard (a professor of mathematics at Auxerre) by exchanging letters. <br><br>In one letter written to Bonard, Fourier asked a question: how to draw 17 lines on a plane to make exactly 101 crossings, where each crossing belongs to exactly two lines. Obviously, this is an easy problem, and Figure-1 is a solution that satisfies his requirement. Now the problem for you is a universal one. Can we draw N lines on a plane to make exactly M crossings, where each crossing belongs to exactly two lines? If we can, how many pieces, at most, can these lines cut the plane into?<br><img style=\"max-width:100%;\" src=\"/data/images/1447-1.jpg\"><br>","type":"description","format":"html"},{"title":"Input","content":"The input may have several sets of test data. Each set is one line containing two integers N and M (1 &lt;= N &lt;= 100, 0 &lt;= M &lt;= 10000), separated by a space. The test data is followed by a line containing two zeros, which indicates the end of input and should not be processed as a set of data.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output one line for each set of input in the following format:<br><br>Case i: N lines cannot make exactly M crossings. <br><br>if the drawing of these lines is impossible; <br><br>or: <br><br>Case i: N lines with exactly M crossings can cut the plane into K pieces at most. <br><br>Note: Even if N or M equals to one, you should use the words &quot;lines&quot; and &quot;crossings&quot; in your output. <br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3\n4 6\n4 2\n5 11\n17 101\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 4 lines with exactly 3 crossings can cut the plane into 8 pieces at most.\nCase 2: 4 lines with exactly 6 crossings can cut the plane into 11 pieces at most.\nCase 3: 4 lines cannot make exactly 2 crossings.\nCase 4: 5 lines cannot make exactly 11 crossings.\nCase 5: 17 lines with exactly 101 crossings can cut the plane into 119 pieces at most.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%C1%F9%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x516D;&#xFF09; </a> ","type":"source","format":"html"}]}