{"title":"The Treasure","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1448","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1448&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1448","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1448"},"statement":[{"title":"Problem Description","content":"We have arrived at the age of the Internet. Many software applications have transformed from stand-alone to online applications. Computer games are following this trend as well. Online games are becoming more and more popular, not only because they are more intelligent, but also because they can bring great profits. &quot;The computer game industry is developing rapidly in China. Online game revenues amounted to 1.3 billion Yuan last year and are expected to reach 6.7 billion Yuan by 2007.&quot; reported by China Daily in 2004. <br><br>However, good games originate from good programmers. We take for example that there is a RPG (Role Playing Game) and your boss asks you to implement some tasks. For simplicity&apos;s sake, we assume there are two kinds of roles in this game: one is player and the other is monster. You should help the player to achieve the goal: reach the place where treasure is positioned as early as possible and get the treasure.<br><br>The map of the game is a matrix of N * M identical cells. Some cells are passable blocks, and others are non-passable rocks. At any time, there is at most one role occupying a block. At the beginning, the time is set to 0, and the player is at a certain block. He then moves towards the treasure. At each turn, we have some rules: <br><br>1) The player can stay in the same block during the next one-second time duration, or he can walk or run towards the east, south, west, north, northeast, northwest, southeast, and southwest. <br><br><img style=\"max-width:100%;\" src=\"/data/images/1448-1.jpg\"><br><br>2) With walking, the player can arrive at the corresponding passable blocks around him (See Fig.1). Each move takes 1 second. <br><br>3) With running, the player can arrive at the corresponding passable blocks 2 cells away from him (See Fig.2). Each run takes 1 second. As demonstrated in Fig.3, if a neighbor cell is not passable, the player cannot run in that direction. For example, if cell 2 is a rock, running from 1 to 3 is impossible. <br><br>4) The monsters are classified into aggressive and non-aggressive. If a monster occupies a cell, the player cannot move into that cell or run through that cell. In addition, the player cannot move into the cells surrounding an aggressive monster, because it will attack the player near it. For example, in Fig.4, if there is an aggressive monster in 5, then the cell 1, 2, 3, 4, 6, 7, 8 and 9 are in its attacking region, so the player cannot stay in or pass through these cells. <br><br>5) Monsters change their positions each turn. Each monster appears by its position sequence iteratively. That&apos;s to say, given the position sequence of monster i: (x1, y1), (x2, y2), ..., (xs, ys), its initial position is (x1, y1) at time 0, then it appears in (x2, y2) at time 1, and so on. When monster i arrives at (xs, ys) at time s-1, it will arrive in (x1, y1) at time s, and start to repeat. <br>At the start of each turn, all the monsters change their positions first (the way of changing is given above). If a monster appears in the player&apos;s cell, or if an aggressive monster appears near the player to put him in its attacking region, the player will die, and the goal cannot be achieved. After all the monsters change their positions, the player makes a move or stays in the same cell. In his move, the moving path should not be occupied by any rocks or monsters or in the attacking region of any aggressive monsters. When counting the total time, we can neglect the time between monsters&apos; position change and the player&apos;s move. Given the map of the game, the player&apos;s starting position, the treasure position and all the monsters&apos; positions in every second, your task is to write a program to find the minimum time that the player gets the treasure. <br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of several test cases. The first line of each case contains two integers N and M (1 &lt;= N, M &lt;= 100), where N is the height of the map and M is the width of the map. This is followed by N lines each containing M characters representing the map. A &apos;#&apos; represents a rock, a &apos;.&apos; is a free block, &apos;p&apos; is the starting position of the player, &apos;t&apos; is the position of the treasure, &apos;n&apos; is the initial position of a non-aggressive monster, and an &apos;a&apos; stands for the initial position of an aggressive monster. <br><br>The cell (i, j) is the j-th cell on the i-th row counting from left to right. The rows are counted from 1 to N starting from the first line of the matrix. We can number all the monsters as 1, 2, 3&#x2026; according to their initial position, sorting first by row, then by column. The (n+2)-th line contains an integer p (0 &lt;= p &lt;= 100), which is the total number of monsters (i.e. the total number of &apos;n&apos;s and &apos;a&apos;s in the matrix). It is followed by p lines each specifying a monster&apos;s position sequence in the following format: the i-th (1 &lt;= i &lt;= p) line corresponds to monster i, which begins with an integer s (1 &lt;= s &lt;= 100), meaning the length of position sequence. Then s pairs of integers x1, y1, x2, y2, &#x2026;, xs, ys are followed, separated by blanks. Each pair is a free block in the map, (i.e. a monster never goes to a rock cell). <br><br>It is assured that none of the aggressive monsters&apos; initial position is around the player. Two consecutive cases are separated by a blank line. The input is terminated by a line containing a pair of zeros. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output the minimum total time required for the player to get the treasure, in seconds. If it&apos;s not possible to get the treasure, or the minimum required time is greater than 100 seconds, please print a line just containing the string &quot;impossible&quot;. Two consecutive cases should be separated by a blank line.<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 8\n#.#####.\n#.t#..p.\n#..#....\n..#a.#.#\n#...##.n\n.#......\n........\n2\n2 4 4 5 4\n3 5 8 6 8 5 7\n\n3 3\np#.\n##.\nt..\n0\n\n2 2\n#t\np#\n0\n\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8\n\nimpossible\n\n1\n\n\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first sample case, the player can follow (2,7), (4,7), stay in (4,7), (6,7), (7,6), (7,4), (5,2), (3,2) and (2,3) \nto get the treasure with the minimum time (8 seconds). \n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%C1%F9%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x516D;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}