{"title":"Spiderman","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1449","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1449&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1449","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1449"},"statement":[{"title":"Problem Description","content":"Dr. Octopus kidnapped Spiderman&apos;s girlfriend M.J. and kept her in the West Tower. Now the hero, Spiderman, has to reach the tower as soon as he can to rescue her, using his own weapon, the web. <br><br>From Spiderman&apos;s apartment, where he starts, to the tower there is a straight road. Alongside of the road stand many tall buildings, which are definitely taller or equal to his apartment. Spiderman can shoot his web to the top of any building between the tower and himself (including the tower), and then swing to the other side of the building. At the moment he finishes the swing, he can shoot his web to another building and make another swing until he gets to the west tower. Figure-1 shows how Spiderman gets to the tower from the top of his apartment - he swings from A to B, from B to C, and from C to the tower. All the buildings (including the tower) are treated as straight lines, and during his swings he can&apos;t hit the ground, which means the length of the web is shorter or equal to the height of the building. Notice that during Spiderman&apos;s swings, he can never go backwards.<br><br><img style=\"max-width:100%;\" src=\"/data/images/1449-1.jpg\"><br><br>You may assume that each swing takes a unit of time. As in Figure-1, Spiderman used 3 swings to reach the tower, and you can easily find out that there is no better way.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains the number of test cases K (1 &lt;= K &lt;= 20). Each case starts with a line containing a single integer N (2 &lt;= N &lt;= 5000), the number of buildings (including the apartment and the tower). N lines follow and each line contains two integers Xi, Yi, (0 &lt;= Xi, Yi &lt;= 1000000) the position and height of the building. The first building is always the apartment and the last one is always the tower. The input is sorted by Xi value in ascending order and no two buildings have the same X value.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing the minimum number of swings (if it&apos;s possible to reach the tower) or -1 if Spiderman can&apos;t reach the tower.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6\n0 3\n3 5\n4 3\n5 5\n7 4\n10 4\n3\n0 3\n3 4\n10 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n-1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%C1%F9%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x516D;&#xFF09; </a> ","type":"source","format":"html"}]}