{"title":"Pipe","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1454","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1454&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1454","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1454"},"statement":[{"title":"Problem Description","content":"The GX Light Pipeline Company started to prepare bent pipes for the new transgalactic light pipeline. During the design phase of the new pipe shape the company ran into the problem of determining how far the light can reach inside each component of the pipe. Note that the material which the pipe is made from is not transparent and not light reflecting.<br><br><img style=\"max-width:100%;\" src=\"/data/images/1454-1.gif\"><br><br>Each pipe component consists of many straight pipes connected tightly together. For the programming purposes, the company developed the description of each component as a sequence of points [x1; y1], [x2; y2], . . ., [xn; yn], where x1 &lt; x2 &lt; . . . xn . These are the upper points of the pipe contour. The bottom points of the pipe contour consist of points with y-coordinate decreased by 1. To each upper point [xi; yi] there is a corresponding bottom point [xi; (yi)-1] (see picture above). The company wants to find, for each pipe component, the point with maximal x-coordinate that the light will reach. The light is emitted by a segment source with endpoints [x1; (y1)-1] and [x1; y1] (endpoints are emitting light too). Assume that the light is not bent at the pipe bent points and the bent points do not stop the light beam. <br><br>","type":"description","format":"html"},{"title":"Input","content":"The input file contains several blocks each describing one pipe component. Each block starts with the number of bent points 2 &lt;= n &lt;= 20 on separate line. Each of the next n lines contains a pair of real values xi, yi separated by space. The last block is denoted with n = 0. <br>","type":"input_format","format":"html"},{"title":"Output","content":"The output file contains lines corresponding to blocks in input file. To each block in the input file there is one line in the output file. Each such line contains either a real value, written with precision of two decimal places, or the message Through all the pipe.. The real value is the desired maximal x-coordinate of the point where the light can reach from the source for corresponding pipe component. If this value equals to xn, then the message Through all the pipe. will appear in the output file. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n0 1\n2 2\n4 1\n6 4\n6\n0 1\n2 -0.6\n5 -4.45\n7 -5.57\n12 -10.8\n17 -16.55\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4.67\nThrough all the pipe.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%C6%DF%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#xFFFD;&#xFFFD;&#xFFFD;&#x6BC;&#xFFFD;&#x475;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x3F0;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x7E3;&#xFFFD; </a> ","type":"source","format":"html"}]}