{"title":"Tax Avoidance","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1458","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1458&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1458","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1458"},"statement":[{"title":"Problem Description","content":"Now that inflation is under control the tax base is fairly stable, and hence the Infernal Revenue Department is desperately seeking more ways of extracting more money from the citizenry. One proposal is to institute a capital gains tax - in particular a tax made on the profit realised by buying and selling shares on the Stock Exchange. This seems to be a safe bet, since most ordinary people are not involved and therefore it will only affect the ``rich&apos;&apos; who can afford to pay. However, the Society of Creative Acountants has heard of these proposals and realise that it could well affect them.<br><br>The problem arises from the fact that shares do not have a fixed (or even steadily moving) price, and thus one has to determine which of the entire portfolio were sold. IRD have identified two ways of determining this; called respectively First Bought, First Sold (FBFS) and Last Bought, First Sold (LBFS). These are most easily explained by an example. Assume that you bought 10000 shares at 100c per share, then bought another 10000 at 90c per share and then sold 15000 shares at 95c per share. The sale will realise $14,250. Under the FBFS method you will be deemed to have sold the oldest stocks first so they will have cost you $10,000 plus $4,500, i.e. $14,500. You have therefore suffered a loss of of $250 and would not be liable for tax. Under the LBFS scheme, you are deemed to have sold the youngest shares first and hence these would have cost $9000 plus $5000, a total of $14,000, meaning you would have to pay tax on $250.<br><br>Write a program that will read in a series of share transactions, and for each share determine which method is the optimum. The optimum is the one that minimises the profit (if both earn a profit) or maximises the loss (if at least one makes a loss). In case of a tie, choose LBFS.<br><br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of a series of sets of share transactions. Each set will start with the name of the share (3 upper case characters) on a line by itself. This name will be unique in the data set. This will be followed by a series of buy and sell transactions. Each transaction will be on a line by itself and will start with one of the letters `B&apos; (Buy) or `S&apos; (Sell), followed by the number of shares involved (up to 100,000) and the price (in cents, up to 10,000) separated by one or more spaces. You will never sell more shares than you own. Each set of transactions will be terminated by a line starting with an `E&apos;. The file will be terminated by a line consisting of a single #.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each set of transactions. Each line will consist of the share name, a single space, the chosen method, a single space and the profit or loss on the overall transaction (in dollars). This should be in a field 9 characters wide with two digits after the decimal point.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">PCS\nB 100 10000\nB 100  9000\nS 150  9500\nE\nCSC\nB  100 10000\nS   50 11000\nE\n#</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">PCS FBFS   -250.00\nCSC LBFS    500.00</div></pre>","type":"example","format":"html"},{"title":"Author","content":"1002","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%B0%CB%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#xFFFD;&#xFFFD;&#xFFFD;&#x6BC;&#xFFFD;&#x475;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x3F0;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x2E3;&#xFFFD; </a> ","type":"source","format":"html"}]}