{"title":"Anniversaries","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1463","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1463&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1463","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1463"},"statement":[{"title":"Problem Description","content":"As far as our perceptions are concerned, a year runs from the midnight beginning the first of January to the midnight ending the 31st of December. Thus we can say that a year consists of:<br>12 months (of differing lengths) <br>52 (and a bit) weeks <br>365 days <br>8,760 hours <br>525,600 minutes <br>31,536,000 seconds. <br>Most of these numbers need to be adjusted in leap years.<br><br>A k&apos;th anniversary of a date is usually defined as the same date (month and day) k years later, thus the 10th anniversary of 17th May 1983 is 17th May 1993. However we can also define other types of `versaries&apos; - the 1 week-versary of 28th February 1984 is 6th March 1984.<br><br>If we define a convention of naming dates (and times if necessary) by specifying successively smaller periods separated by colons (that is as yyyy:mm:dd:hh:mm:ss) we can label the units using the same convention, that is y for years, d for days, w for weeks, h for hours, m for minutes and s for seconds (we cannot use months, they are too variable). We can then summarise the above examples as:<br>1983:5:17 + 10y -&gt; 1993:5:17<br>1984:2:28 + 1w -&gt; 1984:3:6 <br>Note that the specification of an event has to be as least as precise (that is employ units at least as small) as the specification of the desired versary.<br><br>Write a program that will read in details of events and desired versaries and calculate the required date (and time if necessary). Bear in mind that a year is a leap year if it is divisible by 4 unless it is divisible by 100 as well, in which case it is only a leap year if it is divisible by 400; thus 1984 and 2000 are leap years, but 1900 is not.<br><br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of a series of lines, each line a specification of an event and a desired versary. The input will follow the format shown below, except that where one space is shown there may be more than one space. The event will be specified at least to the same precision as the desired versary. All events will start in this century, and no versary will be more than 100 years (or equivalent). Note that midnight starts a day rather than terminates it and thus is written as 0:0:0 and not as 24:0:0. The file will be terminated by a line consisting of a single 0.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each line of the input. Each line will consist of the specification of the desired versary, to the same precision as given in the input, in the format shown below.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1983:5:17    10 y\n1984:2:28    1   w\n1993:7:25:13:23 5 h\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1983:5:17 + 10y -&gt; 1993:5:17\n1984:2:28 + 1w -&gt; 1984:3:6\n1993:7:25:13:23 + 5h -&gt; 1993:7:25:18:23</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%B0%CB%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x516B;&#xFF09; </a> ","type":"source","format":"html"}]}