{"title":"Telephone Numbers","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1464","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1464&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1464","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1464"},"statement":[{"title":"Problem Description","content":"Many New Zealand telephones now have letters printed in association with the digits. This allows firms and organisations to ``customise&apos;&apos; their telephone numbers by incorporating their name or some other word. Thus one might be able to obtain information on training as a nurse by dialling 0-800-NURSING, or find out about courses at local universities by dialling 0-800-4-OTAGOU or 0-800-AUCKUNI.<br><br>There are two related problems associated with this approach - one is relatively easy to solve while the other is a little more difficult. If one can elicit the cooperation of one&apos;s local telephone company, then one can merely purchase a suitable telephone number that matches your word. However, if you already have a telephone number, then one needs to find the `best&apos; word that matches it.<br><br>Write a program that will do this. Input will be a list of words from a dictionary and a list of telephone numbers. Your program must determine suitable candidate words that fit all or part of the given telephone numbers. Since suitability is somewhat subjective the only criterion you should apply is length - only the longest matching words are considered candidates. Note also that matches can only apply at the end, sequences such as 5COSC23 are unacceptable.<br><br>For this problem assume the following allocation of letters to digits: <br><br>1  Q Z      2  A B C    3  D E F <br>4  G H I    5  J K L    6  M N O <br>7  P R S    8  T U V    9  W X Y <br><br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of two parts. The first part will contain up to 20000 words ranging in length from 4 to 7 upper case letters, one word per line. These words form the dictionary, and will not necessarily be in English. The rest of the file will contain a series of telephone numbers, each containing 7 digits and punctuated conventionally. The file will be terminated by a line consisting of a single #.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each number in the input. Each line will consist of the original telephone number, a colon, a space and one or more words or number-word combinations. There must be a hyphen between numbers and letters. If there are several matching words, the words should appear in alphabetic sequence. If there are no matching words, then the message ``No words&apos;&apos; should appear. Follow the spacing and layout shown in the example.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">OTAGOU\nUBINT\nAUCKUNI\nMUBGOT\n468-2468\n123-4567\n282-5864\n#</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">468-2468: 4-MUBGOT 4-OTAGOU\n123-4567: No words\n282-5864: AUCKUNI</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%B0%CB%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x516B;&#xFF09; </a> ","type":"source","format":"html"}]}