{"title":"Triangles","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1467","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1467&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1467","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1467"},"statement":[{"title":"Problem Description","content":"It is always very nice to have little brothers or sisters. You can tease them, lock them in the bathroom or put red hot chili in their sandwiches. But there is also a time when all meanness comes back! <br><br>As you know, in one month it is Christmas and this year you are honored to make the big star that will be stuck on the top of the Christmas tree. But when you get the triangle-patterned silver paper you realize that there are many holes in it. Your little sister has already cut out smaller triangles for the normal Christmas stars. Your only chance is to find an algorithm that tells you for each piece of silver paper the size of the largest remaining triangle. <br><br>Given a triangle structure with white and black fields inside you must find the largest triangle area of white fields, as shown in the following figure. <br><img style=\"max-width:100%;\" src=\"data/images/1467-1.gif\"><br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several triangle descriptions. The first line of each description contains an integer n (1 &lt;= n &lt;= 100), which gives the height of the triangle. The next n lines contain characters of the set {space, #, -} representing the rows of the triangle, where `#&apos; is a black and `-&apos; a white field. The spaces are used only to keep the triangle shape in the input by padding at the left end of the lines. (Compare with the sample input. The first test case corresponds to the figure.) <br>For each triangle, the number of the characters `#&apos; and `-&apos; per line is odd and decreases from 2n - 1 down to 1. <br><br>The input is terminated by a description starting with n = 0. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each triangle in the input, first output the number of the triangle, as shown in the sample output. Then print the line ``The largest triangle area is a.&apos;&apos;, where a is the number of fields inside the largest triangle that consists only of white fields. Note that the largest triangle can have its point at the top, as in the second case of the sample input. <br><br>Output a blank line after each test case. <br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n#-##----#\n -----#-\n  ---#-\n   -#-\n    -\n4\n#-#-#--\n #---#\n  ##-\n   -\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Triangle #1\nThe largest triangle area is 9.\n\nTriangle #2\nThe largest triangle area is 4.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%BE%C5%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x4E5D;&#xFF09; </a> ","type":"source","format":"html"}]}