{"title":"Instant Complexity","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1468","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1468&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1468","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1468"},"statement":[{"title":"Problem Description","content":"Analyzing the run-time complexity of algorithms is an important tool for designing efficient programs that solve a problem. An algorithm that runs in linear time is usually much faster than an algorithm that takes quadratic time for the same task, and thus should be preferred. <br><br>Generally, one determines the run-time of an algorithm in relation to the `size&apos; n of the input, which could be the number of objects to be sorted, the number of points in a given polygon, and so on. Since determining a formula dependent on n for the run-time of an algorithm is no easy task, it would be great if this could be automated. Unfortunately, this is not possible in general, but in this problem we will consider programs of a very simple nature, for which it is possible. Our programs are built according to the following rules (given in BNF), where &lt; number &gt; can be any non-negative integer: <br><br>&lt; Program &gt; ::= &quot;BEGIN&quot; &lt; Statementlist &gt; &quot;END&quot; <br>&lt; Statementlist &gt; ::= &lt; Statement &gt; | &lt; Statement &gt; &lt; Statementlist &gt; <br>&lt; Statement &gt; ::= &lt; LOOP-Statement &gt; | &lt; OP-Statement &gt; <br>&lt; LOOP-Statement &gt; ::= &lt; LOOP-Header &gt; &lt; Statementlist &gt; &quot;END&quot; <br>&lt; LOOP-Header &gt; ::= &quot;LOOP&quot; &lt; number &gt; | &quot;LOOP n&quot; <br>&lt; OP-Statement &gt; ::= &quot;OP&quot; &lt; number &gt;<br><br>The run-time of such a program can be computed as follows: the execution of an OP-statement costs as many time-units as its parameter specifies. The statement list enclosed by a LOOP-statement is executed as many times as the parameter of the statement indicates, i.e., the given constant number of times, if a number is given, and n times, if n is given. The run-time of a statement list is the sum of the times of its constituent parts. The total run-time therefore generally depends on n. <br>","type":"description","format":"html"},{"title":"Input","content":"The input starts with a line containing the number k of programs in the input. Following this are k programs which are constructed according to the grammar given above. Whitespace and newlines can appear anywhere in a program, but not within the keywords BEGIN, END, LOOP and OP or in an integer value. The nesting depth of the LOOP-operators will be at most 10. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each program in the input, first output the number of the program, as shown in the sample output. Then output the run-time of the program in terms of n; this will be a polynomial of degree Y &lt;= 10. Print the polynomial in the usual way, i.e., collect all terms, and print it in the form ``Runtime = a*n^10+b*n^9+ . . . +i*n^2+ j*n+k&apos;&apos;, where terms with zero coefficients are left out, and factors of 1 are not written. If the runtime is zero, just print ``Runtime = 0&apos;&apos;. <br>Output a blank line after each test case. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nBEGIN\nLOOP n\nOP 4\nLOOP 3\nLOOP n\nOP 1\nEND\nOP 2\nEND\nOP 1\nEND\nOP 17\nEND\nBEGIN\nOP 1997 LOOP n LOOP n OP 1 END END\nEND</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Program #1\nRuntime = 3*n^2+11*n+17\n\nProgram #2\nRuntime = n^2+1997</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%BE%C5%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#xFFFD;&#xFFFD;&#xFFFD;&#x6BC;&#xFFFD;&#x475;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x3F0;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x163;&#xFFFD; </a> ","type":"source","format":"html"}]}