{"title":"Video Surveillance","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1469","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1469&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1469","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1469"},"statement":[{"title":"Problem Description","content":"A friend of yours has taken the job of security officer at the Star-Buy Company, a famous depart- ment store. One of his tasks is to install a video surveillance system to guarantee the security of the customers (and the security of the merchandise of course) on all of the store&apos;s countless floors. As the company has only a limited budget, there will be only one camera on every floor. But these cameras may turn around to look in every direction. <br><br>The first problem is to choose where to install the camera for every floor. The only requirement is that every part of the room must be visible from there. In the following figure the left floor can be completely surveyed from the position indicated by a dot, while for the right floor, there is no such position, the given position failing to see the lower left part of the floor. <br><br><img style=\"max-width:100%;\" src=\"data/images/1469-1.gif\"><br><br>Before trying to install the cameras, your friend first wants to know whether there is indeed a suitable position for them. He therefore asks you to write a program that, given a ground plan, de- termines whether there is a position from which the whole floor is visible. All floor ground plans form rectangular polygons, whose edges do not intersect each other and touch each other only at the corners. <br><br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several floor descriptions. Every description starts with the number n of vertices that bound the floor (4 &lt;= n &lt;= 100). The next n lines contain two integers each, the x and y coordinates for the n vertices, given in clockwise order. All vertices will be distinct and at corners of the polygon. Thus the edges alternate between horizontal and vertical. <br><br>A zero value for n indicates the end of the input. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For every test case first output a line with the number of the floor, as shown in the sample output. Then print a line stating &quot;Surveillance is possible.&apos;&apos; if there exists a position from which the entire floor can be observed, or print &quot;Surveillance is impossible.&apos;&apos; if there is no such position. <br><br>Print a blank line after each test case. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n0 0\n0 1\n1 1\n1 0\n8\n0 0\n0 2\n1 2\n1 1\n2 1\n2 2\n3 2\n3 0\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Floor #1\nSurveillance is possible.\n\nFloor #2\nSurveillance is impossible.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%BE%C5%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x4E5D;&#xFF09; </a> ","type":"source","format":"html"}]}