{"title":"Island of Logic","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1470","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1470&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1470","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1470"},"statement":[{"title":"Problem Description","content":"The Island of Logic has three kinds of inhabitants: divine beings that always tell the truth, evil beings that always lie, and human beings that are truthful during the day and lie at night. Every inhabitant recognizes the type of every other inhabitant. <br>A social scientist wants to visit the island. Because he is not able to distinguish the three kinds of beings only from their looks, he asks you to provide a communication analyzer that deduces facts from conversations among inhabitants. The interesting facts are whether it is day or night and what kind of beings the speakers are. <br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several descriptions of conversations. Each description starts with an integer n, the number of statements in the conversation. The following n lines each contain one statement by an inhabitant. Every statement line begins with the speaker&apos;s name, one of the capital letters A, B, C, D, E, followed by a colon `:&apos;. Next is one of the following kinds of statements: <br><br>I am [not] ( divine | human | evil | lying ). <br><br>X is [not] ( divine | human | evil | lying ). <br><br>It is ( day | night ). <br><br>Square brackets [] mean that the word in the brackets may or may not appear, round brackets () mean that exactly one of the alternatives separated by | must appear. X stands for some name from A, B, C, D, E. There will be no two consecutive spaces in any statement line, and at most 50 statements in a conversation. <br><br>The input is terminated by a test case starting with n = 0. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each conversation, first output the number of the conversation in the format shown in the sample output. Then print &quot;This is impossible.&apos;&apos;, if the conversation cannot happen according to the rules or &quot;No facts are deducible.&apos;&apos;, if no facts can be deduced. Otherwise print all the facts that can be deduced. Deduced facts should be printed using the following formats: <br><br>X is ( divine | human | evil ). <br><br>It is ( day | night ). <br><br>X is to be replaced by a capital letter speaker name. Facts about inhabitants must be given first (in alphabetical order), then it may be stated whether it is day or night. <br><br>The output for each conversation must be followed by a single blank line. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\nA: I am divine.\n1\nA: I am lying.\n1\nA: I am evil.\n3\nA: B is human.\nB: A is evil.\nA: B is evil.\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Conversation #1\nNo facts are deducible.\n\nConversation #2\nThis is impossible.\n\nConversation #3\nA is human.\nIt is night.\n\nConversation #4\nA is evil.\nB is divine.\n\n\nReasoning made easy \n\nTo make things clearer, we will show the reasoning behind the third input example, where A says ``I am evil.&apos;&apos;.\n What can be deduced from this? \nObviously A cannot be divine, since she would be lying, similarly A cannot be evil, since she would tell the truth. \nTherefore, A must be human, moreover, since she is lying, it must be night. So the correct output is as shown. \n\nIn the fourth input example, it is obvious that A is lying since her two statements are contradictory. \nSo, B can be neither human nor evil, and consequently must be divine. B always tells the truth, thus A must be evil. Voil&#x2018;a! </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%BE%C5%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x4E5D;&#xFF09; </a> ","type":"source","format":"html"}]}