{"title":"Scheduling Lectures","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1476","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1476&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1476","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1476"},"statement":[{"title":"Problem Description","content":"You are teaching a course and must cover n (1 &lt;= n &lt;= 1000) topics. The length of each lecture is L (1 &lt;= L &lt;= 500) minutes. The topics require t1, t2, ..., tn (1 &lt;= ti &lt;= L) minutes each. For each topic, you must decide in which lecture it should be covered. There are two scheduling restrictions: <br>1. Each topic must be covered in a single lecture. It cannot be divided into two lectures. This reduces discontinuity between lectures. <br>2. Topic i must be covered before topic i + 1 for all 1 &lt;= i &lt; n. Otherwise, students may not have the prerequisites to understand topic i + 1.<br><br>With the above restrictions, it is sometimes necessary to have free time at the end of a lecture. If the amount of free time is at most 10 minutes, the students will be happy to leave early. However, if the amount of free time is more, they would feel that their tuition fees are wasted. Therefore, we will model the dissatisfaction index (DI) of a lecture by the formula: <br><br><img style=\"max-width:100%;\" src=\"data/images/1476-1.gif\"><br><br>where C is a positive integer, and t is the amount of free time at the end of a lecture. The total dissatisfaction index is the sum of the DI for each lecture.<br><br>For this problem, you must find the minimum number of lectures that is needed to satisfy the above constraints. If there are multiple lecture schedules with the minimum number of lectures, also minimize the total dissatisfaction index. <br><br><br>This problem contains multiple test cases!<br><br>The first line of a multiple input is an integer N, then a blank line followed by N input blocks. Each input block is in the format indicated in the problem description. There is a blank line between input blocks.<br><br>The output format consists of N output blocks. There is a blank line between output blocks.<br><br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of a number of cases. The first line of each case contains the integer n, or 0 if there are no more cases. The next line contains the integers L and C. These are followed by n integers t1, t2, ..., tn. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, print the case number, the minimum number of lectures used, and the total dissatisfaction index for the corresponding lecture schedule on three separate lines. Output a blank line between cases. <br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n30 15\n10\n10\n10\n10\n10\n10\n10\n120 10\n80\n80\n10\n50\n30\n20\n40\n30\n120\n100\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n\nMinimum number of lectures: 2\nTotal dissatisfaction index: 0\n\nCase 2:\n\nMinimum number of lectures: 6\nTotal dissatisfaction index: 2700</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%CA%AE%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x5341;&#xFF09; </a> ","type":"source","format":"html"}]}