{"title":"Parallel Deadlock","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1478","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1478&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1478","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1478"},"statement":[{"title":"Problem Description","content":"A common problem in parallel computing is establishing proper communication patterns so that processors do not deadlock while either waiting to receive messages from other processors, or waiting for the sending of messages to other processors to complete. That is, one processor will not complete sending a message until it is received by the destination processor. Likewise, a receive cannot complete until a message is actually sent. <br><br>There are two modes of communication: blocking and non-blocking. A blocking send will not complete until a matching receive is performed at the destination processor. Likewise, a blocking receive will not complete until the matching send is performed by the source processor. Non- blocking actions will ``return&apos;&apos; immediately (i.e., allow the program to continue), but will not actually complete until the matching action is performed at the target. The matching action of a send is a receive (either blocking or non-blocking), and similarly, the matching action of a receive is a send (either blocking or non-blocking). <br><br><br>At the start of each timestep, each processor that is not blocked starts to run its next instruction. Processors that execute blocking instructions become blocked. Messages can be received at the end of the timestep in which they are sent, but may need to wait several timesteps until the recipient performs a matching receive. If the recipient of a message is waiting to receive from the sender, then the message is received in the same timestep. Messages are received in the order that they are sent. If all of the actions for a particular blocking instruction complete at the end of the timestep, then the processor that ran the instruction will be unblocked before the next timestep. <br><br><br>A correct program will terminate only when all of its actions have completed. Pending non-blocking operations must be completed before a program can terminate. <br><br><br>Your program will take in a list of processors and actions (no more than 100 for each processor), and determine if each processor finishes its program. If a given processor does not finish, it must print out which other processors are preventing it from finishing. <br><br><br>This problem contains multiple test cases!<br><br>The first line of a multiple input is an integer N, then a blank line followed by N input blocks. Each input block is in the format indicated in the problem description. There is a blank line between input blocks.<br><br>The output format consists of N output blocks. There is a blank line between output blocks.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line will be a single positive integer that tells how many processors will be listed. For each processor there will be one line containing the name of the processor (a single capital letter) followed by a positive integer, N . The following N lines will contain the instructions that comprise the program for that processor. <br><br>An instruction is of the form ``Mode Action Target(s)&apos;&apos; where ``Mode&apos;&apos; can be ``B&apos;&apos; or ``N&apos;&apos;, for blocking or non-blocking, respectively. ``Action&apos;&apos; can be ``S&apos;&apos; or ``R&apos;&apos;, for send or receive, respectively. ``Target(s)&apos;&apos; will be one or more processor names to which the action is to be addressed. No processor will be listed twice and a processor will never attempt any sort of communication with itself . A send to multiple targets will not complete until matching receives have been performed by all of the targets (and vice versa). <br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Given that instruction 1 occurs at t = 1, your program will output at which timestep each processor finishes. If a processor does not finish, you must output which processor are preventing that processor from finishing. Processors should be listed in alphabetical order, both for the list of processors and the sets of processors that prevent a processor from finishing. The list of processors preventing termination should list processors at most once and separate multiple processors with ``and&apos;&apos;. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\nI 5\nB S B P C\nN S B P C\nN R B\nB R P\nB R C\nB 2\nB R I\nB S I\nP 3\nN S I\nN R I\nB R I\nC 4\nN S I\nB R I\nB S P\nB R I</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">B finishes at t=4\nC never finishes because of P\nI never finishes because of B and C\nP finishes at t=5\n\n\n\n\nNotice how C&apos;s final blocking receive would be matched by a send on I if both instructions were executed. However, it never gets executed because it is stuck in the blocking send to P (that has no matching receive on P), therefore causing deadlock on I. </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%CA%EE%C6%DA%BC%AF%D1%B5%B6%D3%C1%B7%CF%B0%C8%FC%A3%A8%CA%AE%A3%A9&amp;source=1&amp;searchmode=source\"> ACM&#x6691;&#x671F;&#x96C6;&#x8BAD;&#x961F;&#x7EC3;&#x4E60;&#x8D5B;&#xFF08;&#x5341;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}