{"title":"Counterfeit Dollar","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1482","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1482&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1482","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1482"},"statement":[{"title":"Problem Description","content":"Sally Jones has a dozen Voyageur silver dollars. However, only eleven of the coins are true silver dollars; one coin is counterfeit even though its color and size make it indistinguishable from the real silver dollars. The counterfeit coin has a different weight from the other coins but Sally does not know if it is heavier or lighter than the real coins. <br><br>Happily, Sally has a friend who loans her a very accurate balance scale. The friend will permit Sally three weighings to find the counterfeit coin. For instance, if Sally weighs two coins against each other and the scales balance then she knows these two coins are true. Now if Sally weighs one of the true coins against a third coin and the scales do not balance then Sally knows the third coin is counterfeit and she can tell whether it is light or heavy depending on whether the balance on which it is placed goes up or down, respectively. <br><br><br>By choosing her weighings carefully, Sally is able to ensure that she will find the counterfeit coin with exactly three weighings. <br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input is an integer n (n &gt; 0) specifying the number of cases to follow. Each case consists of three lines of input, one for each weighing. Sally has identified each of the coins with the letters A-L. Information on a weighing will be given by two strings of letters and then one of the words ``up&apos;&apos;, ``down&apos;&apos;, or ``even&apos;&apos;. The first string of letters will represent the coins on the left balance; the second string, the coins on the right balance. (Sally will always place the same number of coins on the right balance as on the left balance.) The word in the third position will tell whether the right side of the balance goes up, down, or remains even.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, the output will identify the counterfeit coin by its letter and tell whether it is heavy or light. The solution will always be uniquely determined.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\nABCD EFGH even\nABCI EFJK up\nABIJ EFGH even</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">K is the counterfeit coin and it is light.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=East+Central+North+America+1998&amp;source=1&amp;searchmode=source\"> East Central North America 1998 </a> ","type":"source","format":"html","require":["katex"]}]}