{"title":"Disk Tree","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1504","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1504&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1504","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1504"},"statement":[{"title":"Problem Description","content":"Hacker Bill has accidentally lost all the information from his workstation&apos;s hard drive and he has no backup copies of its contents. He does not regret for the loss of the files themselves, but for the very nice and convenient directory structure that he had created and cherished during years of work. Fortunately, Bill has several copies of directory listings from his hard drive. Using those listings he was able to recover full paths (like &quot;WINNT\\SYSTEM32\\CERTSRV\\CERTCO~1\\X86&quot;) for some directories. He put all of them in a file by writing each path he has found on a separate line. Your task is to write a program that will help Bill to restore his state of the art directory structure by providing nicely formatted directory tree. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"This problem contains multiple test cases!<br><br>The first line of a multiple input is an integer N, then a blank line followed by N input blocks. Each input block is in the format indicated in the problem description. There is a blank line between input blocks.<br><br>The output format consists of N output blocks. There is a blank line between output blocks.<br><br>The first line of the input contains single integer number N (1 &lt;= N &lt;= 500) that denotes a total number of distinct directory paths. Then N lines with directory paths follow. Each directory path occupies a single line and does not contain any spaces, including leading or trailing ones. No path exceeds 80 characters. Each path is listed once and consists of a number of directory names separated by a back slash (&quot;\\&quot;). <br><br>Each directory name consists of 1 to 8 uppercase letters, numbers, or the special characters from the following list: exclamation mark, number sign, dollar sign, percent sign, ampersand, apostrophe, opening and closing parenthesis, hyphen sign, commercial at, circumflex accent, underscore, grave accent, opening and closing curly bracket, and tilde (&quot;!#$%&amp;&apos;()-@^_`{}~&quot;).<br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Write to the output the formatted directory tree. Each directory name shall be listed on its own line preceded by a number of spaces that indicate its depth in the directory hierarchy. The subdirectories shall be listed in lexicographic order immediately after their parent directories preceded by one more space than their parent directory. Top level directories shall have no spaces printed before their names and shall be listed in lexicographic order. See sample below for clarification of the output format.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n\n7\nWINNT\\SYSTEM32\\CONFIG\nGAMES\nWINNT\\DRIVERS\nHOME\nWIN\\SOFT\nGAMES\\DRIVERS\nWINNT\\SYSTEM32\\CERTSRV\\CERTCO~1\\X86</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">GAMES\n DRIVERS\nHOME\nWIN\n SOFT\nWINNT\n DRIVERS\n SYSTEM32\n  CERTSRV\n   CERTCO~1\n    X86\n  CONFIG</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Northeastern+Europe+2000&amp;source=1&amp;searchmode=source\"> Northeastern Europe 2000 </a> ","type":"source","format":"html","require":["katex"]}]}