{"title":"Monkey King","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1512","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1512&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1512","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1512"},"statement":[{"title":"Problem Description","content":"Once in a forest, there lived N aggressive monkeys. At the beginning, they each does things in its own way and none of them knows each other. But monkeys can&apos;t avoid quarrelling, and it only happens between two monkeys who does not know each other. And when it happens, both the two monkeys will invite the strongest friend of them, and duel. Of course, after the duel, the two monkeys and all of there friends knows each other, and the quarrel above will no longer happens between these monkeys even if they have ever conflicted.<br><br>Assume that every money has a strongness value, which will be reduced to only half of the original after a duel(that is, 10 will be reduced to 5 and 5 will be reduced to 2).<br><br>And we also assume that every monkey knows himself. That is, when he is the strongest one in all of his friends, he himself will go to duel.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases, and each case consists of two parts.<br><br>First part: The first line contains an integer N(N&lt;=100,000), which indicates the number of monkeys. And then N lines follows. There is one number on each line, indicating the strongness value of ith monkey(&lt;=32768).<br><br>Second part: The first line contains an integer M(M&lt;=100,000), which indicates there are M conflicts happened. And then M lines follows, each line of which contains two integers x and y, indicating that there is a conflict between the Xth monkey and Yth.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each of the conflict, output -1 if the two monkeys know each other, otherwise output the strongness value of the strongest monkey in all friends of them after the duel.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n20\n16\n10\n10\n4\n5\n2 3\n3 4\n3 5\n4 5\n1 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8\n5\n5\n-1\n10</div></pre>","type":"example","format":"html"},{"title":"Author","content":"JIANG, Yanyan","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ZOJ+3rd+Anniversary+Contest&amp;source=1&amp;searchmode=source\"> ZOJ 3rd Anniversary Contest </a> ","type":"source","format":"html"}]}