{"title":"Anagrams by Stack","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1515","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1515&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1515","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1515"},"statement":[{"title":"Problem Description","content":"How can anagrams result from sequences of stack operations? There are two sequences of stack operators which can convert TROT to TORT: <br><br>[<br>i i i i o o o o<br>i o i i o o i o<br>]<br><br>where i stands for Push and o stands for Pop. Your program should, given pairs of words produce sequences of stack operations which convert the first word to the second.<br><br>A stack is a data storage and retrieval structure permitting two operations: <br><br>Push - to insert an item and<br>Pop - to retrieve the most recently pushed item <br>We will use the symbol i (in) for push and o (out) for pop operations for an initially empty stack of characters. Given an input word, some sequences of push and pop operations are valid in that every character of the word is both pushed and popped, and furthermore, no attempt is ever made to pop the empty stack. For example, if the word FOO is input, then the sequence: <br><br>i i o i o o is valid, but <br>i i o  is not (it&apos;s too short), neither is <br>i i o o o i (there&apos;s an illegal pop of an empty stack) <br><br>Valid sequences yield rearrangements of the letters in an input word. For example, the input word FOO and the sequence i i o i o o produce the anagram OOF. So also would the sequence i i i o o o. You are to write a program to input pairs of words and output all the valid sequences of i and o which will produce the second member of each pair from the first.<br>","type":"description","format":"html"},{"title":"Input","content":"The input will consist of several lines of input. The first line of each pair of input lines is to be considered as a source word (which does not include the end-of-line character). The second line (again, not including the end-of-line character) of each pair is a target word. The end of input is marked by end of file.","type":"input_format","format":"html"},{"title":"Output","content":"For each input pair, your program should produce a sorted list of valid sequences of i and o which produce the target word from the source word. Each list should be delimited by <br><br>[<br>]<br><br>and the sequences should be printed in &quot;dictionary order&quot;. Within each sequence, each i and o is followed by a single space and each sequence is terminated by a new line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">madam\nadamm\nbahama\nbahama\nlong\nshort\neric\nrice</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">[\ni i i i o o o i o o \ni i i i o o o o i o \ni i o i o i o i o o \ni i o i o i o o i o \n]\n[\ni o i i i o o i i o o o \ni o i i i o o o i o i o \ni o i o i o i i i o o o \ni o i o i o i o i o i o \n]\n[\n]\n[\ni i o i o i o o \n]</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Zhejiang+University+Local+Contest+2001&amp;source=1&amp;searchmode=source\"> Zhejiang University Local Contest 2001 </a> ","type":"source","format":"html"}]}