{"title":"A Chess Game","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1524","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1524&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1524","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1524"},"statement":[{"title":"Problem Description","content":"Let&apos;s design a new chess game. There are N positions to hold M chesses in this game. Multiple chesses can be located in the same position. The positions are constituted as a topological graph, i.e. there are directed edges connecting some positions, and no cycle exists. Two players you and I move chesses alternately. In each turn the player should move only one chess from the current position to one of its out-positions along an edge. The game does not end, until one of the players cannot move chess any more. If you cannot move any chess in your turn, you lose. Otherwise, if the misfortune falls on me... I will disturb the chesses and play it again. <br><br>Do you want to challenge me? Just write your program to show your qualification!<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input contains multiple test cases. Each test case starts with a number N (1 &lt;= N &lt;= 1000) in one line. Then the following N lines describe the out-positions of each position. Each line starts with an integer Xi that is the number of out-positions for the position i. Then Xi integers following specify the out-positions. Positions are indexed from 0 to N-1. Then multiple queries follow. Each query occupies only one line. The line starts with a number M (1 &lt;= M &lt;= 10), and then come M integers, which are the initial positions of chesses. A line with number 0 ends the test case.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"There is one line for each query, which contains a string &quot;WIN&quot; or &quot;LOSE&quot;. &quot;WIN&quot; means that the player taking the first turn can win the game according to a clever strategy; otherwise &quot;LOSE&quot; should be printed.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n2 1 2\n0\n1 3\n0\n1 0\n2 0 2\n0\n\n4\n1 1\n1 2\n0\n0\n2 0 1\n2 1 1\n3 0 1 3\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">WIN\nWIN\nWIN\nLOSE\nWIN</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=PKU+Monthly&amp;source=1&amp;searchmode=source\"> PKU Monthly </a> ","type":"source","format":"html","require":["katex"]}]}