{"title":"S-Nim","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1536","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1536&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1536","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1536"},"statement":[{"title":"Problem Description","content":"Arthur and his sister Caroll have been playing a game called Nim for some time now. Nim is played as follows:<br><br><br>&#xA0;&#xA0;The starting position has a number of heaps, all containing some, not necessarily equal, number of beads.<br><br>&#xA0;&#xA0;The players take turns chosing a heap and removing a positive number of beads from it.<br><br>&#xA0;&#xA0;The first player not able to make a move, loses.<br><br><br>Arthur and Caroll really enjoyed playing this simple game until they recently learned an easy way to always be able to find the best move:<br><br><br>&#xA0;&#xA0;Xor the number of beads in the heaps in the current position (i.e. if we have 2, 4 and 7 the xor-sum will be 1 as 2 xor 4 xor 7 = 1).<br><br>&#xA0;&#xA0;If the xor-sum is 0, too bad, you will lose.<br><br>&#xA0;&#xA0;Otherwise, move such that the xor-sum becomes 0. This is always possible.<br><br><br>It is quite easy to convince oneself that this works. Consider these facts:<br><br>&#xA0;&#xA0;The player that takes the last bead wins.<br><br>&#xA0;&#xA0;After the winning player&apos;s last move the xor-sum will be 0.<br><br>&#xA0;&#xA0;The xor-sum will change after every move.<br><br><br>Which means that if you make sure that the xor-sum always is 0 when you have made your move, your opponent will never be able to win, and, thus, you will win. <br><br>Understandibly it is no fun to play a game when both players know how to play perfectly (ignorance is bliss). Fourtunately, Arthur and Caroll soon came up with a similar game, S-Nim, that seemed to solve this problem. Each player is now only allowed to remove a number of beads in some predefined set S, e.g. if we have S =(2, 5) each player is only allowed to remove 2 or 5 beads. Now it is not always possible to make the xor-sum 0 and, thus, the strategy above is useless. Or is it? <br><br>your job is to write a program that determines if a position of S-Nim is a losing or a winning position. A position is a winning position if there is at least one move to a losing position. A position is a losing position if there are no moves to a losing position. This means, as expected, that a position with no legal moves is a losing position.","type":"description","format":"html"},{"title":"Input","content":"Input consists of a number of test cases. For each test case: The first line contains a number k (0 &lt; k &#xFFFD;&#xFFFD; 100 describing the size of S, followed by k numbers si (0 &lt; si &#xFFFD;&#xFFFD; 10000) describing S. The second line contains a number m (0 &lt; m &#xFFFD;&#xFFFD; 100) describing the number of positions to evaluate. The next m lines each contain a number l (0 &lt; l &#xFFFD;&#xFFFD; 100) describing the number of heaps and l numbers hi (0 &#xFFFD;&#xFFFD; hi &#xFFFD;&#xFFFD; 10000) describing the number of beads in the heaps. The last test case is followed by a 0 on a line of its own.","type":"input_format","format":"html"},{"title":"Output","content":"For each position: If the described position is a winning position print a &apos;W&apos;.If the described position is a losing position print an &apos;L&apos;. Print a newline after each test case.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2 5\n3\n2 5 12\n3 2 4 7\n4 2 3 7 12\n5 1 2 3 4 5\n3\n2 5 12\n3 2 4 7\n4 2 3 7 12\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">LWW\nWWL</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Norgesmesterskapet+2004&amp;source=1&amp;searchmode=source\"> Norgesmesterskapet 2004 </a> ","type":"source","format":"html"}]}