{"title":"Cable master","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1551","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1551&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1551","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1551"},"statement":[{"title":"Problem Description","content":"Inhabitants of the Wonderland have decided to hold a regional programming contest. The Judging Committee has volunteered and has promised to organize the most honest contest ever. It was decided to connect computers for the contestants using a &quot;star&quot; topology - i.e. connect them all to a single central hub. To organize a truly honest contest, the Head of the Judging Committee has decreed to place all contestants evenly around the hub on an equal distance from it.<br><br>To buy network cables, the Judging Committee has contacted a local network solutions provider with a request to sell for them a specified number of cables with equal lengths. The Judging Committee wants the cables to be as long as possible to sit contestants as far from each other as possible.<br><br>The Cable Master of the company was assigned to the task. He knows the length of each cable in the stock up to a centimeter, and he can cut them with a centimeter precision being told the length of the pieces he must cut. However, this time, the length is not known and the Cable Master is completely puzzled.<br><br>You are to help the Cable Master, by writing a program that will determine the maximal possible length of a cable piece that can be cut from the cables in the stock, to get the specified number of pieces.<br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of several testcases. The first line of each testcase contains two integer numbers N and K, separated by a space. N (1 &#xFFFD;&#xFFFD; N &#xFFFD;&#xFFFD; 10000) is the number of cables in the stock, and K (1 &#xFFFD;&#xFFFD; K &#xFFFD;&#xFFFD; 10000) is the number of requested pieces. The first line is followed by N lines with one number per line, that specify the length of each cable in the stock in meters. All cables are at least 1 centimeter and at most 100 kilometers in length. All lengths in the input are written with a centimeter precision, with exactly two digits after a decimal point.<br><br>The input is ended by line containing two 0&apos;s.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each testcase write to the output the maximal length (in meters) of the pieces that Cable Master may cut from the cables in the stock to get the requested number of pieces. The number must be written with a centimeter precision, with exactly two digits after a decimal point.<br><br>If it is not possible to cut the requested number of pieces each one being at least one centimeter long, then the output must contain the single number &quot;0.00&quot; (without quotes).<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 11\n8.02\n7.43\n4.57\n5.39\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.00</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2001-2002+ACM+Northeastern+European+Regional+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2001-2002 ACM Northeastern European Regional Programming Contest </a> ","type":"source","format":"html"}]}