{"title":"Station Balance","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1607","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1607&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1607","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1607"},"statement":[{"title":"Problem Description","content":"The International Space Station contains many centrifuges in its labs. Each centrifuge will have some number (C) of chambers each of which can contain 0, 1, or 2 specimens. You are to write a program which assigns all S specimens to the chambers such that no chamber contains more than 2 specimens and the following expression for IMBALANCE is minimized. <br><br><img style=\"max-width:100%;\" src=\"/data/images/1607-1.gif\"><br><br>where: <br><br>CMi is the Chamber Mass of chamber i and is computed by summing the masses of the specimens assigned to chamber i. <br><br>AM is the Average Mass of the chambers and is computed by dividing the sum of the masses of all specimens by the number of chambers (C). <br><br>","type":"description","format":"html"},{"title":"Input","content":"Input to this program will be multiple sets of input. The first line of each set will contain two numbers. The first number (1 &lt;= C &lt;= 5) defines the number of chambers in the centrifuge and the second number (1 &lt;= S &lt;= 2C) defines the number of specimens in the input set. The second line of input will contain S integers representing the masses of the specimens in the set. Each specimen mass will be between 1 and 1000 and will be delimited by the beginning or end of the line and/or one or more blanks. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each input set, you are to print a line specifying the set number (starting with 1) in the format &quot;Set #X&quot; where &quot;X&quot; is the set number. <br><br>The next C lines will contain the chamber number in column 1, a colon in column number 2, and then the masses of the specimens your program has assigned to that chamber starting in column 4. The masses in your output should be separated by exactly one blank. <br><br>Your program should then print ``IMBALANCE = X&quot; on a line by itself where X is the computed imbalance of your specimen assignments printed to 5 digits of precision to the right of the decimal. <br><br>The final line of output for each set should be a blank line. (Follow the sample output format.) <br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3\n6 3 8\n3 5\n51 19 27 14 33\n5 9\n1 2 3 5 7 11 13 17 19</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Set #1\n 0: 6 3\n 1: 8\nIMBALANCE = 1.00000\n\nSet #2\n 0: 51\n 1: 19 27\n 2: 14 33\nIMBALANCE = 6.00000\n\nSet #3\n 0: 1 17\n 1: 2 13\n 2: 3 11\n 3: 5 7\n 4: 19\nIMBALANCE = 11.60000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=South+Central+USA+1996&amp;source=1&amp;searchmode=source\"> South Central USA 1996 </a> ","type":"source","format":"html"}]}