{"title":"The Blocks Problem","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1612","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1612&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1612","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1612"},"statement":[{"title":"Problem Description","content":"Many areas of Computer Science use simple, abstract domains for both analytical and empirical studies. For example, an early AI study of planning and robotics (STRIPS) used a block world in which a robot arm performed tasks involving the manipulation of blocks. <br>In this problem you will model a simple block world under certain rules and constraints. Rather than determine how to achieve a specified state, you will ``program&apos;&apos; a robotic arm to respond to a limited set of commands<br><br>The problem is to parse a series of commands that instruct a robot arm in how to manipulate blocks that lie on a flat table. Initially there are n blocks on the table (numbered from 0 to n-1) with block bi adjacent to block bi+1 for all 0&#xFFFD;&#xFFFD;i&lt;n-1 as shown in the diagram below<br><img style=\"max-width:100%;\" src=\"/data/images/1612-1.gif\"><br>The valid commands for the robot arm that manipulates blocks are: <br><br>move a onto b <br>where a and b are block numbers, puts block a onto block b after returning any blocks that are stacked on top of blocks a and b to their initial positions. <br><br>move a over b <br>where a and b are block numbers, puts block a onto the top of the stack containing block b, after returning any blocks that are stacked on top of block a to their initial positions. <br><br>pile a onto b <br>where a and b are block numbers, moves the pile of blocks consisting of block a, and any blocks that are stacked above block a, onto block b. All blocks on top of block b are moved to their initial positions prior to the pile taking place. The blocks stacked above block a retain their order when moved. <br><br>pile a over b <br>where a and b are block numbers, puts the pile of blocks consisting of block a, and any blocks that are stacked above block a, onto the top of the stack containing block b. The blocks stacked above block a retain their original order when moved. <br><br>quit <br>terminates manipulations in the block world. <br><br>Any command in which a = b or in which a and b are in the same stack of blocks is an illegal command. All illegal commands should be ignored and should have no affect on the configuration of blocks. <br>","type":"description","format":"html"},{"title":"Input","content":"The input begins with an integer n on a line by itself representing the number of blocks in the block world. You may assume that 0 &lt; n &lt; 25. <br>The number of blocks is followed by a sequence of block commands, one command per line. Your program should process all commands until the quit command is encountered. <br><br>You may assume that all commands will be of the form specified above. There will be no syntactically incorrect commands. <br>","type":"input_format","format":"html"},{"title":"Output","content":"The output should consist of the final state of the blocks world. Each original block position numbered i (0&#xFFFD;&#xFFFD;i&lt;n-1 where n is the number of blocks) should appear followed immediately by a colon. If there is at least a block on it, the colon must be followed by one space, followed by a list of blocks that appear stacked in that position with each block number separated from other block numbers by a space. Don&apos;t put any trailing spaces on a line. <br><br>There should be one line of output for each block position (i.e., n lines of output where n is the integer on the first line of input). <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10\nmove 9 onto 1\nmove 8 over 1\nmove 7 over 1\nmove 6 over 1\npile 8 over 6\npile 8 over 5\nmove 2 over 1\nmove 4 over 9\nquit</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\"> 0: 0\n 1: 1 9 2 4\n 2:\n 3: 3\n 4:\n 5: 5 8 7 6\n 6:\n 7:\n 8:\n 9:</div></pre>","type":"example","format":"html"},{"title":"Author","content":"Miguel Revilla","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=UVA&amp;source=1&amp;searchmode=source\"> UVA </a> ","type":"source","format":"html"}]}