{"title":"SCUD Busters","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1616","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1616&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1616","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1616"},"statement":[{"title":"Problem Description","content":"Some problems are difficult to solve but have a simplification that is easy to solve. Rather than deal with the difficulties of constructing a model of the Earth (a somewhat oblate spheroid), consider a pre-Columbian flat world that is a 500 kilometer  500 kilometer square. <br><br>In the model used in this problem, the flat world consists of several warring kingdoms. Though warlike, the people of the world are strict isolationists; each kingdom is surrounded by a high (but thin) wall designed to both protect the kingdom and to isolate it. To avoid fights for power, each kingdom has its own electric power plant. <br><br>When the urge to fight becomes too great, the people of a kingdom often launch missiles at other kingdoms. Each SCUD missile (anitary leansing niversal estroyer) that lands within the walls of a kingdom destroys that kingdom&apos;s power plant (without loss of life). <br><br><br>Given coordinate locations of several kingdoms (by specifying the locations of houses and the location of the power plant in a kingdom) and missile landings you are to write a program that determines the total area of all kingdoms that are without power after an exchange of missile fire. <br><br>In the simple world of this problem kingdoms do not overlap. Furthermore, the walls surrounding each kingdom are considered to be of zero thickness. The wall surrounding a kingdom is the minimal-perimeter wall that completely surrounds all the houses and the power station that comprise a kingdom; the area of a kingdom is the area enclosed by the minimal-perimeter thin wall. <br><br>There is exactly one power station per kingdom. <br><br>There may be empty space between kingdoms. <br><br>","type":"description","format":"html"},{"title":"Input","content":"The input is a sequence of kingdom specifications followed by a sequence of missile landing locations. <br><br>A kingdom is specified by a number N ( 3&#xFFFD;&#xFFFD;N&#xFFFD;&#xFFFD;10) on a single line which indicates the number of sites in this kingdom. The next line contains the x and y coordinates of the power station, followed by N-1 lines of x, y pairs indicating the locations of homes served by this power station. A value of -1 for N indicates that there are no more kingdoms. There will be at least one kingdom in the data set. <br><br>Following the last kingdom specification will be the coordinates of one or more missile attacks, indicating the location of a missile landing. Each missile location is on a line by itself. You are to process missile attacks until you reach the end of the file. <br><br>Locations are specified in kilometers using coordinates on a 500 km by 500 km grid. All coordinates will be integers between 0 and 500 inclusive. Coordinates are specified as a pair of integers separated by white-space on a single line. The input file will consist of up to 20 kingdoms, followed by any number of missile attacks. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"The output consists of a single number representing the total area of all kingdoms without electricity after all missile attacks have been processed. The number should be printed with (and correct to) two decimal places","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">12\n3 3\n4 6\n4 11\n4 8\n10 6\n5 7\n6 6\n6 3\n7 9\n10 4\n10 9\n1 7\n5\n20 20\n20 40\n40 20\n40 40\n30 30\n3\n10 10\n21 10\n21 13\n-1\n5 5\n20 12</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">70.50\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>Hint</div><i style=\"font-size:1px\"> </i>\nYou may or may not find the following formula useful. \nGiven a polygon described by the vertices v0,v1..vn such that v0=vn \nthe signed area of the polygon is given by \n<img src=\"/data/images/1616-1.gif\">\nwhere the x, y coordinates of vi=(xi,yi) ; \nthe edges of the polygon are from  v(i) to v(i+1)  for i=0..n-1 . \nIf the points describing the polygon are given in a counterclockwise direction, \nthe value of a will be positive, \nand if the points of the polygon are listed in a clockwise direction, \nthe value of a will be negative. </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=UVA&amp;source=1&amp;searchmode=source\"> UVA </a> ","type":"source","format":"html"}]}