{"title":"Pipe Fitters","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1621","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1621&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1621","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1621"},"statement":[{"title":"Problem Description","content":"Filters, or programs that pass ``processed&apos;&apos; data through in some changed form, are an important class of programs in the UNIX operating system. A pipe is an operating system concept that permits data to ``flow&apos;&apos; between processes (and allows filters to be chained together easily.) <br><br>This problem involves maximizing the number of pipes that can be fit into a storage container (but it&apos;s a pipe fitting problem, not a bin packing problem). <br><br>A company manufactures pipes of uniform diameter. All pipes are stored in rectangular storage containers, but the containers come in several different sizes. Pipes are stored in rows within a container so that there is no space between pipes in any row (there may be some space at the end of a row), i.e., all pipes in a row are tangent, or touch. Within a rectangular cross-section, pipes are stored in either a grid pattern or a skew pattern as shown below: the two left-most cross-sections are in a grid pattern, the two right-most cross-sections are in a skew pattern.<br><br><img style=\"max-width:100%;\" src=\"/data/images/1621-1.gif\"> <br><br>Note that although it may not be apparent from the diagram, there is no space between adjacent pipes in any row. The pipes in any row are tangent to (touch) the pipes in the row below (or rest on the bottom of the container). When pipes are packed into a container, there may be ``left-over&apos;&apos; space in which a pipe cannot be packed. Such left-over space is packed with padding so that the pipes cannot settle during shipping. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input is a sequence of cross-section dimensions of storage containers. Each cross-section is given as two real values on one line separated by white space. The dimensions are expressed in units of pipe diameters. All dimensions will be less than  2^7. Note that a cross section with dimensions  a*b can also be viewed as a cross section with dimensions  b*a. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each cross-section in the input, your program should print the maximum number of pipes that can be packed into that cross section. The number of pipes is an integer -- no fractional pipes can be packed. The maximum number is followed by the word ``grid&apos;&apos; if a grid pattern results in the maximal number of pipes or the word ``skew&apos;&apos; if a skew pattern results in the maximal number of pipes. If the pattern doesn&apos;t matter, that is the same number of pipes can be packed with either a grid or skew pattern, then the word ``grid&apos;&apos; should be printed. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n2.9 10\n2.9 10.5\n11 11</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9 grid\n29 skew\n30 skew\n126 skew</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=UVA&amp;source=1&amp;searchmode=source\"> UVA </a> ","type":"source","format":"html","require":["katex"]}]}