{"title":"Numbering Paths","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1625","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1625&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1625","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1625"},"statement":[{"title":"Problem Description","content":"Problems that process input and generate a simple ``yes&apos;&apos; or ``no&apos;&apos; answer are called decision problems. One class of decision problems, the NP-complete problems, are not amenable to general efficient solutions. Other problems may be simple as decision problems, but enumerating all possible ``yes&apos;&apos; answers may be very difficult (or at least time-consuming). <br><br>This problem involves determining the number of routes available to an emergency vehicle operating in a city of one-way streets.<br><br>Given the intersections connected by one-way streets in a city, you are to write a program that determines the number of different routes between each intersection. A route is a sequence of one-way streets connecting two intersections. <br><br>Intersections are identified by non-negative integers. A one-way street is specified by a pair of intersections. For example, j k indicates that there is a one-way street from intersection j to intersection k. Note that two-way streets can be modeled by specifying two one-way streets: j k and k j . <br><br>Consider a city of four intersections connected by the following one-way streets: <br><br>    0  1<br>    0  2<br>    1  2<br>    2  3<br><br>There is one route from intersection 0 to 1, two routes from 0 to 2 (the routes are 0-1-2 and 0-2 ), two routes from 0 to 3, one route from 1 to 2, one route from 1 to 3, one route from 2 to 3, and no other routes. <br>It is possible for an infinite number of different routes to exist. For example if the intersections above are augmented by the street  , there is still only one route from 0 to 1, but there are infinitely many different routes from 0 to 2. This is because the street from 2 to 3 and back to 2 can be repeated yielding a different sequence of streets and hence a different route. Thus the route 0-2-3-2-3-2 is a different route than 0-2-3-2 . <br>","type":"description","format":"html"},{"title":"Input","content":"The input is a sequence of city specifications. Each specification begins with the number of one-way streets in the city followed by that many one-way streets given as pairs of intersections. Each pair j k represents a one-way street from intersection j to intersection k. In all cities, intersections are numbered sequentially from 0 to the ``largest&apos;&apos; intersection. All integers in the input are separated by whitespace. The input is terminated by end-of-file. <br><br>There will never be a one-way street from an intersection to itself. No city will have more than 30 intersections.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each city specification, a square matrix of the number of different routes from intersection j to intersection k is printed. If the matrix is denoted M, then M[j][k] is the number of different routes from intersection j to intersection k. The matrix M should be printed in row-major order, one row per line. Each matrix should be preceded by the string ``matrix for city k&apos;&apos; (with k appropriately instantiated, beginning with 0). <br><br>If there are an infinite number of different paths between two intersections a -1 should be printed. DO NOT worry about justifying and aligning the output of each matrix. All entries in a row should be separated by whitespace. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 0 1 0 2 0 4 2 4 2 3 3 1 4 3\n5 \n0 2 \n0 1 1 5 2 5 2 1\n9\n0 1 0 2 0 3\n0 4 1 4 2 1\n2 0\n3 0\n3 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">matrix for city 0\n 0 4 1 3 2\n 0 0 0 0 0\n 0 2 0 2 1\n 0 1 0 0 0\n 0 1 0 1 0\nmatrix for city 1\n 0 2 1 0 0 3\n 0 0 0 0 0 1\n 0 1 0 0 0 2\n 0 0 0 0 0 0\n 0 0 0 0 0 0\n 0 0 0 0 0 0\nmatrix for city 2\n -1 -1 -1 -1 -1\n 0 0 0 0 1\n -1 -1 -1 -1 -1\n -1 -1 -1 -1 -1\n 0 0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=uva&amp;source=1&amp;searchmode=source\"> uva </a> ","type":"source","format":"html"}]}