{"title":"Forests","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1634","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1634&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1634","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1634"},"statement":[{"title":"Problem Description","content":"The saying ``You can&apos;t see the wood for the trees&apos;&apos; is not only a cliche, but is also incorrect. The real problem is that you can&apos;t see the trees for the wood. If you stand in the middle of a ``wood&apos;&apos; (in NZ terms, a patch of bush), the trees tend to obscure each other and the number of distinct trees you can actually see is quite small. This is especially true if the trees are planted in rows and columns (as in a pine plantation), because they tend to line up. The purpose of this problem is to find how many distinct trees you can see from an arbitrary point in a pine plantation (assumed to stretch ``for ever&apos;&apos;). <br><img style=\"max-width:100%;\" src=\"/data/images/1634-1.gif\"><br>You can only see a distinct tree if no part of its trunk is obscured by a nearer tree--that is if both sides of the trunk can be seen, with a discernible gap between them and the trunks of all trees closer to you. Also, you can&apos;t see a tree if it is apparently ``too small&apos;&apos;. For definiteness, ``not too small&apos;&apos; and ``discernible gap&apos;&apos; will mean that the angle subtended at your eye is greater than 0.01 degrees (you are assumed to use one eye for observing). Thus the two trees marked<img style=\"max-width:100%;\" src=\"/data/images/1634-2.gif\">obscure at least the trees marked<img style=\"max-width:100%;\" src=\"/data/images/1634-3.gif\">from the given view point. <br><br>Write a program that will determine the number of trees visible under these assumptions, given the diameter of the trees, and the coordinates of a viewing position. Because the grid is infinite, the origin is unimportant, and the coordinates will be numbers between 0 and 1. <br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of a series of lines, each line containing three real numbers of the form 0.nn. The first number will be the trunk diameter--all trees will be assumed to be cylinders of exactly this diameter, with their centres placed exactly on the points of a rectangular grid with a spacing of one unit. The next two numbers will be the x and y coordinates of the observer. To avoid potential problems, say by being too close to a tree, we will guarantee that <img style=\"max-width:100%;\" src=\"/data/images/1634-4.gif\"> To avoid problems with trees being too small you may assume that<img style=\"max-width:100%;\" src=\"/data/images/1634-5.gif\">. The file will be terminated by a line consisting of three zeroes. <br>","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each line of the input. Each line will consist of the number of trees of the given size, visible from the given position. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.10 0.46 0.38\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">128</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=UVA&amp;source=1&amp;searchmode=source\"> UVA </a> ","type":"source","format":"html"}]}