{"title":"String Computer","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1640","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1640&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1640","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1640"},"statement":[{"title":"Problem Description","content":"Extel have just brought out their newest computer, a string processing computer dubbed the X9091. It is hoped that it will have some value in cryptography and related fields. (It is rumoured that the Taiwanese are working on a clone that will correct Stage 1 essays, but we will ignore such vapourware). This computer will accept input strings and produce output strings from them, depending on the programs loaded into them at the time. The chip is the ultimate in RISC technology--it has only three transformation instructions: <br><br>Delete a character at a particular position.<br>Insert a character at a particular position.<br>Change the character at a particular position to a different character. <br><br>Programs for this machine are written in a form of machine code where each instruction has the format ZXdd--Z represents the code for the instruction (D, I or C), X is a character and dd represents a two digit number. A program is terminated by a special halt instruction consisting of the letter `E&apos;. Note that each instruction works on the string in memory at the time the instruction is executed. <br><br>To see how this all works consider the following example. It is desired to transform the string `abcde&apos; to the string `bcgfe&apos;. This could be achieved by a series of Change commands, but is not minimal. The following program is better. <br><img style=\"max-width:100%;\" src=\"/data/images/1640-1.gif\"><br><br>Write a program that will read in two strings (the input string and the target string) and will produce a minimal X9091 program necessary to transform the input string into the target string. Since there may be multiple solutions, only one should be produced. Any solution that satisfies these criteria will be accepted. ","type":"description","format":"html"},{"title":"Input","content":"Input will consist of a series of lines, each line containing two strings separated by exactly one space. The strings will consist of no more than 20 lower case characters. The file will be terminated by a line consisting of a single #. ","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each line of the input. Each will consist of a program in X9091 language. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">abcde bcgfe\n#</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Da01Cg03If04E</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=UVA&amp;source=1&amp;searchmode=source\"> UVA </a> ","type":"source","format":"html"}]}