{"title":"Keywords ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1648","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1648&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1648","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1648"},"statement":[{"title":"Problem Description","content":"Many researchers are faced with an ever increasing number of journal articles to read and find it difficult to locate papers of relevance to their particular lines of research. However, it is possible to subscribe to various services which claim that they will find articles that fit an `interest profile&apos; that you supply, and pass them on to you. One simple way of performing such a search is to determine whether a pair of keywords occurs `sufficiently&apos; close to each other in the title of an article. The threshold is determined by the researchers themselves, and refers to the number of words that may occur between the pair of keywords. Thus an archeologist interested in cave paintings could specify her profile as ``0 rock art&apos;&apos;, meaning that she wants all titles in which the words ``rock&apos;&apos; and ``art&apos;&apos; appear with 0 words in between, that is next to each other. This would select not only ``Rock Art of the Maori&apos;&apos; but also ``Pop Art, Rock, and the Art of Hang-glider Maintenance&apos;&apos;. <br><br><br>Write a program that will read in a series of profiles followed by a series of titles and determine which of the titles (if any) are selected by each of the profiles. A title is selected by a profile if at least one pair of keywords from the profile is found in the title, separated by no more than the given threshold. For the purposes of this program, a word is a sequence of letters, preceded by one or more blanks and terminated by a blank or the end of line marker. <br><br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of no more than 50 profiles followed by no more than 250 titles. Each profile and title will be numbered in the order of their appearance, starting from 1, although the numbers will not appear in the file. <br><br><br>Each profile will start with the characters ``P:&apos;&apos;, and will consist of a number representing a threshold, followed by two or more keywords in lower case.<br>Each title will start with the characters ``T:&apos;&apos;, and will consist of a string of characters terminated by ``|&apos;&apos;. The character ``|&apos;&apos; will not occur anywhere in a title except at the end. No title will be longer than 255 characters, and if necessary it will flow on to more than one line. No line will be longer than eighty characters and each continuation line of a title will start with at least one blank. Line breaks will only occur between words. <br><br>All non-alphabetic characters are to be ignored, thus the title ``Don&apos;t Rock -- the Boat as Metaphor in 1984&apos;&apos; would be treated as ``Dont Rock the Boat as Metaphor in&apos;&apos; and ``HP2100X&apos;&apos; will be treated as ``HPX&apos;&apos;. The file will be terminated by a line consisting of a single #. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each profile in the input. Each line will consist of the profile number (the number of its appearance in the input) followed by ``:&apos;&apos; and the numbers of the selected titles in numerical order, separated by commas and with no spaces. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">P: 0 rock art\nP: 3 concepts conceptions\nP: 1   art rock   metaphor concepts\nT: Rock Art of the Maori|\nT: Jazz and Rock - Art Brubeck and Elvis Presley|\nT: Don&apos;t Rock --- the Boat as Metaphor in 1984, Concepts\n   and (Mis)-Conceptions of an Art Historian.|\nT: Carved in Rock, The Art and Craft of making promises\n   believable when your `phone bills have gone\n   through the roof|\n#</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1: 1,2\n2: \n3: 1,2,3,4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=uva&amp;source=1&amp;searchmode=source\"> uva </a> ","type":"source","format":"html"}]}