{"title":"Eeny Meeny","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1650","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1650&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1650","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1650"},"statement":[{"title":"Problem Description","content":"In darkest &lt;name of continent/island deleted to prevent offence&gt; lived a tribe called the ``Eeny Meenys&apos;&apos;. They got this name from their way of choosing a chief for a year. It appears that a newspaper reporter visited the tribe and managed to get across a few ideas of civilisation, but apparently came to an unfortunate end before finishing the job. Thus the tribe no longer had a permanent chief; the chief&apos;s term was exactly one year. At the end of that time, they ate the current chief, and chose another chief. Their method of choosing a chief was the ``Eeny meeny miny mo&apos;&apos; method. All eligible tribal members (women were also eligible--one of the blessings of civilisation the tribe had adopted) stood in a circle, a starting place was chosen, and the chief medicine man (who was ineligible for chieftainship) went around counting out `E&apos;, `e&apos;, `n&apos;, `y&apos;, `M&apos;, `e&apos;, `e&apos;, `n&apos;, `y&apos;, `M&apos;,`i&apos;, `n&apos;, `y&apos;, `M&apos;, `o!&apos;, `E&apos;, `e&apos;, `n&apos;, `y&apos;, `M&apos;, `e&apos;, `e&apos;, `n&apos;, `y&apos;, `M&apos;, `i&apos;, `n&apos;, `y&apos;, `M&apos;, `o!&apos;, .... At every `o!&apos;, the person indicated was pushed out of the circle which then closed up and the count restarted with his neighbour (the one who would have been `E&apos; anyway). This process continued until only one was left--the new chief. <br><br><br>While the chance of glory for a year makes the job of chief highly attractive to tribal members, you (possessing a computer decades before they were invented) find the brevity of the glory unappealing. You have managed to find out that the count this year will start with Mxgobgwq (a very large person), so you would like to know where not to stand. You don&apos;t know the direction, nor how many eligible people there are, but you can estimate the number (it is certainly less or equal than 1000000). <br><br><br>Write a program that will determine the `first&apos; (i.e. closest to Mxgobgwq) safe position to stand, regardless of the actual number of people and the direction of count (clockwise or anti-clockwise). <br><br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of a series of lines, each line containing the upper and lower estimates of the number of eligible people (both numbers inclusive). The file will be terminated by a line containing two zeroes (0 0). <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output will consist of a series of lines, one for each line of the input. Each line will consist of a single number giving the number of the position closest to Mxgobgwq that will not be chosen as chief for any number in the given range and for either direction of elimination. If no position is safe then print &quot;Better estimate needed&quot;. <br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">80 150\n40 150\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\nBetter estimate needed</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=uva&amp;source=1&amp;searchmode=source\"> uva </a> ","type":"source","format":"html"}]}