{"title":"Peter's Calculator","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1660","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1660&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1660","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1660"},"statement":[{"title":"Problem Description","content":"Unfortunately, Peter&apos;s Calculator broke down last week. Now Peter is left with his computer, which has no calculator application, and paper and pencil, which is too tiresome for an engineer. As one of Peter&apos;s friends, you are asked to write him a calculator application. After talking to him, you figure out the following: <br><br>Peter does only integer arithmetic. The operations he needs are addition, subtraction and multiplication.<br>He would like to use an arbitrary number of variables whose names are not longer than 50 characters.<br>His main way of doing calculations are to type in a few formulas and to assign them to variables. Some formulas are complicated expressions, which can refer to yet undefined variables, while other formulas consist of a single number. Then Peter asks for the value of some variables, i.e. he evaluates the formulas.<br>Peters wants to redefine some variables and then to reevaluate formulas that depend on these variables. <br>The input strictly adheres to the following syntax (given in EBNF): <br>file = line { line } &lt;EOF&gt;.<br>line = [ assignment | print | reset ] &lt;CR&gt;.<br>assignment = var &quot;:=&quot; expression.<br>print = &quot;PRINT&quot; var.<br>reset = &quot;RESET&quot;.<br>expression = term { addop term }.<br>term = factor { mulop factor }.<br>factor = &quot;(&quot; expression &quot;)&quot; | var | number.<br>addop = &quot;+&quot; | &quot;-&quot;.<br>mulop = &quot;*&quot;.<br>In the Extended Backus-Naur Formalism (EBNF), A = B C declares that the grammatical construct A consists of a B followed by a C . A = B | C means that A consists of a B or, alternatively, of a C . A = [ B ] defines construct A to be either a B or nothing and A = B tells you that A consists of the concatenation of any number of B&apos;s (including none). <br><br><br>The production var stands for the name of a variable, which starts with a letter followed by up to 49 letters or digits. Letters may be uppercase or lowercase. The production number stands for a integer number. The precise syntax for these productions are given below. The case of letters is important for both variables and statements. <br><br><br>var = letter { letter | digit }.<br>number = [ &quot;-&quot; ] digit { digit }.<br>letter = &quot;A&quot; | &quot;B&quot; | ... | &quot;Z&quot; | &quot;a&quot; | &quot;b&quot; | ... | &quot;z&quot;.<br>digit = &quot;0&quot; | &quot;1&quot; | ... | &quot;8&quot; | &quot;9&quot;.<br><br>Between the parts of a grammatical construct but not within the names of variables or integer numbers, any number of spaces may appear. &lt;EOF&gt; stands for the end of the input file and &lt;CR&gt; stands for the new-line character. All lines in the input file are shorter than 200 characters. <br><br><br>The value of a variable is said to be undefined: <br><br>if it has not yet been defined or it refers to a variable, which has not yet been defined;<br>if the definition of the variable contains a cycle. <br>Your are to write a program that implements Peter&apos;s calculator. It should store all variable definitions and for each &quot;PRINT&quot; statement evaluate the specified variable based on the latest variable definitions. If your program encounters a &quot;RESET&quot; statement, it should delete all stored variables so that all variables become undefined. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input file contains calculations adhering to the syntax given above. Each line contains either an assignment to a variable, a &quot;PRINT&quot; statement, a &quot;RESET&quot; statement or nothing. <br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each &quot;PRINT&quot; statement found in the input file, your program should output a line containing the numerical value of the specified variable or the word &quot;UNDEF&quot; if the variable is undefined.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">a := b + c\nb := 3\nc := 5\nPRINT d\nPRINT a\nb := 8\nPRINT a\nRESET\nPRINT a</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">UNDEF\n8\n13\nUNDEF</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=uva&amp;source=1&amp;searchmode=source\"> uva </a> ","type":"source","format":"html","require":["katex"]}]}