{"title":"Islands and Bridges ","time_limit":4000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1668","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1668&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1668","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1668"},"statement":[{"title":"Problem Description","content":"Given a map of islands and bridges that connect these islands, a Hamilton path, as we all know, is a path along the bridges such that it visits each island exactly once. On our map, there is also a positive integer value associated with each island. We call a Hamilton path the best triangular Hamilton path if it maximizes the value described below. <br><br>Suppose there are n islands. The value of a Hamilton path C1C2...Cn is calculated as the sum of three parts. Let Vi be the value for the island Ci. As the first part, we sum over all the Vi values for each island in the path. For the second part, for each edge CiCi+1 in the path, we add the product Vi*Vi+1. And for the third part, whenever three consecutive islands CiCi+1Ci+2 in the path forms a triangle in the map, i.e. there is a bridge between Ci and Ci+2, we add the product Vi*Vi+1*Vi+2. <br><br>Most likely but not necessarily, the best triangular Hamilton path you are going to find contains many triangles. It is quite possible that there might be more than one best triangular Hamilton paths; your second task is to find the number of such paths. <br><br><br><br>Input<br>The input file starts with a number q (q&lt;=20) on the first line, which is the number of test cases. Each test case starts with a line with two integers n and m, which are the number of islands and the number of bridges in the map, respectively. The next line contains n positive integers, the i-th number being the Vi value of island i. Each value is no more than 100. The following m lines are in the form x y, which indicates there is a (two way) bridge between island x and island y. Islands are numbered from 1 to n. You may assume there will be no more than 13 islands. <br><br><br>","type":"description","format":"html"},{"title":"Input","content":"The input file starts with a number q (q&lt;=20) on the first line, which is the number of test cases. Each test case starts with a line with two integers n and m, which are the number of islands and the number of bridges in the map, respectively. The next line contains n positive integers, the i-th number being the Vi value of island i. Each value is no more than 100. The following m lines are in the form x y, which indicates there is a (two way) bridge between island x and island y. Islands are numbered from 1 to n. You may assume there will be no more than 13 islands. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a line with two numbers, separated by a space. The first number is the maximum value of a best triangular Hamilton path; the second number should be the number of different best triangular Hamilton paths. If the test case does not contain a Hamilton path, the output must be `0 0&apos;. <br><br>Note: A path may be written down in the reversed order. We still think it is the same path. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 3\n2 2 2\n1 2\n2 3\n3 1\n4 6\n1 2 3 4\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">22 3\n69 1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2004+Asia+Regional+Shanghai+&amp;source=1&amp;searchmode=source\"> 2004 Asia Regional Shanghai  </a> ","type":"source","format":"html"}]}