{"title":"Jamie's Contact Groups ","time_limit":7000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1669","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1669&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1669","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1669"},"statement":[{"title":"Problem Description","content":"Jamie is a very popular girl and has quite a lot of friends, so she always keeps a very long contact list in her cell phone. The contact list has become so long that it often takes a long time for her to browse through the whole list to find a friend&apos;s number. As Jamie&apos;s best friend and a programming genius, you suggest that she group the contact list and minimize the size of the largest group, so that it will be easier for her to search for a friend&apos;s number among the groups. Jamie takes your advice and gives you her entire contact list containing her friends&apos; names, the number of groups she wishes to have and what groups every friend could belong to. Your task is to write a program that takes the list and organizes it into groups such that each friend appears in only one of those groups and the size of the largest group is minimized. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be at most 20 test cases. Ease case starts with a line containing two integers N and M. where N is the length of the contact list and M is the number of groups. N lines then follow. Each line contains a friend&apos;s name and the groups the friend could belong to. You can assume N is no more than 1000 and M is no more than 500. The names will contain alphabet letters only and will be no longer than 15 characters. No two friends have the same name. The group label is an integer between 0 and M - 1. After the last test case, there is a single line `0 0&apos; that terminates the input.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a line containing a single integer, the size of the largest contact group. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2\nJohn 0 1\nRose 1\nMary 1\n5 4\nACM 1 2 3\nICPC 0 1\nAsian 0 2 3\nRegional 1 2\nShangHai 0 2\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2004+Asia+Regional+Shanghai+&amp;source=1&amp;searchmode=source\"> 2004 Asia Regional Shanghai  </a> ","type":"source","format":"html","require":["katex"]}]}