{"title":"Cuckoo Hashing","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1672","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1672&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1672","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1672"},"statement":[{"title":"Problem Description","content":"One of the most fundamental data structure problems is the dictionary problem: given a set D of words you want to be able to quickly determine if any given query string q is present in the dictionary D or not. Hashing is a well-known solution for the problem. The idea is to create a function h : <img style=\"max-width:100%;\" src=\"/data/images/C114_1002_1.gif\">from all strings to the integer range 0, 1, .., n-1, i.e. you describe a fast deterministic program which takes a string as input and outputs an integer between 0 and n?1. Next you allocate an empty hash table T of size n and for each word w in D, you set T[h(w)] = w. Thus, given a query string q, you only need to calculate h(q) and see if T[h(q)] equals q, to determine if q is in the dictionary. <br>Seems simple enough, but aren&#xFFFD;&#xFFFD;t we forgetting something? Of course, what if two words in D map to the same location in the table? This phenomenon, called collision, happens fairly often (remember the Birthday paradox: in a class of 24 pupils there is more than 50% chance that two of them share birthday). On average you will only be able to put roughly sqrt(n)-sized dictionaries into the table without getting collisions, quite poor space usage!<br>A stronger variant is Cuckoo Hashing^1. The idea is to use two hash functions h1 and h2. Thus each string maps to two positions in the table. A query string q is now handled as follows: you compute both h1(q) and h2(q), and if T[h1(q)] = q, or T[h2(q)] = q, you conclude that q is in D. The name &#xFFFD;&#xFFFD;Cuckoo Hashing&#xFFFD;&#xFFFD; stems from the process of creating the table. Initially you have an empty table. You iterate over the words d in D, and insert them one by one. If T[h1(d)] is free, you set T[h1(d)] = d. Otherwise if T[h2(d)] is free, you set T[h2(d)] = d. If both are occupied however, just like the cuckoo with other birds&#xFFFD;&#xFFFD; eggs, you evict the word r in T[h1(d)] and set T[h1(d)] = d. Next you put r back into the table in its alternative place (and if that entry was already occupied you evict that word and move it to its alternative place, and so on). Of course, we may end up in an infinite loop here, in which case we need to rebuild the table with other choices of hash functions. The good news is that this will not happen with great probability even if D contains up to n/2 words!","type":"description","format":"html"},{"title":"Input","content":"On the first line of input is a single positive integer 1 &lt;= t &lt;= 50 specifying the number of test cases to follow. Each test case begins with two positive integers 1 &lt;= m &lt;= n &lt;= 10000 on a line of itself, m telling the number of words in the dictionary and n the size of the hash table in the test case. Next follow m lines of which the i:th describes the i:th word di in the dictionary D by two non-negative integers h1(di) and h2(di) less than n giving the two hash function values of the word di. The two values may be identical.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case there should be exactly one line of output either containing the string &#xFFFD;&#xFFFD;successful hashing&#xFFFD;&#xFFFD; if it is possible to insert all words in the given order into the table, or the string &#xFFFD;&#xFFFD;rehash necessary&#xFFFD;&#xFFFD; if it is impossible.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 3\n0 1\n1 2\n2 0\n5 6\n2 3\n3 1\n1 2\n5 1\n2 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">successful hashing\nrehash necessary</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Insigma+International+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A83%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#xFFFD;&#xFFFD;Insigma International Cup&#xFFFD;&#xFFFD; Zhejiang Collegiate Programming Contest - Warm Up&#xFFFD;&#xFFFD;3&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}