{"title":"Moogle","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1679","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1679&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1679","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1679"},"statement":[{"title":"Problem Description","content":"You got the original idea of making map software, called Moogle Maps, for the new cool Maple mPhone. It will even be capable of indicating the location of a house address like &#x201D;Main Street 13&#x201D;. However, since the mPhone has limited storage capacity, you need to reduce the data amount. You don&#x2019;t want to store the exact location of every single house number. Instead only a subset of the house numbers will be stored exactly, and the others will be linearly interpolated. <br>So you want to select house numbers that will minimise the average interpolation error, given how many house locations you have capacity to store. We view the street as a straight line, and you will always store the first and the last house location. <br>Given that you&#x2019;ve stored the locations xi and xj for the houses with numbers i and j respectively, but no other house in between, the interpolated value for a house with number k with i &lt; k &lt; j is xi + (xj - xi) * (k-i)/(j-i).<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input gives a single integer, 1 &lt;= t &lt;= 50, the number of test cases.<br>For each test case, there are two lines. The first contains 2 &lt;= h &lt;= 200 and 2 &lt;= c &lt;= h, where h is the number of houses in the street and c is the number of house locations that can be stored. The second contains h integers in increasing order giving the location of the h houses. Each location is in the interval [0, 1000000].<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the average interpolation error over all the h houses for the optimal selection of c house locations to store. The output should be given with four decimal places, but we will accept inaccuracies of up to &#xB1;0.001.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4 3\n0 9 20 40\n10 4\n0 10 19 30 40 90 140 190 202 210</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.2500\n0.3000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Insigma+International+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A83%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Insigma International Cup&#x201D; Zhejiang Collegiate Programming Contest - Warm Up&#xFF08;3&#xFF09; </a> ","type":"source","format":"html"}]}