{"title":"Mineshaft","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1682","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1682&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1682","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1682"},"statement":[{"title":"Problem Description","content":"A plumber has been hired to build an air pipe through a mineshaft from the bottom to the surface. The mineshaft was built without modern technology, so it winds its way up through the earth. Because it is very time consuming to bring the tools necessary to bend the pipe below the surface, the plumber wants to minimize the number of bends in the pipeline.<br><br>For example, for the mineshaft in the first picture below, the minimal number of bends in a pipeline from the bottom to the surface is two. Different optimal solutions exist, one of which is shown in the second picture. The bullets indicate the bends in the pipeline.<br><br><img style=\"max-width:100%;\" src=\"/data/images/1682_1.jpg\"><br><br>The two walls of the mineshaft are formed by sequences of straight segments. The numbers of segments in the two sequences may be different. Further, the horizontal distance between the walls of the mineshaft may vary, but is always positive. Both walls start at the same level and end at the same level.<br><br>On the way from the bottom of the mineshaft to the surface, the level (the y-coordinate) increases with every segment of a wall. Hence, the mineshaft does not have horizontal plateaus or &#x2018;ceilings&#x2019;, and at no point does it go back down again.<br><br>For the purpose of this task, you may assume the diameter of the pipeline to be 0. At no point may the pipeline cross the walls. In order to attach the pipeline firmly to the wall, each segment of the pipeline has to touch the walls at (at least) two different places. However, the bending points of the pipeline are weak. They cannot be used to attach the pipeline to the walls. The end points of the pipeline, though, at the bottom and the top of the mineshaft, may be used to attach a segment to the walls.<br><br>Hence, the solution in the third picture above (also having two bends) is not allowed, because the lowest segment of the pipeline can be attached to the walls at only one place: at the bottom of the right wall.<br><br>The pipeline must start anywhere at the bottom of the mineshaft, and must end anywhere on the imaginary line between the top of the left wall and the top of the right wall. Note, however, that the endpoints of the pipeline may only be used to attach the pipeline, if they touch a wall. In particular, the endpoint at the bottom cannot be attached to any position at the bottom which is not the bottom of a wall.<br><br>Finally, the angle that the pipeline makes at a bending point can take any value satisfying &amp;#8722;180&#xB0; &lt; &#x3B1; &lt; 180&#xB0; and (of course) &#x3B1; &#x2260; 0.<br><br>Note that sometimes it may be useful to have the pipeline intersect with itself. For example, in the mineshaft below, this is needed to get from the bottom to the top of the mineshaft with only three bends.<br><br><img style=\"max-width:100%;\" src=\"/data/images/1682_2.jpg\"><br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input file contains a single number: the number of test cases to follow. Each test case has the following format:<br><br>One line with one integer N1 (2 &#x2264; N1 &#x2264; 25): the number of points describing the left wall of the mineshaft.<br><br>N1 lines with the coordinates of the points describing the left wall of the mineshaft, from the bottom to the top. The ith line contains two integers xi and yi (-1,000 &#x2264; xi &#x2264; 1,000 and 0 &#x2264; yi &#x2264; 1,000) separated by a single space: the x- and y-coordinate of the point, respectively.<br><br>The y-coordinates are monotonically increasing: y1 &lt; y2 &lt; &#x2026; &lt; yN1.<br><br>One line with one integer N2 (2 &#x2264; N2 &#x2264; 25): the number of points describing the right wall of the mineshaft.<br><br>N2 lines with the coordinates of the points describing the right wall of the mineshaft, from the bottom to the top. The ith line contains two integers x&#x2032;i and y&#x2032;i (-1,000 &#x2264; x&#x2032;i &#x2264; 1,000 and 0 &#x2264; y&#x2032;i &#x2264; 1,000) separated by a single space: the x- and y-coordinate of the point, respectively.<br><br>The y-coordinates are monotonically increasing: y&#x2032;1 &lt; y&#x2032;2 &lt; &#x2026; &lt; y&#x2032;N2.<br><br>We always have x1 &lt; x&#x2032;1, y1 = y&#x2032;1, xN1 &lt; x&#x2032;N2, and yN1 = y&#x2032;N2. The walls described by the sequences of points do not cross or even touch each other.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For every test case in the input file, the output should contain a single number, on a single line: the minimum number of bends in the pipeline to make it from the bottom of the mineshaft to the top, under the conditions from the problem description.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n7\n4 0\n8 2\n3 7\n5 9\n3 12\n6 14\n4 16\n5\n7 0\n10 2\n6 6\n10 12\n8 16\n6\n-10 10\n-10 20\n10 22\n5 27\n0 37\n5 47\n8\n-8 10\n-8 16\n3 17\n9 19\n14 24\n18 32\n18 40\n11 47</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BB%AA%B6%AB%C7%F8%B4%F3%D1%A7%C9%FA%B3%CC%D0%F2%C9%E8%BC%C6%D1%FB%C7%EB%C8%FC_%C8%C8%C9%ED%C8%FC&amp;source=1&amp;searchmode=source\"> &#x534E;&#x4E1C;&#x533A;&#x5927;&#x5B66;&#x751F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x9080;&#x8BF7;&#x8D5B;_&#x70ED;&#x8EAB;&#x8D5B; </a> ","type":"source","format":"html"}]}