{"title":"Projects","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1684","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1684&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1684","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1684"},"statement":[{"title":"Problem Description","content":"In a certain week, a company wants to finish m projects. To this end, the company can employ at most n people from the unemployment agency for a period of one week. Each external employee will cost the company salary euro, unless the project in which he/she is involved is not completed in time. In that case no payment is due.<br><br>For each project the company knows from experience the probability that the project will be completed within a week, as a function of the number of employees working on it. These probabilities are given as percentages pij, where i (with 1 &#x2264; i &#x2264; m) is the number of the project and j is the number of people working on it. Of course, when nobody is working on a project i, the probability pi0 is zero percent.<br><br>If project i is indeed finished within a week, the company earns reward(i) euro; if it is not ready in time, the company has to pay a fine of punishment(i) euro.<br><br>Of course the company wants to maximise its total expected profit1 at the end of the week by finding the optimal number of external employees to hire, and how to divide them over the projects. The optimal number of employees is the total number of people needed to achieve the maximal expected profit. Your task in this matter is to calculate this optimal number of external employees. Remember that at most n people are available. Furthermore: if a person is employed, he/she works on one and only one project.<br><br><br>--------------------------------------------------------------------------------<br><br>1Let p (0 &lt; p &lt; 1) be the probability that a job is finished in time, and let E1 be the profit in that case. Furthermore, let E2 be the (negative) profit in case the job is not finished in time. Then the expected profit for this particular job is p*E1 + (1 - p)*E2.<br><br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input file contains a single number: the number of test cases to follow. Each test case has the following format:<br><br>One line with one integer m with 1 &#x2264; m &#x2264; 100: the number of projects.<br>One line with one integer n with 0 &#x2264; n &#x2264; 100: the maximal number of available employees.<br>One line with one integer salary with 0 &#x2264; salary &#x2264; 1,000: the salary of one employee. Remember that the salary is given in euros.<br>m lines, each line corresponding to a project i, containing n integers pi1, pi2, &#x2026;, pin (the percentages, with 0 &#x2264; pi1, pi2, &#x2026;, pin &#x2264; 100), followed by two integers corresponding to the reward and the punishment for project i. All values are separated by single spaces. Both reward and punishment are given in euros and are between 0 and 100,000 (boundaries included).<br>","type":"input_format","format":"html"},{"title":"Output","content":"For every test case in the input file, the output should contain two lines.<br><br>The first line contains the maximal expected profit in eurocents.<br>The second line contains the total number of external employees that must be hired in order to achieve this maximal expected profit. If the maximal expected profit can be achieved by different (total) numbers of employees, then these different numbers must be given in increasing order. Numbers have to be separated by single spaces.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1\n4\n200\n90 100 100 100 2000 0\n2\n2\n100\n80 80 2100 500\n0 100 1700 500\n3\n4\n100\n100 80 80 70 1000 100\n100 90 80 90 500 50\n100 70 60 50 700 100</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">162000\n1\n100000\n1 2\n190000\n3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BB%AA%B6%AB%C7%F8%B4%F3%D1%A7%C9%FA%B3%CC%D0%F2%C9%E8%BC%C6%D1%FB%C7%EB%C8%FC_%C8%C8%C9%ED%C8%FC&amp;source=1&amp;searchmode=source\"> &#x534E;&#x4E1C;&#x533A;&#x5927;&#x5B66;&#x751F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x9080;&#x8BF7;&#x8D5B;_&#x70ED;&#x8EAB;&#x8D5B; </a> ","type":"source","format":"html"}]}