{"title":"Sightseeing","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1688","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1688&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1688","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1688"},"statement":[{"title":"Problem Description","content":"Tour operator Your Personal Holiday organises guided bus trips across the Benelux. Every day the bus moves from one city S to another city F. On this way, the tourists in the bus can see the sights alongside the route travelled. Moreover, the bus makes a number of stops (zero or more) at some beautiful cities, where the tourists get out to see the local sights.<br><br>Different groups of tourists may have different preferences for the sights they want to see, and thus for the route to be taken from S to F. Therefore, Your Personal Holiday wants to offer its clients a choice from many different routes. As hotels have been booked in advance, the starting city S and the final city F, though, are fixed. Two routes from S to F are considered different if there is at least one road from a city A to a city B which is part of one route, but not of the other route.<br><br>There is a restriction on the routes that the tourists may choose from. To leave enough time for the sightseeing at the stops (and to avoid using too much fuel), the bus has to take a short route from S to F. It has to be either a route with minimal distance, or a route which is one distance unit longer than the minimal distance. Indeed, by allowing routes that are one distance unit longer, the tourists may have more choice than by restricting them to exactly the minimal routes. This enhances the impression of a personal holiday.<br><br><img style=\"max-width:100%;\" src=\"/data/images/1688_1.jpg\"><br><br>For example, for the above road map, there are two minimal routes from S = 1 to F = 5: 1 &#x2192; 2 &#x2192; 5 and 1 &#x2192; 3 &#x2192; 5, both of length 6. There is one route that is one distance unit longer: 1 &#x2192; 3 &#x2192; 4 &#x2192; 5, of length 7.<br><br>Now, given a (partial) road map of the Benelux and two cities S and F, tour operator Your Personal Holiday likes to know how many different routes it can offer to its clients, under the above restriction on the route length.<br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input file contains a single number: the number of test cases to follow. Each test case has the following format:<br><br>One line with two integers N and M, separated by a single space, with 2 &#x2264; N &#x2264; 1,000 and 1 &#x2264; M &#x2264; 10, 000: the number of cities and the number of roads in the road map.<br><br>M lines, each with three integers A, B and L, separated by single spaces, with 1 &#x2264; A, B &#x2264; N, A &#x2260; B and 1 &#x2264; L &#x2264; 1,000, describing a road from city A to city B with length L.<br><br>The roads are unidirectional. Hence, if there is a road from A to B, then there is not necessarily also a road from B to A. There may be different roads from a city A to a city B.<br><br>One line with two integers S and F, separated by a single space, with 1 &#x2264; S, F &#x2264; N and S &#x2260; F: the starting city and the final city of the route.<br><br>There will be at least one route from S to F.<br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case in the input file, the output should contain a single number, on a single line: the number of routes of minimal length or one distance unit longer. Test cases are such, that this number is at most 10^9 = 1,000,000,000.<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5 8\n1 2 3\n1 3 2\n1 4 5\n2 3 1\n2 5 3\n3 4 2\n3 5 4\n4 5 3\n1 5\n5 6\n2 3 1\n3 2 1\n3 1 10\n4 5 2\n5 2 7\n5 2 7\n4 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BB%AA%B6%AB%C7%F8%B4%F3%D1%A7%C9%FA%B3%CC%D0%F2%C9%E8%BC%C6%D1%FB%C7%EB%C8%FC_%C8%C8%C9%ED%C8%FC&amp;source=1&amp;searchmode=source\"> &#x534E;&#x4E1C;&#x533A;&#x5927;&#x5B66;&#x751F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x9080;&#x8BF7;&#x8D5B;_&#x70ED;&#x8EAB;&#x8D5B; </a> ","type":"source","format":"html","require":["katex"]}]}