{"title":"Eat the Trees","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1693","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1693&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1693","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1693"},"statement":[{"title":"Problem Description","content":"Most of us know that in the game called DotA(Defense of the Ancient), Pudge is a strong hero in the first period of the game. When the game goes to end however, Pudge is not a strong hero any more.<br>So Pudge&#x2019;s teammates give him a new assignment&#x2014;Eat the Trees!<br><br>    The trees are in a rectangle N * M cells in size and each of the cells either has exactly one tree or has nothing at all. And what Pudge needs to do is to eat all trees that are in the cells.<br>    There are several rules Pudge must follow:<br>I. Pudge must eat the trees by choosing a circuit and he then will eat all trees that are in the chosen circuit.<br>II. The cell that does not contain a tree is unreachable, e.g. each of the cells that is through the circuit which Pudge chooses must contain a tree and when the circuit is chosen, the trees which are in the cells on the circuit will disappear.<br>III. Pudge may choose one or more circuits to eat the trees.<br><br>Now Pudge has a question, how many ways are there to eat the trees?<br>At the picture below three samples are given for N = 6 and M = 3(gray square means no trees in the cell, and the bold black line means the chosen circuit(s))<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C116-1005-1.JPG\"></center><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of several test cases. The first line of the input is the number of the cases. There are no more than 10 cases.<br>For each case, the first line contains the integer numbers N and M, 1&lt;=N, M&lt;=11. Each of the next N lines contains M numbers (either 0 or 1) separated by a space. Number 0 means a cell which has no trees and number 1 means a cell that has exactly one tree.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, you should print the desired number of ways in one line. It is guaranteed, that it does not exceed 2<sup>63</sup> &#x2013; 1. Use the format in the sample.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6 3\n1 1 1\n1 0 1\n1 1 1\n1 1 1\n1 0 1\n1 1 1\n2 4\n1 1 1 1\n1 1 1 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: There are 3 ways to eat the trees.\nCase 2: There are 2 ways to eat the trees.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Sunline+Cup%A1%B1+National+Invitational+Contest&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Sunline Cup&#x201D; National Invitational Contest </a> ","type":"source","format":"html","require":["katex"]}]}