{"title":"Escape","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1733","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1733&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1733","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1733"},"statement":[{"title":"Problem Description","content":"Loneknight hates attending class very much. Every time he is attending class, when he feel tiresome with the class, he start planning the shortest path he can escape from the classroom. Therefore, he can escape from classroom so quickly that he is always the first one escape from the classroom after the class finishes. He is very proud of this fact. <br><br>One day, loneknight is day dreaming in class, and planning the shortest path for escaping. Suddently, an issue come into his mind, if everyone in the classroom want to escape as soon as possible just as loneknight, what will happend? As a kind man, loneknight want to plan a strategy that will let everyone escape from the classroom with minimum time consume. But after dozens of minutes of consideration, loneknight find this problem so difficult for him.<br><br> Now, as the best friend of him, please design a algorithm to solve this problem for him. Note that, at every time unit, everyone can move seperately up, down, left, right one unit, or stay in the old position. In addtion, no one can move to a wall or out of the room, the only way to escape is go through a gate. Moreover, at every time unit, a position can only contain a person, including gates. That means if in time t, a person escape thourgh gate g, no one can go into g in time t, but can go into g in t + 1. Now, it&apos;s your job to calculate the minimum time required to escape for everyone. ","type":"description","format":"html"},{"title":"Input","content":"The input consists of several test cases. Each test case start with a line containing two number, n, m (1 &lt; n, m &lt;= 16), the rows and the columns of the room. Then n lines follow, each contain exact m characters, representing th type of unitin it. (. for empty place, X for human, # for wall, @ for gate). Input is end with EOF.","type":"input_format","format":"html"},{"title":"Output","content":"You have to print the shortest time needed for everyone escape from the roomin a single line for each case. (-1 if impossible)","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 4\n.@..\n.X..\n....\n....\n\n4 4\n.@..\n.XX.\n.XX.\n..@.\n\n4 4\n.@..\n.#..\n#X#.\n.#..</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\n-1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%A1%B0%CD%F8%D0%C2%B6%F7%C6%D5%B1%AD%A1%B1%BA%BC%D6%DD%B5%E7%D7%D3%BF%C6%BC%BC%B4%F3%D1%A7%B3%CC%D0%F2%C9%E8%BC%C6%D1%FB%C7%EB%C8%FC&amp;source=1&amp;searchmode=source\"> &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xB6;&#xFFFD;&#xFFFD;&#x571;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x775;&#xFFFD;&#xFFFD;&#x4FF;&#x1BC;&#xFFFD;&#xFFFD;&#xFFFD;&#x467;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}