{"title":"Get Luffy Out *","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1816","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1816&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1816","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1816"},"statement":[{"title":"Problem Description","content":"Ratish is a young man who always dreams of being a hero. One day his friend Luffy was caught by Pirate Arlong. Ratish set off at once to Arlong&apos;s island. When he got there, he found the secret place where his friend was kept, but he could not go straight in. He saw a large door in front of him and two locks in the door. Beside the large door, he found a strange rock, on which there were some odd words. The sentences were encrypted. But that was easy for Ratish, an amateur cryptographer. After decrypting all the sentences, Ratish knew the following facts: <br><br>Behind the large door, there is a nesting prison, which consists of M floors. Each floor except the deepest one has a door leading to the next floor, and there are two locks in each of these doors. Ratish can pass through a door if he opens either of the two locks in it. There are 2N different types of locks in all. The same type of locks may appear in different doors, and a door may have two locks of the same type. There is only one key that can unlock one type of lock, so there are 2N keys for all the 2N types of locks. These 2N keys were made N pairs,one key may be appear in some pairs, and once one key in a pair is used, the other key will disappear and never show up again. <br><br>Later, Ratish found N pairs of keys under the rock and a piece of paper recording exactly what kinds of locks are in the M doors. But Ratish doesn&apos;t know which floor Luffy is held, so he has to open as many doors as possible. Can you help him to choose N keys to open the maximum number of doors?<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases. Every test case starts with a line containing two positive integers N (1 &lt;= N &lt;= 2^10) and M (1 &lt;= M &lt;= 2^11) separated by a space, the first integer represents the number of types of keys and the second integer represents the number of doors. The 2N keys are numbered 0, 1, 2, ..., 2N - 1. Each of the following N lines contains two integers, which are the numbers of two keys in a pair. After that, each of the following M lines contains two integers, which are the numbers of two keys corresponding to the two locks in a door. You should note that the doors are given in the same order that Ratish will meet. A test case with N = M = 0 ends the input, and should not be processed.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing an integer, which is the maximum number of doors Ratish can open.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 6\n0 3\n1 2\n4 5\n0 1\n0 2\n4 1\n4 2\n3 5\n2 2\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>&#x9898;&#x76EE;&#x6709;&#x66F4;&#x6539;&#xFF01;</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Beijing+2005&amp;source=1&amp;searchmode=source\"> Beijing 2005 </a> ","type":"source","format":"html"}]}