{"title":"Bishops","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1819","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1819&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1819","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1819"},"statement":[{"title":"Problem Description","content":"Yesterday was Sam&apos;s birthday. The most interesting gift was definitely the chessboard. Sam quickly learned the rules of chess and defeated his father, all his friends, his little sister, and now no one wants to play with him any more. <br><br>So he decided to play with another birthday gift &#xFFFD;C a Book of Math Problems for Young Mathematicians. He opened the book somewhere in the middle and read the following problem: &quot;How many knights can be placed on a chessboard without threatening each other?&quot; After a while he realized that this was trivial and moved on to the next problem: &quot;How many bishops can be placed on a chessboard without threatening each other?&quot;. Sam is in trouble here. He is not able to solve this problem and needs your help. <br><br><b>Task Specification</b><br><br>Sam&apos;s chessboard has size N&#xFFFD;&#xFFFD;N. A bishop can move to any distance in any of the four diagonal directions. A bishop threatens another bishop if it can move to the other bishop&apos;s position. Your task is to compute the maximum number of bishops that can be placed on a chessboard in such a way that no two bishops threaten each other. <br><br>","type":"description","format":"html"},{"title":"Input","content":"The input file consists of several lines. The line number i contains a single number representing the size( &lt;10^100) of the i-th chessboard.","type":"input_format","format":"html"},{"title":"Output","content":"The output file should contain the same number of lines as the input file. The i-th line should contain one number &#xFFFD;C the maximum number of bishops that can be placed on i-th chessboard without threatening each other. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IPSC+2004&amp;source=1&amp;searchmode=source\"> IPSC 2004 </a> ","type":"source","format":"html"}]}