{"title":"Intermediate Rounds for Multicasting","time_limit":1000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1844","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1844&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1844","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1844"},"statement":[{"title":"Problem Description","content":"Consider a communication network consisting of N nodes numbered from 1 to N. The nodes are interconnected in such a way that the network has the shape of a rooted tree, with node 1 as the root. Node 1 wants to send a message (the same message) to each node which is a leaf in the tree (i.e. has no sons) &#x2013; this operation is known as multicast. A message can only be sent from one node to one of its descendants (including the node itself). Each edge of the tree has an associated cost and the cost of sending a message from a node X to one of its descendants Y is the sum of the costs of the edges on the unique path from X to Y (if X=Y, then the cost is 0). The total cost of a multicast strategy is the sum of the costs of sending each message.<br>In order to reach its goal, node 1 will use the following multicast strategy: The strategy consists of K intermediate rounds. In the first round, node 1 sends an individual message to a subset of nodes S<sub>1</sub> such that each leaf is a descendant of exactly one node X in S<sub>1</sub> (this means that any node X in S<sub>1</sub> is not a descendant of another node Y in S<sub>1</sub>). In round i (2&lt;=i&lt;=K), each node X in S<sub>i</sub>-1 sends an individual message to a subset S<sub>i</sub>,X  of nodes from its subtree, such that each leaf which is a descendant of X is also a descendant of exactly one node in S<sub>i</sub>,X. The set of nodes S<sub>i</sub> is the union of the sets S<sub>i</sub>,X, for each X in S<sub>i</sub>-1. In the end, each node X in S<sub>k</sub> must send a message to each leaf node which is a descendant of X.<br>Given the communication network, the cost of each edge and the number of intermediate rounds K, find the minimum total cost of a multicast strategy.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains an integer number T, representing the number of test cases to follow. The first line of each test case contains 2 integer numbers: N (1&lt;=N&lt;=333) and K (1&lt;=K&lt;=10). The next N-1 lines contain 3 integers each: A, B and C (1&lt;=C&lt;=10.000), meaning that node B is a son of node A and the edge (A,B) has cost C.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each of the T test cases, in the order given in the input, print one line containing the minimum total cost of a multicast strategy having the specified properties.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n6 1\n1 2 10\n1 3 11\n2 4 21\n2 5 17\n3 6 7</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">66\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In the first (and only) intermediate round, node 1 sends messages to node 6 (with cost 18) and to node 2 (with cost 10). \nSo the set S1 is {2,6}. In the end, node 6 will send a message to itself (with cost 0) and node 2 will send messages to node 4 (with cost 21)\n and to node 5 (with cost 17). The total cost is 18+10+21+17=66.\n<center><img src=\"../../../data/images/C92-1009-1.jpg\"></center>\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Mugurel Ionut Andreica","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Politehnica+University+of+Bucharest+Local+Team+Contest+2007&amp;source=1&amp;searchmode=source\"> Politehnica University of Bucharest Local Team Contest 2007 </a> ","type":"source","format":"html","require":["katex"]}]}