{"title":"Strange Billboard","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1882","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1882&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1882","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1882"},"statement":[{"title":"Problem Description","content":"The marketing and public-relations department of the Czech Technical University has designed a new reconfigurable mechanical Flip-Flop  Bill-Board  (FFBB).  The billboard is a regular two-dimensional grid of R &#xD7;C square tiles made of plastic.  Each plastic tile is white on one side and black on the other.  The idea of the billboard is that you can create various pictures by flipping individual tiles over.  Such billboards will hang above all entrances to the university and will be used to display simple pictures and advertise upcoming academic events. <br><br>To change pictures, each billboard is equipped with a &#x201D;reconfiguration  device&#x201D;.  The device is just an ordinary long wooden stick that is used to tap the tiles. if you tap a tile, it flips over to the other side, i.e., it changes from white to black or vice versa.  Do you agree this idea is very clever? <br><br>Unfortunately, the billboard makers did not realize one thing. The tiles  are very close to each other and their sides touch.  Whenever a tile is tapped, it takes all neighboring tiles with it and all of them flip over together.  Therefore, if you want to change the color of a tile, all neighboring tiles  change  their  color  too. Neighboring  tiles  are  those  that  touch  each  other  with  the  whole side.  All inner tiles have 4 neighbors, which means 5 tiles are flipped over when tapped.  Border tiles have less neighbors, of course. <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C106-1001-1.JPG\"></center><br><br>For example, if you have the billboard configuration shown in the left picture above and tap the tile marked with the cross, you will get the picture on the right. As you can see, the billboard reconfiguration  is  not  so  easy  under  these  conditions.    Your  task  is  to  find  the  fastest  way  to &#x201D;clear&#x201D; the billboard, i.e., to flip all tiles to their white side. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The  input  consists  of  several  billboard  descriptions.   Each  description  begins  with  a  line  containing two integer numbers R and C  (1 &#x2264; R, C &#x2264; 16) specifying the billboard size.  Then there are R lines, each containing C  characters.  The characters can be either an uppercase letter &#x201C;X&#x201D; (black) or a dot &#x201C;.&#x201D;  (white).  There is one empty line after each map.  <br>The input is terminated by two zeros in place of the board size. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each billboard, print one line containing the sentence &#x201C;You        have   to  tap   T  tiles.&#x201D;, where T is  the  minimal  possible  number  of  taps  needed  to make all squares white. if the situation cannot be solved, output the string &#x201C;Damaged billboard.&#x201D; instead. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5\nXX.XX\nX.X.X\n.XXX.\nX.X.X\nXX.XX\n5 5\n.XX.X\n.....\n..XXX\n..X.X\n..X..\n\n1 5\n...XX\n\n5 5\n...X.\n...XX\n.XX..\n..X..\n.....\n\n8 9\n..XXXXX..\n.X.....X.\nX..X.X..X\nX.......X\nX.X...X.X\nX..XXX..X\n.X.....X.\n..XXXXX..\n\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">You have to tap 5 tiles.\nDamaged billboard.\nYou have to tap 1 tiles.\nYou have to tap 2 tiles.\nYou have to tap 25 tiles.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Shun+Yu+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A82%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Shun Yu Cup&#x201D; Zhejiang Collegiate Programming Contest - Warm Up&#xFF08;2&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}