{"title":"Key Task","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1885","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1885&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1885","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1885"},"statement":[{"title":"Problem Description","content":"The Czech Technical University is rather old &#xFFFD;&#xFFFD; you already know that it celebrates 300 years of its existence in 2007. Some of the university buildings are old as well. And the navigation in old buildings can sometimes be a little bit tricky, because of strange long corridors that fork and join at absolutely unexpected places. <br><br>The result is that some first-graders have often di?culties finding the right way to their classes. Therefore, the Student Union has developed a computer game to help the students to practice their orientation skills. The goal of the game is to find the way out of a labyrinth. Your task is to write a verification software that solves this game. <br><br>The labyrinth is a 2-dimensional grid of squares, each square is either free or filled with a wall. Some of the free squares may contain doors or keys. There are four di?erent types of keys and doors: blue, yellow, red, and green. Each key can open only doors of the same color. <br><br>You can move between adjacent free squares vertically or horizontally, diagonal movement is not allowed. You may not go across walls and you cannot leave the labyrinth area. If a square contains a door, you may go there only if you have stepped on a square with an appropriate key before. ","type":"description","format":"html"},{"title":"Input","content":"The input consists of several maps. Each map begins with a line containing two integer numbers R and C (1 &#xFFFD;&#xFFFD; R, C &#xFFFD;&#xFFFD; 100) specifying the map size. Then there are R lines each containing C characters. Each character is one of the following: <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C106-1004-1.JPG\"></center><br><br>Note that it is allowed to have <br> <li> more than one exit, </li><br> <li> no exit at all, </li><br> <li> more doors and/or keys of the same color, and </li><br> <li> keys without corresponding doors and vice versa. </li><br><br>You may assume that the marker of your position (&#xFFFD;&#xFFFD;*&#xFFFD;&#xFFFD;) will appear exactly once in every map. <br><br>There is one blank line after each map. The input is terminated by two zeros in place of the map size. ","type":"input_format","format":"html"},{"title":"Output","content":"For each map, print one line containing the sentence &#xFFFD;&#xFFFD;Escape possible in S steps.&#xFFFD;&#xFFFD;, where S is the smallest possible number of step to reach any of the exits. If no exit can be reached, output the string &#xFFFD;&#xFFFD;The poor student is trapped!&#xFFFD;&#xFFFD; instead. <br><br>One step is defined as a movement between two adjacent cells. Grabbing a key or unlocking a door does not count as a step. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 10\n*........X\n\n1 3\n*#X\n\n3 20\n####################\n#XY.gBr.*.Rb.G.GG.y#\n####################\n\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Escape possible in 9 steps.\nThe poor student is trapped!\nEscape possible in 45 steps.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Shun+Yu+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A82%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#xFFFD;&#xFFFD;Shun Yu Cup&#xFFFD;&#xFFFD; Zhejiang Collegiate Programming Contest - Warm Up&#xFFFD;&#xFFFD;2&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}