{"title":"Weird Numbers","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1887","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1887&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1887","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1887"},"statement":[{"title":"Problem Description","content":"Binary numbers form the principal basis of computer science. Most of you have heard of other systems, such as ternary, octal, or hexadecimal. You probably know how to use these systems and how to convert numbers between them. But did you know that the system base (radix) could also be negative? One assistant professor at the Czech Technical University has recently met negabinary numbers and other systems with a negative base. Will you help him to convert numbers to and from these systems? <br><br>A number N written in the system with a positive base R will always appear as a string of digits between 0 and R - 1, inclusive. A digit at the position P (positions are counted from right to left and starting with zero) represents a value of R^P . This means the value of the digit is multiplied by R^P and values of all positions are summed together. For example, if we use the octal system (radix R = 8), a number written as 17024 has the following value: <br><br> 1.8^4 + 7.8^3 + 0.8^2 + 2.8^1 + 4.8^0 = 1.4096 + 7.512 + 2.8 + 4.1 = 7700<br><br>With a negative radix -R, the principle remains the same: each digit will have a value of (-R)^P . <br>For example, a negaoctal (radix R = -8) number 17024 counts as: <br><br> 1.(-8)^4 + 7.(-8)^3 + 0.(-8)^2 + 2.(-8)^1 + 4.(-8)^0 = 1.4096 - 7.512 - 2.8 + 4.1 = 500 <br><br>One big advantage of systems with a negative base is that we do not need a minus sign to express negative numbers. A couple of examples for the negabinary system (R = -2): <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C106-1006-1.JPG\"></center> <br><br>You may notice that the negabinary representation of any integer number is unique, if no &#x201C;leading zeros&#x201D; are allowed. The only number that can start with the digit &#x201C;0&#x201D;, is the zero itself. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input will contain several conversions, each of them specified on one line. A conversion from the decimal system to some negative-base system will start with a lowercase word &#x201C;to&#x201D; followed by a minus sign (with no space before it), the requested base (radix) R, one space, and a decimal number N . <br><br>A conversion to the decimal system will start with a lowercase word &#x201C;from&#x201D;, followed by a minus sign, radix R, one space, and a number written in the system with a base of -R. <br><br>The input will be terminated by a line containing a lowercase word &#x201C;end&#x201D;. All numbers will satisfy the following conditions: 2 &#x2264; R &#x2264; 10, -1000000&#x2264;N&#x2264;1000000 (decimal). <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each conversion, print one number on a separate line. If the input used a decimal format,output the same number written in the system with a base -R. If the input contained such a number, output its decimal value. <br><br>Both input and output numbers must not contain any leading zeros. The minus sign &quot;-&quot; may only be present with negative numbers written in the decimal system. Any non-negative number or a number written in a negative-base system must not start with it. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">to-2 10\nfrom-2 1010\nto-10 10\nto-10 -10\nfrom-10 10\nend</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">11110\n-10\n190\n10\n-10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Shun+Yu+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A82%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Shun Yu Cup&#x201D; Zhejiang Collegiate Programming Contest - Warm Up&#xFF08;2&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}