{"title":"Reaux! Sham! Beaux! ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1889","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1889&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1889","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1889"},"statement":[{"title":"Problem Description","content":"Roshambo &#x2014; this simple game is known all around the world. In German, it is called &#x201C;Schnick, Schnack, Schnuck&#x201D;, in Japanese &#x201C;Janken&#x201D;, in Spanish &#x201C;Cachip&#x2032;un&#x201D;, in Polish &#x201C;Papier, kamie&#x2032;n, no&#x2D9;zyce&#x201D;. The Czechs call it &#x201C;K&#x2032;amen, n?u&#x2C7;zky, pap&#x2032;?r&#x201D;. <br><br>Whatever is the name of the game, its principles remain the same. Two players simultaneously form their hand into one of three possible shapes (symbols): Rock (closed fist), Paper (open hand), or Scissors (two fingers extended). If both of them show the same symbol, it is a tie and no points are given. Otherwise, one of the symbols wins: Rock blunts Scissors, Scissors cut Paper, and Paper covers Rock. <br><br>Czech Technical University students also know the game very well and use it to resolve small disputes. Imagine, for example, two students living together in one room. Yesterday evening, there was a small celebration, and in the morning, no one wants to go to the lectures. They agreed that one person would be enough to take notices for both, but who will be the poor one? Roshambo is a very effective way to decide. <br><br>Did you know there are even the World Series of Roshambo? Our organizing team would like to host the World Championships in 2009. Your task is to help us in developing a Roshambo scoring system and write a program that evaluates one game between two players. <br><br>Since the participants will come from di?erent countries, the system must accept input in various languages. The following table shows names of three Roshambo symbols. Note that in some languages, there may be two different words for the same symbol. <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C106-1008-1.JPG\"></center>","type":"description","format":"html"},{"title":"Input","content":"The input contains several games. Each game starts with two lines describing players. Each of these two lines contains two lowercase letters specifying the language used by the player (see the language code in the table above), one space, and a player name. The name will consist from at most twenty upper- or lower-case letters. <br><br>After the players description, there are at most 100 lines containing individual rounds. Each round is described by two words separated with one space. The words name the symbol shown by the first and second player, respectively. All symbols are named in the mother tongue of the concerned player. All allowed words are shown in the table above, the first letter will be always in uppercase, all other letters in lowercase. <br><br>The last round is followed by a line containing one single dash character (&#x201C;-&#x201D;) and then the next game begins. The only exception is the last game in the input, which is terminated by a dot (&#x201C;.&#x201D;) instead of the dash. ","type":"input_format","format":"html"},{"title":"Output","content":"For each game, print five lines of output. The first line should contain the string &#x201C;Game #G :&#x201D;, where G is the number of the game, starting with one. <br><br>The second line will contain the first player name followed by a colon (&#x201C; :&#x201D;), one space and the number of rounds won by that player. The number should be followed by one space and the word &#x201C;points&#x201D;. Use the singular form &#x201C;point&#x201D; if (and only if) the number of points of the player equals one. <br><br>The third line has the same format and shows the second player&#x2019;s name and points. <br><br>The fourth line displays the outcome of the game. It must contain the word &#x201C;WINNER&#x201D; followed by a colon, space and the name of the player who gained more points. If both players have the same number of points, the fourth line will contain words &#x201C;TIED GAME&#x201D; instead. <br><br>The fifth line is left empty to visually separate individual games. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">cs Pepik\nen Johnny\nNuzky Scissors\nPapir Rock\nPapir Scissors\n-\nde Gertruda\ncs Lenka\nStein Papir\nSchere Kamen\n.</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Game #1:\nPepik: 1 point\nJohnny: 1 point\nTIED GAME\n\nGame #2:\nGertruda: 0 points\nLenka: 2 points\nWINNER: Lenka</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Shun+Yu+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A82%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Shun Yu Cup&#x201D; Zhejiang Collegiate Programming Contest - Warm Up&#xFF08;2&#xFF09; </a> ","type":"source","format":"html"}]}