{"title":"Tough Water Level","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1891","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1891&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1891","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1891"},"statement":[{"title":"Problem Description","content":"Czech Technical University has the word &#x201C;technical&#x201D; in its name. Beside others, this means that lectures in physics are important here. Do you still remember some of the basic physical principles? <br><br>For example, imagine a simple glass of water. Or, we will rather call it a cup to avoid ambiguity of this word. So, imagine a simple cup (made of glass) that is partially filled with water. You might have noticed that the stability of such a cup depends on the amount of water inside. If you brush against a full cup, it is relatively easy to knock it down and spill its contents. If the cup is empty, there is fortunately nothing to be spilled, but other than that, the situation does not improve much &#x2014; it is still easy to knock the cup down with only a little force. The best stability is usually achieved with a &#x201C;half-full&#x201D; cup. <br><br>In this problem, your task is to determine the water level that makes a cup as much stable as possible. For the purpose of this problem, we will make a simple assumption that the &#x201C;stability&#x201D; of a cup is higher, if its center of mass (sometimes also called the center of gravity) is lower (closer to the bottom). <br><br>The center of mass can be informally defined as follows: Imagine that glass and water consist of a very large number of very small particles. Then the center of mass is an average of the position of all these particles. The average is weighted by particle masses. Since the density of glass is approximately 2 500 kg.m-3 and the density of water only 1 000 kg.m-3 , we will suppose that the mass of a glass particle is 2.5 times higher than the mass of a water particle of the same size. <br><br>All cups considered in this problem will have an exact rotary shape. But their radius may vary with the height &#x2014; some cups are wider at the top, others are wider at the bottom. Also, the thickness of the glass may not be constant. <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C106-1010-1.JPG\"></center><br><br>The left figure shows a typical cup considered in this problem. It can be fully described by its height (H), thickness of the bottom (B), and two functions R and T . Both of these functions take a current height as their argument and they give the outer radius (R) and glass thickness (T) in the appropriate height. Please note that the thickness is always measured strictly horizontally and may therefore not reflect the &#x201C;real thickness&#x201D; of the glass in its usual meaning. ","type":"description","format":"html"},{"title":"Input","content":"The input contains several cup descriptions. Each description consists of three lines. The first line contains two numbers: H (cup height) and B (bottom thickness), 0 &lt; B &lt; H &#x2264; 100. <br>The second line contains an expression R(x) (radius), the third line an expression T (x) (glass thickness). All data are given in centimeters. The last description is followed by a line with two zeros. <br><br>The expressions will contain only digits (&quot;0&quot; through &quot;9&quot;), decimal points (&quot;.&quot;), four basic operators (&quot;+&quot;, &quot;-&quot;, &quot;*&quot;, and &quot;/&quot;), parentheses (&quot;(&quot; and &quot;)&quot;), and the lowercase letters &quot;x&quot; denoting the input variable (height measured from the cup bottom). <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C106-1010-2.JPG\"></center><br><br>Arithmetical operators have their usual meaning and priorities, i.e., multiplication and division have a higher priority than addition and subtraction. ","type":"input_format","format":"html"},{"title":"Output","content":"For each cup, output the sentence &#x201C;Pour L litres / W cm of water.&#x201D;, where L is the amount of water that must be poured into the cup to reach the maximal stability (in litres). W is the water level (in centimeters) measured from the bottom of the cup. Both numbers must be given with exactly three decimal digits. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9 1\n3+x/6\n17/8-x/8\n10 1\n(x+10)\n10/(x+10)\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Pour 0.030 litres / 3.365 cm of water.\nPour 0.878 litres / 2.193 cm of water.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Shun+Yu+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A82%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Shun Yu Cup&#x201D; Zhejiang Collegiate Programming Contest - Warm Up&#xFF08;2&#xFF09; </a> ","type":"source","format":"html"}]}