{"title":"See you~","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1892","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1892&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1892","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1892"},"statement":[{"title":"Problem Description","content":"Now I am leaving hust acm. In the past two and half years, I learned so many knowledge about Algorithm and Programming, and I met so many good friends. I want to say sorry to Mr, Yin, I must leave now ~~&gt;.&lt;~~. I am very sorry, we could not advanced to the World Finals last year. <br>When coming into our training room, a lot of books are in my eyes. And every time the books are moving from one place to another one. Now give you the position of the books at the early of the day. And the moving information of the books the day, your work is to tell me how many books are stayed in some rectangles. <br>To make the problem easier, we divide the room into different grids and a book can only stayed in one grid. The length and the width of the room are less than 1000. I can move one book from one position to another position, take away one book from a position or bring in one book and put it on one position. <br>","type":"description","format":"html"},{"title":"Input","content":"In the first line of the input file there is an Integer T(1&lt;=T&lt;=10), which means the number of test cases in the input file. Then N test cases are followed. <br>For each test case, in the first line there is an Integer Q(1&lt;Q&lt;=100,000), means the queries of the case. Then followed by Q queries. <br>There are 4 kind of queries, sum, add, delete and move. <br>For example: <br>S x1 y1 x2 y2 means you should tell me the total books of the rectangle used (x1,y1)-(x2,y2) as the diagonal, including the two points. <br>A x1 y1 n1 means I put n1 books on the position (x1,y1) <br>D x1 y1 n1 means I move away n1 books on the position (x1,y1), if less than n1 books at that position, move away all of them. <br>M x1 y1 x2 y2 n1 means you move n1 books from (x1,y1) to (x2,y2), if less than n1 books at that position, move away all of them. <br>Make sure that at first, there is one book on every grid and 0&lt;=x1,y1,x2,y2&lt;=1000,1&lt;=n1&lt;=100. <br>","type":"input_format","format":"html"},{"title":"Output","content":"At the beginning of each case, output &quot;Case X:&quot; where X is the index of the test case, then followed by the &quot;S&quot; queries. <br>For each &quot;S&quot; query, just print out the total number of books in that area. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\nS 1 1 1 1\nA 1 1 2\nS 1 1 1 1\n3\nS 1 1 1 1\nA 1 1 2\nS 1 1 1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n1\n3\nCase 2:\n1\n4</div></pre>","type":"example","format":"html"},{"title":"Author","content":"Sempr|CrazyBird|hust07p43","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008-4+Programming+Contest&amp;source=1&amp;searchmode=source\"> HDU 2008-4 Programming Contest </a> ","type":"source","format":"html"}]}