{"title":"Gangs","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1900","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1900&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1900","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1900"},"statement":[{"title":"Problem Description","content":"The downtown core of Inner City is laid out as a grid, with numbered streets running north-south from 1st Street in the west to 20th Street in the east, and numbered avenues running east-west from 1st Avenue in the north to 20th Avenue in the south. The area is controlled by two gangs, the Blips and the Cruds. The boundary between their territory is the Green Line, running diagonally from the intersection of 1st Street and 1st Avenue to the intersection of 20th Street and 20th Avenue. The Blips control the area to the southwest of the Green Line, and the Cruds the area to the northeast. <br>To prove their virility, the Blips go on &quot;runs&quot; through Crud territory, starting at 1st Avenue and 1st Street and ending at a point on the Green Line that varies from night to night. A run may return to the Green Line in between but never crosses it. A run uses avenues only in the east direction and streets only in the south direction. Thus a run can be described by a string of E&apos;s and S&apos;s of length 2N-2; such a run ends at Nth Street and Nth Avenue. <br><br>The Blips judge the runs made on a given night (all of which have the same length) by how &quot;OG&quot; they are. A run R1 is more OG than a run R2 if and only if: <br><br>1) R2 returns to the Green Line for the first time at an earlier point than when R1 returns to the Green Line, or <br>2) R1 and R2 return to the Green Line at the same point, but the portion of R1 to that point (ignoring the initial E and final S) is more OG than the portion of R2 to that point (also ignoring the initial E and final S), or <br>3) R1 and R2 return to the Green Line at the same point and are identical to that point, but the rest of R1 is more OG than the rest of R2. <br>Examples corresponding to these three cases: <br>1) EESS is more OG than ESES. <br>2) EEESSS is more OG than EESESS <br>3) EESSEESS is more OG than EESSESES. <br>If all the runs of a given length are ordered according to how OG they are, then the rank of a run is its position in the resulting list. EESS has rank 1 and ESES has rank 2. <br>Your task is to write a program to help the Blips plan and judge their nightly activities. <br>","type":"description","format":"html"},{"title":"Input","content":"The input to the program is a series of instances followed by 0 0. An instance consists of a line containing a positive integer N, representing the terminus of that night&apos;s run (Nth Street and Nth Avenue), followed by positive integer M. <br>","type":"input_format","format":"html"},{"title":"Output","content":"The output corresponding to each instance is the run of length 2N-2 of rank M, or ERROR if there are fewer than M runs of length 2N-2. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 1\n3 2\n3 3\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">EESS\nESES\nERROR</div></pre>","type":"example","format":"html"},{"title":"Author","content":"Prabhakar Ragde","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008-1%BA%BC%B5%E7%B9%AB%BF%AA%C8%FC%28%B7%C7%D4%AD%B4%B4%29&amp;source=1&amp;searchmode=source\"> 2008-1&#x676D;&#x7535;&#x516C;&#x5F00;&#x8D5B;(&#x975E;&#x539F;&#x521B;) </a> ","type":"source","format":"html"}]}