{"title":"Showstopper","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1911","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1911&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1911","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1911"},"statement":[{"title":"Problem Description","content":"Data-mining huge data sets can be a painful and long lasting process if we are not aware of tiny patterns existing within those data sets.<br><br>One reputable company has recently discovered a tiny bug in their hardware video processing solution and they are trying to create software workaround. To achieve maximum performance they use their chips in pairs and all data objects in memory should have even number of references. Under certain circumstances this rule became violated and exactly one data object is referred by odd number of references. They are ready to launch product and this is the only showstopper they have. They need YOU to help them resolve this critical issue in most efficient way.<br><br>Can you help them?","type":"description","format":"html"},{"title":"Input","content":"Input file consists from multiple data sets separated by one or more empty lines.<br><br>Each data set represents a sequence of 32-bit (positive) integers (references) which are stored in compressed way.<br><br>Each line of input set consists from three single space separated 32-bit (positive) integers X Y Z and they represent following sequence of references: X, X+Z, X+2*Z, X+3*Z, &#x2026;, X+K*Z, &#x2026;(while (X+K*Z)&lt;=Y).<br><br>Your task is to data-mine input data and for each set determine weather data were corrupted, which reference is occurring odd number of times, and count that reference.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each input data set you should print to standard output new line of text with either &#x201C;no corruption&#x201D; (low case) or two integers separated by single space (first one is reference that occurs odd number of times and second one is count of that reference).<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 10 1\n2 10 1\n\n1 10 1\n1 10 1\n\n1 10 1\n4 4 1\n1 5 1\n6 10 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 1\nno corruption\n4 3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Southeastern+Europe+2007&amp;source=1&amp;searchmode=source\"> Southeastern Europe 2007 </a> ","type":"source","format":"html"}]}