{"title":"Arne Saknussemm","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1915","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1915&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1915","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1915"},"statement":[{"title":"Problem Description","content":"Following the account of Jules Verne, a scrambled message written by the middle age alchemist Arne Saknussemm, and deciphered by professor Lidenbrock, started the incredible travel to the center of the Earth. The scrambling procedure used by Arne is alike the procedure given below.<br><br>1. Take a non empty message M that contains letters from the English alphabet, digits, commas, dots, quotes (i.e. &apos;), spaces and line breaks, and whose last character is different than space. For example, consider the following message whose translation reads &quot;In Sneffels&apos;s crater descend brave traveler, and touch the center of the Earth&quot;.<br><br>In Sneffels craterem descende audasviator, et terrestre centrum attinges.<br> <br>2. Choose an integral number 0&lt;K&#x2264;length(M) and add trailing spaces to M such that the length of the resulting message, say M&apos;, is the least multiple of K. For K=19 and the message above, where length(M)=74 (including the 8 spaces and the line break that M contains), two trailing spaces are added yielding the message M&apos; with length(M&apos;)=76.<br><br>3. Replace all the spaces from M&apos; by the character _ (underscore) ; replace all the line breaks from M&apos; by \\ (backslash), and then reverse the message. In our case:<br><br>__.segnitta_murtnec_ertserret_te_,rotaiv\\sadua_ednecsed_meretarc_sleffenS_nI<br> <br><br>4. Write the message that results from step 3 in a table with length(M&apos;)/K rows and K columns. The writing is column wise. For the given example, the message is written in a table with 76/19=4 rows and 19 columns as follows:<br>[&#x7F3A;&#x5C11;&#x56FE;&#x7247;]<br><br>5. The strings of characters that correspond to the rows of the table are the fragments of the scrambled message. The 4 fragments of Arne&apos;s message given in step 1 are:<br><br>_etmneet_t\\udsmt_fS.narctrtria_edrrlen<br> _gtuerr_,asaneeasf_si_t_seeovdec_ecenI<br> <br><br>Write a program that deciphers non empty messages scrambled as described. The length of a message, before scrambling, is at most 1000 characters, including spaces and line breaks.<br><br>","type":"description","format":"html"},{"title":"Input","content":"The program input is from a text file where each data set corresponds to a scrambled message. A data set starts with an integer n, that shows the number of fragments of the scrambled message, and continues with n strings of characters that designate the fragments, in the order they appear in the table from step 4 of the scrambling procedure. Input data are separated by white-spaces and terminate with an end of file.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"The deciphered message must be printed on the standard output, from the beginning of a line and must be followed by an empty line as shown in the input/output sample below.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4  _etmneet_t\\udsmt_fS\n   _gtuerr_,asaneeasf_\n   .narctrtria_edrrlen\n   si_t_seeovdec_ecenI\n11 e n r e V _ s e l u J</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">In Sneffels craterem descende audas\nviator, et terrestre centrum attinges.\n\nJules Verne</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Southeastern+Europe+2007&amp;source=1&amp;searchmode=source\"> Southeastern Europe 2007 </a> ","type":"source","format":"html"}]}