{"title":"Jackpot","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1920","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1920&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1920","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1920"},"statement":[{"title":"Problem Description","content":"Bill has found the perfect way to make money playing the slot machines. After months of careful research, he has finally figured out the mechanics behind how the machines operate. Now he is ready to make profit of his findings.<br><br>But first an introduction to the game. A slot machine consists of a number of wheels, usually three or four, each with a number of symbols printed on it &#x2013; cherries, oranges, bells, etc. &#x2013; and will show one of its symbols at a given time. To play, you insert a coin, push a button and<br>the wheels start spinning. After spinning for a while, each wheel stops &#x2013; at random it seems &#x2013; at one of its symbols. If all wheels stop at the same symbol, or some nice combination of symbols, the player wins. One combination that is especially desirable is having the jackpot symbol on all wheels. This combination is simply called &#x2019;jackpot&#x2019; and will make you rich for life.<br><br>What Bill has discovered is that each wheel will stop at the jackpot symbol with a certain periodicity, which differs a lot between wheels. He has also figured out (after some sneeking around at the slot-machine factory) that all newly manufactured slot-machines are delivered showing the jackpot combination, and that they all have a counter at the back, telling how many times the machine has been played. This counter is always set to zero at delivery.<br><br>Now, all Bill needs to do is to calculate the number of times a machine has to be played between two occurrences of the jackpot combination. We will call this number the jackpot periodicity. This is of course the same as the number of times the machine has to be played after leaving the factory, before it gives its first jackpot. Thus, with a glance at the counter on the back of a machine, Bill can figure out if it is about to give a jackpot. As Bill knows that you are a skillful computer programmer, he turns to you with the problem of calculating the jackpot periodicity. For each machine, he will give you the number of wheels, and the periodicity with<br>which the jackpot symbol shows up on each wheel.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"One line with the number of machines n &lt;= 20. For each machine, one line with the number of wheels w &lt;= 5, and one line with w numbers, p1,p2,....pw,the periodicity of each wheel pk&lt;=1000.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"One line per machine: The jackpot periodicity of the machine, if it is less than or equal to a billion (10^9), otherwise output the text &#x2019;More than a billion.&#x2019;.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\n10 6 15</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">30</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NM2003&amp;source=1&amp;searchmode=source\"> NM2003 </a> ","type":"source","format":"html","require":["katex"]}]}