{"title":"Subway planning","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1922","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1922&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1922","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1922"},"statement":[{"title":"Problem Description","content":"The government in a foreign country is looking into the possibility of establishing a subway system in its capital. Because of practical reasons, they would like each subway line to start at the central station and then go in a straight line in some angle as far as necessary. You have been hired to investigate whether such an approach is feasible. Given the coordinates of important places in the city as well as the maximum distance these places can be from a subway station (possibly the central station, which is already built), your job is to calculate the minimum number of subway lines needed. You may assume that any number of subway stations can be<br>built along a subway line.<br><img style=\"max-width:100%;\" src=\"data/images/1922-1.jpg\"><br>Figure 1: The figure above corresponds to the first data set in the example input.","type":"description","format":"html"},{"title":"Input","content":"The first line in the input file contains an integer N, the number of data sets to follow. Each set starts with two integers, n and d (1 &lt;= n &lt;= 500, 0 &lt;= d &lt; 150). n is the number of important places in the city that must have a subway station nearby, and d is the maximum distance allowed<br>between an important place and a subway station. Then comes n lines, each line containing two integers x and y (-100 &lt;= x, y &lt;= 100), the coordinates of an important place in the capital. The central station will always have coordinates 0, 0. All pairs of coordinates within a data set<br>will be distinct (and none will be 0, 0).","type":"input_format","format":"html"},{"title":"Output","content":"For each data set, output a single integer on a line by itself: the minimum number of subway lines needed to make sure all important places in the city is at a distance of at most d from a subway station.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n7 1\n-1 -4\n-3 1\n-3 -1\n2 3\n2 4\n2 -2\n6 -2\n4 0\n0 4\n-12 18\n0 27\n-34 51</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NM2003&amp;source=1&amp;searchmode=source\"> NM2003 </a> ","type":"source","format":"html"}]}