{"title":"Exploding CPU","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1923","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1923&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1923","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1923"},"statement":[{"title":"Problem Description","content":"The well known hardware manufacturing company Processors for Professors is about to release a highly specialized CPU with exceptional functionality in, amongst other areas, number theory. It has, for example, an instruction PFACT that takes one parameter and returns all prime factors of that parameter, with an outstanding execution speed. It has, however, one considerable problem. The scientists at the testing lab has just found out that the PFACT instruction for some special input values freaks out and makes the entire processor explode. Even though this could be an amusing effect, it is not the way it was intended to work. The skilled mathematicians have, by trial and error, found that the explosive numbers all share the same interesting number theoretic properties, which might be of help when troubleshooting.<br><br>An explosive number is a number <img style=\"max-width:100%;\" src=\"data/images/1923-1.gif\"> where all <img style=\"max-width:100%;\" src=\"data/images/1923-2.gif\">s are distinct prime numbers such that <img style=\"max-width:100%;\" src=\"data/images/1923-3.gif\">. A and B are always integers, and might be different for different explosive numbers.<br><br>For example, the processor will explode when factorizing the number 4505, because 4505 = 1*5*17*53 and 5 = 3*1+2, 17 = 3*5+2 and 53 = 3*17+2 and the numbers 5, 17 and 53 are all prime numbers. In this case A = 3 and B = 2.<br><br>You are kindly asked to write a computer program that will aid this company in estimating the impact of the errors, by calculating the amount of explosive numbers that exists within a given range of integers.","type":"description","format":"html"},{"title":"Input","content":"The input starts with a row containing the number 0 &lt;= N &lt;= 100 of test cases that will follow. For each test case, there will be one row containing two integers, <img style=\"max-width:100%;\" src=\"data/images/1923-4.gif\"> separated by a single space. These numbers are such that <img style=\"max-width:100%;\" src=\"data/images/1923-5.gif\">.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the number of explosive numbers that exist in<br>the range <img style=\"max-width:100%;\" src=\"data/images/1923-6.gif\">.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4505 4505\n0 5000</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NM2003&amp;source=1&amp;searchmode=source\"> NM2003 </a> ","type":"source","format":"html"}]}