{"title":"A Puzzling Problem","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1929","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1929&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1929","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1929"},"statement":[{"title":"Problem Description","content":"Anna Graham is a puzzle maker who prides herself in the quality and complexity of her work. She makes puzzles of all kinds - crosswords, logic problems, acrostics, and word search puzzles, to name but a few. For each puzzle, she has developed a set of rules which she constrains herself to follow. For word search puzzles, she insists not only that all the words be connected to one another (as in most word search puzzles), but also that removing any word from the word list will not cause one or more words to become disconnected from the rest. (Two words are connected if they contain a common letter in the grid.) The example word search puzzle on the left satisfies this condition, but the one on the right does not (removing the word Pascal from the word list disconnects Java from the other two words).<br><img style=\"max-width:100%;\" src=\"http://acm.hdu.edu.cn/forum/attachment/11_237_de4c3a5a3af1175.jpg\"><br>Your job is to write a program that checks to see if Anna&#xFFFD;&#xFFFD;s word search problems are up to snuff.<br>","type":"description","format":"html"},{"title":"Input","content":"Input will consist of multiple test cases. The first line of each test case contains 3 integers n m l, where n and m are the number of rows and columns in the puzzle and l is the number of words. Following this are n lines containing m uppercase characters each (the puzzle) followed by l lines containing one word each (the word list, in mixed case). Each word in the word list will appear in the puzzle exactly once. There will be no more than 100 rows and 100 columns in the puzzle and no more than 100 words to search for. There will be no spaces in the input words.","type":"input_format","format":"html"},{"title":"Output","content":"For each problem instance, output the word Yes or No depending on whether the puzzle satisfies Anna&#xFFFD;&#xFFFD;s constraints.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 6 3\nPBROGR\nPASCAL\nASMMIN\nGIICON\nTCELST\nBASIC\nLISP\nPascal\n5 6 4\nPBROJR\nPASCAL\nASMMVN\nGIICAN\nTCELST\nBASIC\nJava\nLISP\nPascal\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes\nNo</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2007+East+Central+North+America&amp;source=1&amp;searchmode=source\"> 2007 East Central North America </a> ","type":"source","format":"html"}]}