{"title":"Ballroom Lights","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1933","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1933&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1933","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1933"},"statement":[{"title":"Problem Description","content":"The ICPC world finals will be held in a luxurious hotel with a big ballroom. A buffet meal will be served in this ballroom, and organizers decided to decorate its walls with pictures of past champion teams.<br><br>In order to avoid criticism about favouring some of those teams over others, the organizing commitee wants to make sure that all pictures are appropiately illuminated. <br><br>The only direct way they&#xFFFD;&#xFFFD;ve found for doing this is ensuring each picture has at least one lightbulb that directlyilluminates it.<br><br>In this way, the perimeter of the ballroom wall can be divided into illuminated parts (in whichpictures may be placed) and dark parts (which are not suitable for placing the pictures).<br><br>The ballroom has the shape of a box and contains several lightbulbs. Each lightbulb emits light in all directions, but this light can be blocked by columns. All columns in the ballroom have cylindrical shape and go from the floor to the ceiling, so light cannot pass over or above them. Columns are of course placed so that its circular section is parallel to the ballroom floor.<br><br>Any given point p on the perimeter wall is said to be illuminated if there exists a line segment (a light ray) which starts on a lightbulb, ends in p and does not touch or pass through any column.<br><img style=\"max-width:100%;\" src=\"/data/images/109_b.jpg\"><br><br>Your task as a helper of the ICPC organization is to examine the blueprints of the ballroom and determine the total length of illuminated sections of the perimeter wall. The blueprint consist of a rectangle indicating a top view of the ballroom, with the lightbulbs and columns marked in it.","type":"description","format":"html"},{"title":"Input","content":"Each test case will consist on several lines. The first line will contain four integers: L, the number of lightbulbs, C, the number of columns, X, the size of the ballroom on the x coordinate and Y , the size of the ballroom on the y coordinate. The lower-left corner of the ballroom is at (0, 0) while the upper-right corner is at (X, Y ).<br><br>The next L lines will contain two integers each representing the x and y coordinate of each lightbulb. The last C lines of the test case will contain three integers each, representing the x and y coordinates of the center of a column and its radius, in that order. You can assume that 1 &lt;= L,C &lt;= 10<sup>3</sup> and 4 &lt;= X, Y &lt;= 10<sup>6</sup>. Also, for all pairs of coordinates (x,y), 0 &lt; x &lt; X and 0 &lt; y &lt; Y , both for lightbulbs and column center locations. All radii of the columns will be positive. Finally, no two columns will overlap, although they may touch, and no column will touch or intersect with the border of the ballroom. No lightbulb will be inside a column or in its boundary and no two lightbulbs will be in the same place.<br>Input is terminated with L = C = X = Y = 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line with the total length of the illuminated parts of the perimeter wall. The result must be printed as a real number with exactly four decimal figures, with the lowest-order decimal figure rounded up.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1 8 8\n6 6\n2 6\n4 4 2\n1 4 7 7\n3 3\n2 4 1\n4 2 1\n2 2 1\n4 4 1\n2 2 9 7\n1 2\n5 5\n3 3 2\n7 5 1\n0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">28.0000\n0.0000\n25.8214</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM+South+American+Programming+Contest+2007+&amp;source=1&amp;searchmode=source\"> ACM South American Programming Contest 2007  </a> ","type":"source","format":"html"}]}