{"title":"Finding Seats","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1937","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1937&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1937","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1937"},"statement":[{"title":"Problem Description","content":"A group of K friends is going to see a movie. However, they are too late to get good tickets, so they are looking for a good way to sit all nearby. Since they are all science students, they decided to come up with an optimization problem instead of going on with informal arguments to decide which tickets to buy.<br><br>The movie theater has R rows of C seats each, and they can see a map with the currently available seats marked. They decided that seating close to each other is all that matters, even if that means seating in the front row where the screen is so big it&#x2019;s impossible to see it all at once. In order to have a formal criteria, they thought they would buy seats in order to minimize the extension of their group.<br><br>The extension is defined as the area of the smallest rectangle with sides parallel to the seats that contains all bought seats. The area of a rectangle is the number of seats contained in it.<br><br>They&#x2019;ve taken out a laptop and pointed at you to help them find those desired seats.<br>","type":"description","format":"html"},{"title":"Input","content":"Each test case will consist on several lines. The first line will contain three positive integers R, C and K as explained above (1 &lt;= R,C &lt;= 300, 1 &lt;= K &lt;= R &#xD7; C). The next R lines will contain exactly C characters each. The j-th character of the i-th line will be &#x2018;X&#x2019; if the j-th seat on the i-th row is taken or &#x2018;.&#x2019; if it is available. There will always be at least K available seats in total.<br>Input is terminated with R = C = K = 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line containing the minimum extension the group can have.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 5 5\n...XX\n.X.XX\nXX...\n5 6 6\n..X.X.\n.XXX..\n.XX.X.\n.XXX.X\n.XX.XX\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n9</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM+South+American+Programming+Contest+2007+&amp;source=1&amp;searchmode=source\"> ACM South American Programming Contest 2007  </a> ","type":"source","format":"html"}]}