{"title":"He is offside!","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1939","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1939&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1939","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1939"},"statement":[{"title":"Problem Description","content":"Hemisphere Network is the largest television network in Tumbolia, a small country located east of South America (or south of East America). The most popular sport in Tumbolia, unsurprisingly, is soccer; many games are broadcast every week in Tumbolia.<br><br>Hemisphere Network receives many requests to replay dubious plays; usually, these happen when a player is deemed to be offside by the referee. An attacking player is offside if he is nearer to his opponents&apos; goal line than the second last opponent. A player is not offside if<br>&#x25CF;he is level with the second last opponent or<br>&#x25CF;he is level with the last two opponents.<br><br>Through the use of computer graphics technology, Hemisphere Network can take an image of the field and determine the distances of the players to the defending team&apos;s goal line, but they still need a program that, given these distances, decides whether a player is offside.<br>","type":"description","format":"html"},{"title":"Input","content":"The input file contains several test cases. The first line of each test case contains two integers A and D separated by a single space indicating, respectively, the number of attacking and defending players involved in the play (2 &lt;= A,D &lt;= 11). The next line contains A integers Bi separated by single spaces, indicating the distances of the attacking players to the goal line<br>(1 &lt;= Bi &lt;= 10<sup>4</sup>). The next line contains D integers Cj separated by single spaces, indicating the distances of the defending players to the goal line (1 &lt;= Cj &lt;= 10<sup>4</sup>). The end of input is indicated by A = D = 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case in the input print a line containing a single character: &quot;Y&quot;(uppercase) if there is an attacking player offside, and &quot;N&quot;(uppercase) otherwise.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3\n500 700\n700 500 500\n2 2\n200 400\n200 1000\n3 4\n530 510 490\n480 470 50 310\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">N\nY\nN</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM+South+American+Programming+Contest+2007+&amp;source=1&amp;searchmode=source\"> ACM South American Programming Contest 2007  </a> ","type":"source","format":"html"}]}