{"title":"Justice League","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1941","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1941&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1941","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1941"},"statement":[{"title":"Problem Description","content":"Thirty five years ago, a group of super heroes was chosen to form the Justice League, whose purpose was to protect the planet Earth from the villains. After all those years helping mankind, its members are retiring and now it is time to choose the new members of the Justice League. In order to keep their secret identity, let&#x2019;s say, secret, super heroes usually use an integer number to identify themselves. There are H super heroes on Earth, identified with the integers from 1 to H. With a brief look at the newspapers anyone can find out if two super heroes have already worked together in a mission. If this happened, we say that the two heroes have a relationship.<br><br>There must be only one Justice League in the world, which could be formed by any number of super heroes (even only one). Moreover, for any two heroes in the new league, they must have a relationship.<br><br>Besides, consider the set of the heroes not chosen to take part in the Justice League. For any two heroes on that set, they must not have a relationship. This prevents the formation of unofficial justice leagues.<br><br>You work for an agency in charge of creating the new Justice League. The agency doesn&#x2019;t know if it is possible to create the League with the restrictions given, and asked for your programming skills. Given a set of super heroes and their relationships, determine if it is possible to select any subset to form the Justice League, according to the given restrictions.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input is composed of several test cases. The first line of each test case contains two integers separated by a single space, H (2 &lt;= H &lt;= 5&#xD7;10<sup>4</sup>) and R (1 &lt;= R &lt;= 10<sup>5</sup>), indicating, respectively, the number of heroes and the number of relationships. Each of the following R lines contains two integers separated by a single space, A and B (1 &lt;= A &lt; B &lt;= H), indicating that super hero A has a relationship with super hero B. Note that if A has a relationship with B, B also has a relationship with A. A relationship is never informed twice on a test case.<br>The end of input is indicated by H = R = 0.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case in the input print a single line, containing the uppercase letter &#x201C;Y&#x201D; if it is possible to select a subset of heroes to form the Justice League according to the given restrictions, or the uppercase letter &#x201C;N&#x201D; otherwise.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5\n1 2\n2 3\n1 3\n1 4\n3 5\n9 8\n1 2\n2 3\n3 4\n4 5\n5 6\n6 7\n7 8\n8 9\n4 3\n1 2\n2 3\n3 4\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Y\nN\nY</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM+South+American+Programming+Contest+2007+&amp;source=1&amp;searchmode=source\"> ACM South American Programming Contest 2007  </a> ","type":"source","format":"html","require":["katex"]}]}