{"title":"Who owns the Amiga?","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1946","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1946&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1946","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1946"},"statement":[{"title":"Problem Description","content":"In a corridor in a student dormitory, there are \u0002ve rooms numbered 1, 2, 3, 4 and 5; room number 1 is the left-most room. The rooms have doors in different colours: blue, green, red, white and yellow, but not necessarily in that order.<br><img style=\"max-width:100%;\" src=\"data/images/1946-1.jpg\"><br>In these rooms live five students Anna, Bernhard, Chris, David and Ellen of five different nationalities Danish, Finnish, Icelandic, Norwegian and  Swedish. (Both the names and the nationalities are given in alphabetical order, so it does not follow automatically that Anna is Danish.) <br><br>These students have one computer each, and these computers are of different kinds: Amiga, Atari, Linux, Mac and Windows (given here in alphabetical order). They each have their own favourite programming language: C, C++, Java, Pascal and Perl (also listed in alphabetical order). <br>You want to find out who owns the Amiga computer based on some facts about the students. ","type":"description","format":"html"},{"title":"Input","content":"The input consists of several scenarios. The \u0002rst input line contains a number 1?000 indicating how many scenarios there are. <br>Each scenario starts with a line with a number 1?000 telling how many fact lines there are for that scenario. Then follow the fact lines which each contains three words separated by one or more spaces: <br>&#xFF0D;&#xFF0D;&#xFF0D;The first and third word is one of these names:<br>                   1 2 3 4 5<br>                   blue green red white yellow<br>                   anna bernhard chris david ellen<br>                   danish finnish icelandic norwegian swedish<br>                   amiga atari linux mac windows<br>                   c c++ java pascal perl<br>(Note that no uppercase letters are used.)<br><br>&#xFF0D;&#xFF0D;&#xFF0D;The second word specifies a relationship; it is one of <br>                   same-as left-of right-of next-to<br> same-as tells that the first and third fact words apply to the same room; for instance<br>                   blue same-as bernhard <br>tells that Bernhard lives in the room with a blue door. <br>left-of tells that the first fact word applies to the room immediately to the left of the one to which the third fact word applies. For example,<br>                   chris left-of perl<br>means that Chris lives in the room immediately to the left of the Perl programmer.<br>right-of tells that the \u0002rst fact word applies to the room immediately to the right of the one to which the third fact word applies.<br>next-to tells that the two fact words apply to rooms next to each other. For example,<br>                   swedish next-to linux<br>means that the Swedish student lives in the next room (either to the left or the right) of the owner of the Linux computer.<br><br><br>You may assume that there are no inconsistencies in the input data. In other words, there will in every scenario be at least one person who may own the Amiga without violating the constraints.","type":"input_format","format":"html"},{"title":"Output","content":"For each scenario, you should print a line starting with scenario #n : where n is the scenario number. If you can determine who (i.e., Anna, Bernhard, Chris, David or Ellen) owns the Amiga, you continue the line with<br>              xxxx owns the amiga. <br>or, if you cannot name the Amiga owner, you print cannot identify the amiga owner.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n8\nred same-as 1\ndanish same-as 1\nperl same-as 5\natari same-as 2\nlinux same-as 3\nmac same-as 4\nwindows same-as 5\nanna same-as 1\n8\nchris left-of amiga\nchris left-of 4\nc same-as 1\ndanish same-as 1\nred same-as 1\nlinux same-as red\nwindows next-to linux\nmac left-of swedish</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">scenario #1: anna owns the amiga.\nscenario #2: cannot identify the amiga owner.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NM2004&amp;source=1&amp;searchmode=source\"> NM2004 </a> ","type":"source","format":"html"}]}