{"title":"Bridging signals","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1950","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1950&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1950","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1950"},"statement":[{"title":"Problem Description","content":"&apos;Oh no, they&apos;ve done it again&apos;, cries the chief designer at the Waferland chip factory. Once more the routing designers have screwed up completely, making the signals on the chip connecting the ports of two functional blocks cross each other all over the place. At this late stage of the process, it is too<br>expensive to redo the routing. Instead, the engineers have to bridge the signals, using the third dimension, so that no two signals cross. However, bridging is a complicated operation, and thus it is desirable to bridge as few  signals as possible. The call for a computer program that finds the maximum number of signals which may be connected on the silicon surface without  rossing each other, is imminent. Bearing in mind that there may be  housands of signal ports at the boundary of a functional block, the problem asks quite a lot of the programmer. Are you up  to the task?<br><img style=\"max-width:100%;\" src=\"data/images/1950-1.jpg\"><br>Figure 1. To the left: The two blocks&apos; ports and their signal mapping (4,2,6,3,1,5). To the right: At most three signals may be routed on the silicon surface without crossing each other. The dashed signals must be bridged. <br><br>A typical situation is schematically depicted in figure 1. The ports of the two functional blocks are numbered from 1 to p, from top to bottom. The signal mapping is described by a permutation of the numbers 1 to p in the form of a list of p unique numbers in the range 1 to p, in which the i:th number  pecifies which port on the right side should be connected to the i:th port on the left side.<br>Two signals cross if and only if the straight lines connecting the two ports of each pair do.","type":"description","format":"html"},{"title":"Input","content":"On the first line of the input, there is a single positive integer n, telling the number of test scenarios to follow. Each test scenario begins with a line containing a single positive integer p&lt;40000, the number of ports on the two functional blocks. Then follow p lines, describing the signal mapping: On the i:th line is the port number of the block on the right side which should be connected to the i:th port of the block on the left side. ","type":"input_format","format":"html"},{"title":"Output","content":"For each test scenario, output one line containing the maximum number of signals which may be routed on the silicon surface without crossing each other.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n6\n4\n2\n6\n3\n1\n5\n10\n2\n3\n4\n5\n6\n7\n8\n9\n10\n1\n8\n8\n7\n6\n5\n4\n3\n2\n1\n9\n5\n8\n9\n2\n3\n1\n7\n4\n6</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n9\n1\n4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2003&amp;source=1&amp;searchmode=source\"> NWERC2003 </a> ","type":"source","format":"html"}]}