{"title":"Vase collection","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1951","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1951&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1951","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1951"},"statement":[{"title":"Problem Description","content":"Mr Cheng is a collector of old Chinese porcelain, more specifically late 15th century Feng dynasty vases. The art of vase-making at this time followed very strict artistic rules. There was a limited number of accepted styles, each defined by its shape and decoration. More specifically, there were 36 vase shapes and 36 different patterns of decoration &#xFFFD;C in all 1296 different styles.<br><br>For a collector, the obvious goal is to own a sample of each of the 1296 styles. Mr Cheng however, like so many other collectors, could never afford a complete collection, and instead concentrates on some shapes and some decorations. As symmetry between shape and decoration was one of the<br>main aestheathical paradigms of the Feng dynasty, Mr Cheng wants to have a full collection of all combinations of k shapes and k decorations, for as large a k as possible. However, he has discovered that determining this k for a given collection is not always trivial. This means that his collection might actually be better than he thinks. Can you help him?","type":"description","format":"html"},{"title":"Input","content":"On the first line of the input, there is a single positive integer n, telling the number of test scenarios to follow. Each test scenario begins with a line containing a single positive integer m &lt;=100 , the number of vases in the  collection. Then follow m lines, one per vase, each with a pair of numbers, si and di, separated by a single space, where si ( 0 &lt; i &lt;= 36  ) indicates the  shape of Mr Cheng&apos;s i:th vase, and di ( 0 &lt; i &lt;=36 ) indicates its decoration.","type":"input_format","format":"html"},{"title":"Output","content":"For each test scenario, output one line containing the maximum k, such that there are k shapes and k decorations for which Mr Cheng&apos;s collection contains all k*k combined styles.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5\n11 13\n23 5\n17 36\n11 5\n23 13\n2\n23 15\n15 23</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2003&amp;source=1&amp;searchmode=source\"> NWERC2003 </a> ","type":"source","format":"html"}]}