{"title":"Subway tree systems","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1954","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1954&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1954","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1954"},"statement":[{"title":"Problem Description","content":"Some major cities have subway systems in the form of a tree, i.e. between any pair of stations, there is one and only one way of going by subway. Moreover, most of these cities have a unique central station. Imagine you are a tourist in one of these cities and you want to explore all of the subway<br>system. You start at the central station and pick a subway line at random and jump aboard the subway car. Every time you arrive at a station, you pick one of the subway lines you have not yet travelled on. If there is none left to explore at your current station, you take the subway line back on which you first came to the station, until you eventually have travelled along all of the lines twice, once for each direction. At that point you are back at the central station. Afterwards, all you remember of the order of your exploration is whether you went further away from the central station or back towards it at any given time, i.e. you could encode your tour as a binary string, where 0 encodes taking a subway line getting you one station further away from the central station, and 1 encodes getting you one station closer to the central station. <br><img style=\"max-width:100%;\" src=\"data/images/1954-1.gif\"><br>Figure 1. To the left: A subway tree system. The larger dot is the central station. To the right: Three out of several possible encodings of exploration tours for the subway system. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line of input is a single positive integer n, telling the number of test scenarios to follow. <br>Each test scenario consists of two lines, each containing a string of the characters &apos;0&apos; and &apos;1&apos; of length at most 3000, both describing a correct exploration tour of a subway tree system.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test scenario, output one line containing the text &#x201C;same&#x201D; if the two strings may encode exploration tours of the same subway tree system, or the text &#x201C;different&#x201D; if the two strings cannot be exploration tours of the same subway tree system.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0010011101001011\n0100011011001011\n0100101100100111\n0011000111010101</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">same\ndifferent</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2003&amp;source=1&amp;searchmode=source\"> NWERC2003 </a> ","type":"source","format":"html","require":["katex"]}]}