{"title":"A number game","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1957","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1957&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1957","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1957"},"statement":[{"title":"Problem Description","content":"The wide dissemination of calculators and computers is not without  disadvantages. Teachers all over the world find out that even students in technical disciplines tend to have a surprising lack of calculating ability. Accustomed as they are to the use of calculators and computers, many of them are unable to make calculations like 7*8 mentally, or to factor 91 by heart. <br><br>We all know, but who cares?<br><br>Professor Bartjens cares. Professor Bartjens is a bit old-fashioned. He decided to give his students some training in calculating without electronic  equipment - even without a slide rule. He invented a two-person game involving mental calculations. <br><br>Professor Bartjens would write a positive number on the blackboard. During the game more positive numbers may appear on the blackboard. The two players will then make moves in turn. A player on move is obliged to make a move, unless the blackboard is empty, in which case the game<br>is over. A move is one of the following:<br>&#xFF0D;&#xFF0D;If you see the number 1 on the blackboard, you may take it. That means: you gain one point,and the number disappears from the blackboard.<br>&#xFF0D;&#xFF0D;If you see a prime number p on the blackboard, you may subtract one. That is: you gain one point, and the p on the blackboard is replaced by p &#xFF0D;1.<br>&#xFF0D;&#xFF0D;If you see a composite number c on the blackboard, you may replace it by two smaller (positive) numbers, a and b, such that a * b = c. You do not gain any points.<br><br>The goal is of course to obtain as many points as you can.<br><br>Professor Bartjens was hoping that his students would find the game so interesting that they would spend all day playing, thereby improving their skills in calculation. Indeed his students did find the game interesting, and spent many hours, not so much playing the game as discussing optimal strategies.<br>The students came to two conclusions. First, the sum of the two players&apos; points after any given game are the same regardless of the actual scheme played. Thus,&quot; a player maximising his own points also minimises his opponent&apos;s! Second, it is always best to take a point when you have the<br>chance. Thus, whenever prime numbers or ones are written on the blackboard, the player on move takes one of them.<br><br>Here is your problem: given a starting number, and assuming both players play to maximise their own points, what will be the outcome?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line of the input is a single positive integer n, telling the number of test scenarios to follow. Each scenario consists of a single line containing the positive integer m&lt;1000000, the number initially written on the blackboard.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test scenario, output one line containing two numbers separated by one space character, equal to the points gained by the two players, both playing to maximise their own points. The first number is the number of points gained by the first player.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n1\n2\n3\n4\n5\n6</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 0\n1 1\n2 1\n2 2\n3 2\n2 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2003&amp;source=1&amp;searchmode=source\"> NWERC2003 </a> ","type":"source","format":"html","require":["katex"]}]}