{"title":"Word Encoding","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1958","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1958&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1958","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1958"},"statement":[{"title":"Problem Description","content":"In any language, certain combinations of letters do not appear (or at least appear so seldom that they can be considered non-existent). For instance, there are no English words containing the three letter combination buv as a substring. Given a list of letter combinations that do not exist, the number of possible &#xFFFD;&#xFFFD;words&#xFFFD;&#xFFFD; in a language can be reduced a lot (a &#xFFFD;&#xFFFD;word&#xFFFD;&#xFFFD; here means any combination of letters that doesn&#xFFFD;&#xFFFD;t contain any of the given letter combinations as a substring). If we order all such words by increasing length, ordering words of the same length alphabetically, we can enumerate them starting from 1. Assume that the alphabet always consists of the lower case letters &#xFFFD;&#xFFFD;a&#xFFFD;&#xFFFD; to &#xFFFD;&#xFFFD;z&#xFFFD;&#xFFFD;.<br><br>For instance, if the list only contains the combinations q, ab and aaa, the words would be<br>enumerated like this:<br>1. a<br>2. b<br>...<br>16. p<br>17. r<br>...<br>26. aa<br>27. ac<br>...<br>649. zz<br>650. aac<br>Given the list of letter combinations, write a program that for a given word outputs its number, and for a given number ouputs its word. You can assume that none of the words will exceed 20 characters and no number will be greater than 2 000 000 000 (for both input and output).<br>","type":"description","format":"html"},{"title":"Input","content":"The input will contain several test cases. The number of test cases T appears on a line by itself. Then follow T test cases. Each test case starts with a line containing two integers, N (the number of letter combinations, non-negative, at most 1 000) and M (the number of queries for this list, positive, at most 100). Then follow N lines, each containing a lower case letter combination (between 1 and 3 letters, inclusive). After that follow M lines, each containing either a positive integer or a lower case word. If it&#xFFFD;&#xFFFD;s a word, it will not contain any of the combinations of letters in the list for this test case. If it&#xFFFD;&#xFFFD;s a number, it will not be greater than the number of words in the language.","type":"input_format","format":"html"},{"title":"Output","content":"For each query, output a single line containing either the word&#xFFFD;&#xFFFD;s corresponding number, or the number&#xFFFD;&#xFFFD;s corresponding word.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 4\nq\nab\naaa\n16\nr\n27\naac\n7 2\na\nb\nc\nd\nef\nghi\nijk\n102345678\nksvfuw</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">p\n17\nac\n650\nxexgun\n39174383</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2004&amp;source=1&amp;searchmode=source\"> NWERC2004 </a> ","type":"source","format":"html"}]}