{"title":"Taxi Cab Scheme","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1960","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1960&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1960","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1960"},"statement":[{"title":"Problem Description","content":"Running a taxi station is not all that simple. Apart from the obvious demand for a centralised coordination of the cabs in order to pick up the customers calling to get a cab as soon as possible, there is also a need to schedule all the taxi rides which have been booked in advance. Given a list of all booked taxi rides for the next day, you want to minimise the number of cabs needed to carry out all of the rides. <br><br>For the sake of simplicity, we model a city as a rectangular grid. An address in the city is denoted by two integers: the street and avenue number. The time needed to get from the address a, b to c, d by taxi is |a &amp;#8722; c| + |b &amp;#8722; d| minutes. A cab may carry out a booked ride if it is its first ride of the day, or if it can get to the source address of the new ride from its latest , at least one minute before the new ride&#x2019;s scheduled departure. Note that some rides may end after midnight.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line of the input is a single positive integer N, telling the number of test scenarios to follow. Each scenario begins with a line containing an integer M, 0 &lt; M &lt; 500, being the number of booked taxi rides. The following M lines contain the rides. Each ride is described by a departure time on the format hh:mm (ranging from 00:00 to 23:59), two integers a b that are the coordinates of the source address and two integers c d that are the coordinates of the destination address. All coordinates are at least 0 and strictly smaller than 200. The booked rides in each scenario are sorted in order of increasing departure time.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each scenario, output one line containing the minimum number of cabs required to carry out all the booked taxi rides.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2\n08:00 10 11 9 16\n08:07 9 16 10 11\n2\n08:00 10 11 9 16\n08:06 9 16 10 11</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2004&amp;source=1&amp;searchmode=source\"> NWERC2004 </a> ","type":"source","format":"html","require":["katex"]}]}