{"title":"Card Game Cheater","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1962","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1962&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1962","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1962"},"statement":[{"title":"Problem Description","content":"Adam and Eve play a card game using a regular deck of 52 cards. The rules are simple. The players sit on opposite sides of a table, facing each other. Each player gets k cards from the deck and, after looking at them, places the cards face down in a row on the table. Adam&#x2019;s cards are numbered from 1 to k from his left, and Eve&#x2019;s cards are numbered 1 to k from her right (so Eve&#x2019;s i:th card is opposite Adam&#x2019;s i:th card). The cards are turned face up, and points are awarded as follows (for each i &#x2208; {1, . . . , k}):<br>&amp;#8226; If Adam&#x2019;s i:th card beats Eve&#x2019;s i:th card, then Adam gets one point.<br>&amp;#8226; If Eve&#x2019;s i:th card beats Adam&#x2019;s i:th card, then Eve gets one point.<br>&amp;#8226; A card with higher value always beats a card with a lower value: a three beats a two, a four beats a three and a two, etc. An ace beats every card except (possibly) another ace.<br>&amp;#8226; If the two i:th cards have the same value, then the suit determines who wins: hearts beats all other suits, spades beats all suits except hearts, diamond beats only clubs, and clubs does not beat any suit. <br><br>For example, the ten of spades beats the ten of diamonds but not the Jack of clubs. This ought to be a game of chance, but lately Eve is winning most of the time, and the reason is that she has started to use marked cards. In other words, she knows which cards Adam has on the table before he turns them face up. Using this information she orders her own cards so that she gets as many points as possible.<br><br>Your task is to, given Adam&#x2019;s and Eve&#x2019;s cards, determine how many points Eve will get if she plays optimally.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be several test cases. The first line of input will contain a single positive integer N giving the number of test cases. After that line follow the test cases.<br><br>Each test case starts with a line with a single positive integer k &#x2264; 26 which is the number of cards each player gets. The next line describes the k cards Adam has placed on the table, left to right. The next line describes the k cards Eve has (but she has not yet placed them on the table). A card is described by two characters, the first one being its value (2, 3, 4, 5, 6, 7, 8 ,9, T, J, Q, K, or A), and the second one being its suit (C, D, S, or H). Cards are separated by white spaces. So if Adam&#x2019;s cards are the ten of clubs, the two of hearts, and the Jack of diamonds, that could be described by the line <br><br>TC 2H JD<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case output a single line with the number of points Eve gets if she picks the optimal way to arrange her cards on the table.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1\nJD\nJH\n2\n5D TC\n4C 5H\n3\n2H 3H 4H\n2D 3D 4D</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n1\n2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2004&amp;source=1&amp;searchmode=source\"> NWERC2004 </a> ","type":"source","format":"html","require":["katex"]}]}