{"title":"Pipes","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1964","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1964&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1964","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1964"},"statement":[{"title":"Problem Description","content":"The construction of office buildings has become a very standardized task. Pre-fabricated modules are combined according to the customer&#x2019;s needs, shipped from a faraway factory, and assembled on the construction site. However, there are still some tasks that require careful planning, one example being the routing of pipes for the heating system. <br><br>Amodern office building ismade up of squaremodules, one on each floor being a service module from which (among other things) hot water is pumped out to the other modules through the heating pipes. Each module (including the service module) will have heating pipes connecting it to exactly two of its two to four neighboring modules. Thus, the pipes have to run in a circuit, from the service module, visiting each module exactly once, before finally returning to the service module. Due to different properties of the modules, having pipes connecting a pair of adjacent modules comes at different costs. For example, some modules are separated by thick walls, increasing the cost of laying pipes. Your task is to, given a description of a floor of an office building, decide the cheapest way to route the heating pipes.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a single integer, stating the number of floors to handle. Then follow n floor descriptions, each beginning on a new line with two integers, 2 &lt;= r &lt;= 10 and 2 &lt;= c &lt;= 10, defining the size of the floor &#x2013; r-by-c modules. Beginning on the next line follows a floor description in ASCII format, in total 2r + 1 rows, each with 2c + 2 characters, including the final newline. All floors are perfectly rectangular, and will always have an even number of modules. All interior walls are represented by numeric characters, &#x2019;0&#x2019; to &#x2019;9&#x2019;, indicating the cost of routing pipes through the wall (see sample input).","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line with the cost of the cheapest route.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n4 3\n#######\n# 2 3 #\n#1#9#1#\n# 2 3 #\n#1#7#1#\n# 5 3 #\n#1#9#1#\n# 2 3 #\n#######\n4 4\n#########\n# 2 3 3 #\n#1#9#1#4#\n# 2 3 6 #\n#1#7#1#5#\n# 5 3 1 #\n#1#9#1#7#\n# 2 3 0 #\n#########\n2 2\n#####\n# 1 #\n#2#3#\n# 4 #\n#####</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">28\n45\n10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2004&amp;source=1&amp;searchmode=source\"> NWERC2004 </a> ","type":"source","format":"html"}]}