{"title":"SETI","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1965","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1965&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1965","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1965"},"statement":[{"title":"Problem Description","content":"For some years, quite a lot of work has been put into listening to electromagnetic radio signals received from space, in order to understand what civilizations in distant galaxies might be trying to tell us. One signal source that has been of particular interest to the scientists at Universit&#xFFFD;e de Technologie Spatiale is the Nebula Stupidicus. <br><br>Recently, it was discovered that if each message is assumed to be transmitted as a sequence<br>of integers a0, a1, ...an&amp;#8722;1 the function <img style=\"max-width:100%;\" src=\"data/images/1965-1.gif\"> always evaluates to values 0 &lt;= f (k) &lt;= 26 for 1 &lt;= k &lt;= n, provided that the correct value of p is used. n is of course the length of the transmitted message, and the ai denote integers such that 0 &lt;= ai &lt; p. p is a prime number that is guaranteed to be larger than n as well as larger than 26. It is, however, known to never exceed 30 000. <br><br>These relationships altogether have been considered too peculiar for being pure coincidences, which calls for further investigation. <br><br>The linguists at the faculty of Langues et Cultures Extraterrestres transcribe these messages to strings in the English alphabet to make the messages easier to handle while trying to interpret their meanings. The transcription procedure simply assigns the letters a..z to the values 1..26 that f (k) might evaluate to, such that 1 = a, 2 = b etc. The value 0 is transcribed to ??(an asterisk). While transcribing messages, the linguists simply loop from k = 1 to n, and append the character corresponding to the value of f (k) at the end of the string.<br><br>The backward transcription procedure, has however, turned out to be too complex for the linguists to handle by themselves. You are therefore assigned the task of writing a program that converts a set of strings to their corresponding Extra Terrestial number sequences.<br>","type":"description","format":"html"},{"title":"Input","content":"On the first line of the input there is a single positive integer N, telling the number of test cases to follow. Each case consists of one line containing the value of p to use during the transcription of the string, followed by the actual string to be transcribed. The only allowed characters in the string are the lower case letters &#xFFFD;a?.&#xFFFD;z?and ??(asterisk). No string will be longer than 70 characters.","type":"input_format","format":"html"},{"title":"Output","content":"For each transcribed string, output a line with the corresponding list of integers, separated by space, with each integer given in the order of ascending values of i.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n31 aaa\n37 abc\n29 hello*earth</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 0 0\n0 1 0\n8 13 9 13 4 27 18 10 12 24 15</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2004&amp;source=1&amp;searchmode=source\"> NWERC2004 </a> ","type":"source","format":"html"}]}