{"title":"Sudoku","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1967","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1967&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1967","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1967"},"statement":[{"title":"Problem Description","content":"Oh no! Bill just realized that the sudoku puzzle he had spent the last ten minutes trying to solve essentially was last week&#x2019;s puzzle, only rotated counterclockwise. How cheap! Couldn&#x2019;t the magazine afford to make a new one every week? Of course, he had no way of knowing about this before he started to solve it, as the holes to fill with digits were other than last week. Nevertheless, realizing that this week&#x2019;s puzzle was a simple derivative of last week&#x2019;s certainly took the fun out of solving the rest of it.<br><br><img style=\"max-width:100%;\" src=\"data/images/1967-1.jpg\"><br><br>The sudoku board consists of 9*9 cells. These can be grouped into 3*3 regions of 3*3 cells each. Some of the cells are filled with a digit 1 through 9 while the rest of them are left empty. The aim of the game is to fill each empty cell with a digit 1 . . . 9 so that every row, every column and every region contains each of the numbers 1 . . . 9 exactly once. A proper sudoku puzzle always has exactly one solution.<br><br>Help Bill avoid unpleasant surprises by creating a program that checks whether an unsolved sudoku puzzle is in fact derived from an earlier puzzle by simple operations.<br><br>The allowed operations are:<br>1. Rotating the entire puzzle clockwise or counterclockwise.<br>2. Swapping two columns within a 3 * 9 column segment.<br>3. Swapping two rows within a 9 * 3 row segment.<br>4. Swapping entire row or column segments.<br>5. Applying a permutation f of the digits 1 . . . 9 to every cell (i.e. replace x by f (x) in every cell).<br><br>An operation is considered being performed on the sudoku solution (rather than on the unsolved puzzle) and always guarantees that if the board before the transformation was a solution to a sudoku puzzle, it still is afterwards. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input starts with the number of test cases 0 &lt;= N &lt;= 50 on a single line.<br><br>Then for every test case follow nine lines describing last week&#x2019;s puzzle solution, fromtop to bottom. Each line corresponds to a row in the puzzle and consists of nine digits (1 . . . 9), describing the contents of the cell from left to right.<br><br>Last week&#x2019;s solution is followed by nine lines describing this week&#x2019;s unsolved puzzle. Here, also, every line corresponds to a puzzle row and every digit (0 . . . 9) describes the contents of a cell. 0 indicates that the cell is empty. The rows are presented ordered from top to bottom, and within each row, the cells are ordered from left to right.<br><br>After every test case except the last one follows a blank line. Every unsolved puzzle is guaranteed to be uniquely solvable and last week&#x2019;s solution is always a proper sudoku solution.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case, output Yes if the sudoku puzzle can be derived from the given solved puzzle using the allowed operations, or No if this is not possible.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n963174258\n178325649\n254689731\n821437596\n496852317\n735961824\n589713462\n317246985\n642598173\n060104050\n200000001\n008305600\n800407006\n006000300\n700901004\n500000002\n040508070\n007206900\n534678912\n672195348\n198342567\n859761423\n426853791\n713924856\n961537284\n287419635\n345286179\n010900605\n025060070\n870000902\n702050043\n000204000\n490010508\n107000056\n040080210\n208001090</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes\nNo</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2006&amp;source=1&amp;searchmode=source\"> NWERC2006 </a> ","type":"source","format":"html","require":["katex"]}]}