{"title":"The SetStack Computer","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1968","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1968&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1968","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1968"},"statement":[{"title":"Problem Description","content":"Background from Wikipedia: &#xFFFD;Set theory is a branch of mathematics created principally by the German mathematician Georg Cantor at the end of the 19th century. Initially controversial, set theory has come to play the role of a foundational theory in modern mathematics, in the sense of a theory invoked to justify assumptions made inmathematics concerning the existence of mathematical objects (such as numbers or functions) and their properties. Formal versions of set theory also have a foundational role to play as specifying a theoretical ideal of mathematical rigor in proofs.?Given this importance of sets, being the basis of mathematics, a set of eccentric theorist set off to construct a supercomputer operating on sets instead of numbers. The initial Set-Stack Alpha is under construction, and they need you to simulate it in order to verify the operation of the prototype.<br><br><img style=\"max-width:100%;\" src=\"data/images/1968-1.jpg\"><br><br>The computer operates on a single stack of sets, which is initially empty. After each operation, the cardinality of the topmost set on the stack is output. The cardinality of a set S is denoted |S| and is the number of elements in S. The instruction set of the SetStack Alpha is PUSH, DUP, UNION, INTERSECT, and ADD.<br>?PUSH will push the empty set {} on the stack.<br>?DUP will duplicate the topmost set (pop the stack, and then push that set on the stack twice).<br>?UNION will pop the stack twice and then push the union of the two sets on the stack. <br>?INTERSECT will pop the stack twice and then push the intersection of the two sets on the stack.<br>?ADD will pop the stack twice, add the first set to the second one, and then push the resulting set on the stack.<br>For illustration purposes, assume that the topmost element of the stack is A = {{}, {{}}} and that the next one is B = {{}, {{{}}}}.<br>For these sets, we have |A| = 2 and |B| = 2. Then: <br>?UNION would result in the set { {}, {{}}, {{{}}} }. The output is 3.<br>?INTERSECT would result in the set { {} }. The output is 1.<br>?ADD would result in the set { {}, {{{}}}, {{},{{}}} }. The output is 3.<br>","type":"description","format":"html"},{"title":"Input","content":"An integer 0 &lt;= T &lt;= 5 on the first line gives the cardinality of the set of test cases. The first line of each test case contains the number of operations 0 &lt;= N &lt;= 2 000. Then follow N lines each containing one of the five commands. It is guaranteed that the SetStack computer can execute all the commands in the sequence without ever popping an empty stack.","type":"input_format","format":"html"},{"title":"Output","content":"For each operation specified in the input, there will be one line of output consisting of a single integer. This integer is the cardinality of the topmost element of the stack after the corresponding command has executed. After each test case there will be a line with *** (three asterisks).","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n9\nPUSH\nDUP\nADD\nPUSH\nADD\nDUP\nADD\nDUP\nUNION\n5\nPUSH\nPUSH\nADD\nPUSH\nINTERSECT</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n0\n1\n0\n1\n1\n2\n2\n2\n***\n0\n0\n1\n0\n0\n***</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC2006&amp;source=1&amp;searchmode=source\"> NWERC2006 </a> ","type":"source","format":"html"}]}