{"title":"Monkey Vines","time_limit":500,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=1990","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=1990&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=1990","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=1990"},"statement":[{"title":"Problem Description","content":"Deep in the Amazon jungle, exceptionally tall trees grow that support a rich biosphere of figs and juniper bugs, which happen to be the culinary delight of brown monkeys.<br>Reaching the canopy of these trees requires the monkeys to perform careful navigation through the tall tree&#x2019;s fragile vine system. These vines operate like a see-saw: an unbalancing of weight at any vine junction would snap the vine from the tree, and the monkeys would plummet to the ground below. The monkeys have figured out that if they work together to keep the vines properly balanced, they can all feast on the figs and juniper bugs in the canopy of the trees.<br>A vine junction supports exactly two sub-vines, each of which must contain the same number of monkeys, or else the vine will break, leaving a pile of dead monkeys on the jungle ground. For purposes of this problem, a vine junction is denoted by a pair of matching square brackets [ ], which may contain nested information about junctions further down its sub-vines. The nesting of vines will go no further than 25 levels deep.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C105-1006-1.JPG\"> </center><br><br>You will write a program that calculates the minimum number of monkeys required to balance a particular vine configuration. There is always at least one monkey needed, and, multiple monkeys may hang from the same vine.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains a single integer N, (1 &#x2264; N &#x2264; 1000) which is the number of datasets that follow.<br>Each dataset consists of a single line of input containing a vine configuration consisting of a string of [ and ] characters as described above. The length of the string of [ and ] will be greater than or equal to zero, and less than or equal to 150.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each dataset, you should generate one line of output with the following values: The dataset number as a decimal integer (start counting at one), a space, and the minimum number of monkeys required to reach the canopy successfully. Assume that all the hanging vines are reachable from the jungle floor, and that all monkeys jump on the vines at the same time.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n[]\n\n[[][[]]]</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2\n2 1\n3 8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+%A1%B0Shun+Yu+Cup%A1%B1+Zhejiang+Collegiate+Programming+Contest+-+Warm+Up%A3%A81%A3%A9&amp;source=1&amp;searchmode=source\"> 2008 &#x201C;Shun Yu Cup&#x201D; Zhejiang Collegiate Programming Contest - Warm Up&#xFF08;1&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}