{"title":"Same or not","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2228","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2228&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2228","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2228"},"statement":[{"title":"Problem Description","content":"Everyone konws how to traveling a tree using the DFS strategy. But we also know that there are many ways to do so. For example, giving a tree as the following picture, we may get three ways: 010011, 001101, 01010011. 0 stands for the down operation while 1 means the up operation.<br>Now we make a constraint: if one node has k direct childs, you can visit a node at most 2*k times, if k == 0, you can visit it only once, in the example, the root has two direct child. Like the example, you can only get two ways: 010011, 001101. Because the way 01010011 will visit the node in yellow four times.<br>Here is the problem: ACboy drawed a tree, but is not very nice, so he won&apos;t show you the picture. Instread he will give you two strings indicating that the ways to travel the tree. Of cource, the strings will only contain 0 and 1. And your mission is to tell whether ACboy is telling the truth. For example, he drawed a picture as the following, if he give you 010011 and 001101, then he is telling the truth, but if he give you 010011 and 01010011, you konw that he is telling a lie.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C138-1005-1.jpg\"></center>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line of input is a single positive integer n, telling the number of test scenarios to follow.Each test case consists of two lines, each containing a string of the characters &apos;0&apos; and &apos;1&apos; of length at most 3000, both describing a way to travel the tree.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case output a line containing the word &quot;True&quot; or the word &quot;False&quot;, depending on whether ACboy is telling the truth.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n010011\n001101\n010011\n01010011</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">True\nFalse</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"8600","type":"source","format":"html","require":["katex"]}]}