{"title":"I can do it better","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2231","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2231&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2231","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2231"},"statement":[{"title":"Problem Description","content":"ACboy is playing a new stone game. There&apos;s a rectangular grid board, and some stones placed at the initial location Bi(Xi, Yi) and the targets are at the location Si(Pj, Qj), the time that moving between them is Di,j = |Xi - Pj| + |Yi - Qj| + 1 minutes. And at different places may have different stones, and different target places have different capacity. In the following picture, B1,2,3 stands for the initial places, S1,2,3,4 stands for the target places. In detail, B1(5) means there are 5 stones at this location, S2(4) means you can move at most 4 stones to this target location.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C138-1008-1.bmp\"></center><br>The one who moves the stones from the initial places to the target places using less time will win. So ACboy now telling you his play plan, and you should tell hime whether his plan is the best, or he can do it better.<br>","type":"description","format":"html"},{"title":"Input","content":"The input file consists of The game board description and the play plan description. The first line of the input file consists of two numbers N and M separated by a space. N (1 &lt;= N &lt;= 100) is a number of initial places(numbered from 1 to N). M (1 &lt;= M &lt;= 100) is a number of target places(numbered from 1 to M).<br><br>The following N lines describe initial places. Each line contains there integer numbers Xi, Yi, and Bi separated by spaces, where Xi, Yi (-1000 &lt;= Xi, Yi &lt;= 1000) are the coordinates of initial places, and Bi (1 &lt;= Bi &lt;= 1000) is the number of stones at this location.<br><br>The description of initial places is followed by M lines that describe target places. Each line contains three integer numbers Pj, Qj, and Cj separated by spaces, where Pi, Qi (-1000 &lt;= Pj, Qj &lt;= 1000) are the coordinates of the target places, and Cj (1 &lt;= Cj &lt;= 1000) is the capacity of this place.<br><br>The description of the play plan follows on the next N lines. The play plan of ith initial place consists of M integer numbers Ei,j separated by spaces. Ei,j (0 &lt;= Ei, j &lt;= 1000) is a number of stones that shall move from the ith initial place to the jth target place.<br><br>The plan in the input file is guaranteed to be valid. Namely, B1+B2+....+Bn &lt;= S1+S2+....+Sn.<br><br>Process to the end of file.","type":"input_format","format":"html"},{"title":"Output","content":"If ACboy&apos;s plan is the best, print &quot;good&quot;, otherwise, print&quot;I can do it better&quot;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1\n0 0 5\n1 1 5\n2 2 5\n5\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">I can do it better\n\nHint: in the case, ACboy moves the 5 stones from B1 at (0,0) to S1 at (2,2), and it costs him 5*5 = 25 minutes, \nbut if he move the 5 stones from B2 at (1,1) to S1 at (2,2), it will only takes him 3*5 = 15 minutes, so his plan is not the best.</div></pre>","type":"example","format":"html"},{"title":"Author","content":"8600","type":"source","format":"html"}]}