{"title":"The dress rehearsal of opening ceremony","time_limit":1500,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2252","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2252&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2252","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2252"},"statement":[{"title":"Problem Description","content":"As we all known, the Beijing Olympic Games had been hold in Aug 8th,2008.We are all excited about the opening ceremony directed by Yimou Chang. But how many people can taste the difficulties and the tears during the dress rehearsal.<br>I know we must have a deep impression to the performance named &#x201C;Print&#x201D;, finally it displays the Chinese word &#x201C;&#x548C;&#x201D;, which means our Chinese people love peace and harmony. Yimou tells me that there are many actresses in the play, each one has a number from 1, 9, ... to 9^m(0&lt;=m&lt;2^31). Those whose number&#x2019;s first digit is 9, will stand to make up the &#x201C;&#x548C;&#x201D; at last, while others will squat. The total number of people who make up the &#x201C;&#x548C;&#x201D; is N. Maybe N is too big, so let  N=N%249+2.<br>Another moving story, there are N small circles on the ground. Each circle stands an actress. The N small circles form a big circle. At the beginning, the actresses play around the big circle clockwise. That means one actress jumped to the adjacent small circle in colckwise of the small circle she is now in. But clever Yimou find that after N times, every actress will be back to her original place. The time is too short. In order to lengthen the  time of the performance, he changes his mind. Yimou also sets N arrows on the ground. Each small circle is just the start of a arrow and the end of another arrow. No circle has the same arrow&#x2019;s start and end. Every actress jumps to the next circle along the direction of the arrow. When all the actresses return to their original circle, their performance ends. Now Yimou wants to know the maximal steps they can have. If you know the answer, please call &#x201C;110&#x201D; to tell Yimou, I think you will get a BIG surprise! <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases. Each case only have an interger m. Process to the End Of File.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output the final answer in one line.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n23</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ+2008+Summer+Exercise%A3%A84%A3%A9-+Buffet+Dinner&amp;source=1&amp;searchmode=source\"> HDOJ 2008 Summer Exercise&#xFF08;4&#xFF09;- Buffet Dinner </a> ","type":"source","format":"html","require":["katex"]}]}