{"title":"Bob's trouble","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2257","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2257&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2257","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2257"},"statement":[{"title":"Problem Description","content":"    Bob is a journalist, nowadays,he has a trouble. You know ,the Olympic Games  is around the corner, as a fan of athletic sports, he certainly wants to see the Olympic Games, but as a journalist, the Olympic Games seems to be the busiest time,because Bob needs to report so many  games.Fortunately , he has a kind boss.He gives Bob a target, as long as Bob meets the requirement, he can go home to see the Olympic Games.  <br>  Now,the boss gives every competition a value, which represents the importance of the competition.As long as the sum  of  the competitions&apos; value that Bob reported is not less than the target, he can go home.Although there are a lot of competitions every day,some competitions may take at the same time, so Bob can only choose some competitions to  report.Now the problem is what&apos;s the earliest time that Bob can go home?<br>  To finish his work more easily, Bob gets some information about the competition.He finds every day is divided into 24 parts and every competition takes up at most 2 parts.There are 3 kinds of competitions:the first one only takes up 1 part of a day;the second one takes up two successional parts<br> of a day,it means the competition will hold at the p day&apos;s q and (q+1) part;the third one is special,it is held at two successional days,it means the competition will hold at the p and p+1 days&apos; q part(ie.If a competition is held at the 2 day&apos;s 3 part, it will also take up the 3 day&apos;s 3 part.)<br>Meanwhile Bob finds two competitions&apos; first parts  will not coincide,and two competitions&apos; second parts  will not coincide .<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains the number of cases.<br>For each case, there are several lines represent the information of the competitions (The number of competitions will not exceed 1150).Each line includes p : the start day of the competition (0 &lt;= p &lt;50); q : the start part of the competition (0 &lt;= q &lt;23) ; a string s represents the form of the competition ( &quot;first&quot; or &quot;second&quot; or &quot;third&quot; as recorded above ) ) the last one is the value of the competition  m (0 &lt;m &lt;1000). Separate line  with -1 means the end of the competition. Then a  line with a num, need (0 &lt;= need &lt;2000000), means  the boss&apos;s target.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every case ,output the earliest day that Bob can go home.If it is impossible,output &quot;what a pity!&quot; <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0 17 third 999\n-1\n990\n0 1 second 90\n0 2 first 900 \n-1\n990</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\nwhat a pity!\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div> For the first case, the form of the competition is &quot;third&quot;,so it will hold at the 0 day&apos;s 17 and the 1 day&apos;s 17.\n  so it takes Bob 2 days to finish the report.\n For the second case, the first competion holds at  the 0 day&apos;s 1 and 2,the second competition holds at  the 0 day&apos;s 2,so Bob can only choose one of them.The  value he can get is 900,so he can&apos;t go home.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]}]}