{"title":"Balance","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2263","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2263&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2263","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2263"},"statement":[{"title":"Problem Description","content":"You are given a set of weight values and asked to measure something with a certain weight. Weight x is measurable with a set y of weight values if and only if you can do the following: Place one weight with value x on either the left or right side of the scale. Then place some combination of weights on the scale with values from the set y so that the left and right sides have the same total value. You may use each value in y zero or more times to achieve this. In order to reach the target, you choose a kind of weight randomly and try to measure with it. If you find it impossible, you choose an additional kind and try again until you can measure with the set of weights you have chosen. Now, please tell me the expect kinds of weight you have to choose. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"For each case, the first line is two integers n and m (1&lt;=n&lt;=15), which n represents the number of weights you have and m is the weight you have to measure. Followed by n positive integers ai (1&lt;=i&lt;=n), indicating the mass of each kind of weight. 0 &lt; m,ai &lt; 2^31. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output -1 if you can&apos;t measure with all kinds of weight you have or the expect number of kinds you have to choose which rounded to 3 decimal places. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2\n3\n3 3\n1 2 3\n3 5\n2 3 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1\n1.333\n2.333</div></pre>","type":"example","format":"html","require":["katex"]}]}