{"title":"Tour Guide","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2316","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2316&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2316","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2316"},"statement":[{"title":"Problem Description","content":"You are working as a guide on a tour bus for retired people, and today you have taken your regular Nordic seniors to The Gate of Heavenly Peace. You let them have a lunch break where they could do whatever they like. Now you have to get them back to the bus, but they are all walking in random directions. You try to intersect them, and send them straight back to the bus. Minimize the time before the last person is in the bus. You will always be able to run faster than any of the tour guests, and they walk with constant speed, no matter what you tell them. The seniors walk in straight lines, and the only way of changing their direction is to give them promises of camphor candy. A senior will neither stop at nor enter the bus before given such a promise.","type":"description","format":"html"},{"title":"Input","content":"A number of test cases consisting of: A line with an integer 1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 8, the number of people on the tour. A line with an floating point number 1 &lt; v &#xFFFD;&#xFFFD; 100, your maximum speed (you start in the bus at the origin). Then follow n lines, each containing four floating point numbers xi yi vi ai, the starting coordinates (-10<sup>6</sup> &#xFFFD;&#xFFFD; xi, yi &#xFFFD;&#xFFFD; 10<sup>6</sup>), speed (1 &#xFFFD;&#xFFFD; vi &lt; 100) and direction (0 &#xFFFD;&#xFFFD; ai &lt; 2&#xFFFD;&#xFFFD;) of each of the tour guests.<br><br>The input is terminated by a case with n = 0, which should not be processed. All floating point numbers in the input will be written in standard decimal notation, and have no more than 10 digits.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a line with the time it takes before everybody is back in the bus (the origin). Round the answer to the nearest integer. The answer will never be larger than 10<sup>6</sup>.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n50.0\n125.0 175.0 25.0 1.96\n3\n100.0\n40.0 25.0 20.0 5.95\n-185.0 195.0 6.0 2.35\n30.0 -80.0 23.0 2.76\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">20\n51\n\n\nHint\n\nQ: Should 2.5000000000 be rounded to 3?\nA: We have constructed the test cases such that it does not matter.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Nordic+2006&amp;source=1&amp;searchmode=source\"> Nordic 2006 </a> ","type":"source","format":"html"}]}