{"title":"Random Walking","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2322","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2322&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2322","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2322"},"statement":[{"title":"Problem Description","content":"The Army of Coin-tossing Monkeys (ACM) is in the business of producing randomness. Good random numbers are important for many applications, such as cryptography, online gambling, randomized algorithms and panic attempts at solutions in the last few seconds of programming competitions.<br><br>Recently, one of the best monkeys has had to retire. However, before he left, he invented a new, cheaper way to generate randomness compared to directly using the randomness generated by coin-tossing monkeys. The method starts by taking an undirected graph with 2<sup>n</sup> nodes labelled 0, 1, &#x2026;, 2<sup>n</sup> - 1. To generate k random n-bit numbers, they will let the monkeys toss n coins to decide where on the graph to start. This node number is the first number output. The monkeys will then pick a random edge from this node, and jump to the node that this edge connects to. This new node will be the second random number output. They will then select a random edge from this node (possibly back to the node they arrived from in the last step), follow it and output the number of the node they landed on. This walk will continue until k numbers have been output.<br><br>During experiments, the ACM has noticed that different graphs give different output distributions, some of them not very random. So, they have asked for your help testing the graphs to see if the randomness is of good enough quality to sell.<br><br>They consider a graph good if, for each of the n bits in each of the k numbers generated, the probability that this bit is output as 1 is greater than 25% and smaller than 75%.<br>","type":"description","format":"html"},{"title":"Input","content":"The input will consist of several data sets. Each set will start with a line consisting of three numbers k, n, e separated by single spaces, where k is the number of n-bit numbers to be generated and e is the number of edges in the graph (1 &#x2264; k &#x2264; 100, 1 &#x2264; n &#x2264; 10 and 1 &#x2264; e &#x2264; 2000). The next e lines will consist of two space-separated integers v1, v2 where 0 &#x2264; v1, v2 &lt; 2<sup>n</sup> and v1 &#x2260; v2. Edges are undirected and each node is guaranteed to have at least one edge. There may be multiple edges between the same pair of nodes.<br>The last test case will be followed by a line with k = n = e = 0, which should not be processed.","type":"input_format","format":"html"},{"title":"Output","content":"For each input case, output a single line consisting of the word Yes if the graph is good, and No otherwise.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10 2 3\n0 3\n1 3\n2 3\n5 2 4\n0 1\n0 3\n1 2\n2 3\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">No\nYes</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Nordic+2006&amp;source=1&amp;searchmode=source\"> Nordic 2006 </a> ","type":"source","format":"html"}]}