{"title":"Roman Expressions","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2326","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2326&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2326","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2326"},"statement":[{"title":"Problem Description","content":"As any other marketing company, ACM produces a lot of funky advertising items that may contain a logo and be given to customers and business partners as small gifts. A unique specialty of ACM is a calculator that uses roman numbers.<br><br>Roman numbers are able to express any non-negative integer using uppercase letters:<br><img style=\"max-width:100%;\" src=\"../../../data/images/2326-1.jpg\"><br>Numbers are created by appending several letters together, the letter representing a higher value must always precede letters with lower values. The only exception are the letters &#x201C;I&#x201D;, &#x201C;X&#x201D;, and &#x201C;C&#x201D;, they may be used before higher letters to form values expressed by digits 4 and 9. The only possible combinations are:<br><img style=\"max-width:100%;\" src=\"../../../data/images/2326-2.jpg\"><br>Any roman number must first express thousands, then hundreds, tens, and ones. Therefore, 499 must always be written as &#x201C;CDXCIX&#x201D;, not &#x201C;ID&#x201D;.<br><br>Although not very practical, this gift is considered extremely &#x201C;cooooool&#x201D;. Your task is to write software for that calculator.","type":"description","format":"html"},{"title":"Input","content":"The input will consist from commands, each written on a separate line. Possible commands are<br>assignments, &#x201C;RESET&#x201D;, and &#x201C;QUIT&#x201D;.<br>An assignment command starts with a single digit representing one of ten registers that the<br>calculator has. The register number is followed by an equal sign (&#x201C;=&#x201D;) and an expression. The<br>expression will consist only from valid roman numbers, register names (digits), plus (&#x201C;+&#x201D;) and<br>minus (&#x201C;-&#x201D;) signs. You may assume that the expression will always be valid and no longer than<br>10000 characters.","type":"input_format","format":"html"},{"title":"Output","content":"For each command, output a single line. For assignments, print the register name, equal sign,<br>and the value that is being assigned to that register. Instead of it, print the word &#x201C;Error&#x201D;, if the<br>expression contains a reference to a register that has not been assigned before, or if the result<br>is negative or larger than 10000. In such cases, no change to register values is made.<br>For RESET commands, invalidate all previous register assignments and print the word &#x201C;Ready&#x201D;.<br>The QUIT command will be the last one. Print the word &#x201C;Bye&#x201D; and terminate the program.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1=MC+IV-X\n1=1+1\nRESET\n1=1+X\n1=MM\n1=1+1+1+1+1\n2=1+1\nQUIT</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1=MXCIV\n1=MMCLXXXVIII\nReady\nError\n1=MM\n1=MMMMMMMMMM\nError\nBye</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=CTU+Open+Contest+2007&amp;source=1&amp;searchmode=source\"> CTU Open Contest 2007 </a> ","type":"source","format":"html"}]}