{"title":"Hypertheseus","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2332","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2332&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2332","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2332"},"statement":[{"title":"Problem Description","content":"For one of their clients, ACM prepares a TV advertisement that features ancient heroes, for example Prometheus, Achilles, Odysseus and many others. To demonstrate how difficult was life for these heroes, ACMruns computer simulations of their most famous tasks. In this problem, we will try to solve the problem of Theseus.<br><br>Theseus was an Athenian hero who killed Minotaur, the half-man, half-bull monster residing in an inescapable Labyrinth constructed by Daedalus. The hardest part of Theseus&#x2019; task was not killing the monster &#x2014; the legend says Minotaur was just sleeping when Theseus came to him. Thus, the hero was able to batter the monster with his bare hands. But then the real challenge came: to find the way out. As you may know, Ariadne, beautiful daughter of king Minos, played an important role in this part. But that&#x2019;s a different story.<br><br>As the technology advanced a lot since the ancient times, there are several important differences in today&#x2019;s simulations:<br><br>1. Labyrinth-making skills advanced as well. Two-dimensional labyrinths are not a big challenge anymore. Thus, our labyrinth is d-dimensional. It looks like a regular &#x201D;grid&#x201D; of n1&#xD7;n2&#xD7;. . .&#xD7;nd (hyper)cubes, each of them being either empty (corridor) or filled with a rock (wall). Theseus moves in steps, each step means travelling between two neighboring empty hypercubes in any dimension. Two hypercubes are considered neighboring, if and only if the difference in their<br>space coordinates is exactly one in one dimension, and zero in all other dimensions.<br><br>2. Our Minotaur is stronger, thus, it is no more possible to batter him with bare hands. Theseus must use a sword which lies somewhere inside the labyrinth. Note that before he takes the sword, he cannot go through the hypercube where Minotaur resides!","type":"description","format":"html"},{"title":"Input","content":"Input Specification<br><br>The input consists of several labyrinth descriptions. Each description begins with a line containing a single integer number d (2 &#x2264; d &#x2264; 20) &#x2014; the number of dimensions. On the second line of each description, there are d integer numbers n1, n2, . . ., nd separated by spaces. These numbers give the size of the labyrinth in every dimension, measured in unit hypercubes (&amp;#8704;i : 2 &#x2264; ni). You may assume that the total number of hypercubes in any labyrinth will not exceed 220 = 1048576.<br><br>Then a labyrinth map follows, the description is defined recursively: Two-dimensional labyrinth (of the size n1 &#xD7; n2) is described by n2 lines containing n1 characters each. Every character describes a single hypercube (&#x201D;square&#x201D; in the case of 2 dimensions) and is either &#x201C;#&#x201D; (rock), &#x201C;.&#x201D; (free space), or one of uppercase letters &#x201C;T&#x201D; (Theseus&#x2019; position), &#x201C;M&#x201D; (Minotaur), and &#x2019;S&#x2019; (sword). Each of these three objects will appear exactly once in the whole labyrinth. The hypercubes<br>containing the letters are considered &#x201D;empty&#x201D; otherwise, i.e., Theseus can walk (and must walk) through them.<br><br>For better clarity of the input, each two-dimensional map is followed by one empty line.<br><br>For d &gt; 2, any d-dimensional labyrinth is a sequence of nd &#x201D;layers&#x201D;, each layer being a description of a (d &amp;#8722; 1)-dimensional labyrinth.<br><br>The last labyrinth description is followed by a line containing zero. This line terminates the input and no output should be produced for it.","type":"input_format","format":"html"},{"title":"Output","content":"For each labyrinth, output the sentence &#x201C;Theseus needs S steps.&#x201D;, where S is the smallest possible amount of steps needed to reach the hypercube with the sword, the hypercube with Minotaur, and then back to the original Theseus&#x2019; position (where the exit is supposed to be). It is not possible to leave the labyrinth area, i.e., all hypercubes outside the labyrinth are considered rocks. Exit may appear in an inner hypercube, it may not reside on the &#x201C;border&#x201D;.<br><br>If it is not possible to solve the situation at all, output sentences &#x201C;No solution. Poor Theseus!&#x201D;","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 3\nT..\nM#.\nS..\n\n2\n3 2\nT#S\n..M\n\n3\n4 4 3\n#S..\n###.\n#M..\n###.\n\n.###\n.###\n.###\n....\n\n....\n###.\n###T\n####\n\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Theseus needs 8 steps.\nNo solution. Poor Theseus!\nTheseus needs 40 steps.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=CTU+Open+Contest+2007&amp;source=1&amp;searchmode=source\"> CTU Open Contest 2007 </a> ","type":"source","format":"html"}]}