{"title":"Containers","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2335","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2335&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2335","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2335"},"statement":[{"title":"Problem Description","content":"At a container terminal, containers arrive from the hinterland, one by one, by rail, by road, or by small ships. The containers are piled up as they arrive. Then the huge cargo ships arrive, each one capable of carrying thousands of containers. The containers are loaded into the ships that will bring them to far away shores. Or the other way round, containers are brought in over sea, piled up, and transported to the hinterland one by one. Anyway, a huge parking lot is needed, to store the containers waiting for further transportation.<br><img style=\"max-width:100%;\" src=\"../../../data/images/3499_1.png\"><br>Building the new container terminal at the mouth of the river was a good choice. But there are disadvantages as well. The ground is very muddy, and building on firm ground would have been substantially cheaper. It will be important to build the parking lot not larger than necessary.<br><br>A container is 40 feet long and 8 feet wide. Containers are stacked, but a stack will be at most five containers high. The stacks are organized in rows. Next to a container stack, and between two container stacks (along the long side of the containers) a space of 2 feet is needed for catching the containers. Next to a row of stacks, and between two stacks (along the short side of the containers) a space of 4 feet is needed for the crane that lifts the containers. All containers are placed in the same direction, as the cranes can not make turns on the parking lot.<br><br>The parking lot should be rectangular. Given the required capacity of the parking lot, what will be the best dimension for the parking lot? In the first place the area should be minimal. The second condition is that the parking lot should be as square as possible.<br><br>Below you see a plan for a parking lot with a capacity of 8 stacks. Two rows of four containers each turns out to be the best solution here, with a total area of 92 &#xD7; 42 = 3864.<br><br><br>A parking lot with 8 container stacks.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line one positive number: the number of testcases, at most 100. After that per testcase:<br><br>A single positive integer n (n &#x2264; 10<sup>12</sup>) on a single line: the required capacity (number of containers) for the parking lot.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Per testcase:<br><br>A single line, containing the length, width (length &#x2265; width) and area of the optimal solution. The optimal solution has the least possible area, and if there are multiple solutions having the same area, the difference length - width should be minimal.<br>Use the sample format.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n1\n15\n22\n29\n36\n43</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">48 X 12 = 576\n48 X 32 = 1536\n52 X 48 = 2496\n92 X 32 = 2944\n92 X 42 = 3864\n136 X 32 = 4352</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Northwestern+Europe+2007&amp;source=1&amp;searchmode=source\"> Northwestern Europe 2007 </a> ","type":"source","format":"html","require":["katex"]}]}