{"title":"Escape from Enemy Territory","time_limit":5000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2337","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2337&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2337","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2337"},"statement":[{"title":"Problem Description","content":"A small group of commandos has infiltrated deep into enemy territory. They have just accomplished their mission and now have to return to their rendezvous point. Of course they don&#xFFFD;&#xFFFD;t want to get caught even if the mission is already over. Therefore they decide to take the route that will keep them as far away from any enemy base as possible.<br><br>Being well prepared for the mission, they have a detailed map of the area which marks all (known) enemy bases, their current position and the rendezvous point. For simplicity, we view the the map as a rectangular grid with integer coordinates (x, y) where 0 &#xFFFD;&#xFFFD; x &lt; X, 0 &#xFFFD;&#xFFFD; y &lt; Y. Furthermore, we approximate movements as horizontal and vertical steps on this grid, so we use Manhattan distance: dist((x1, y1), (x2, y2)) = |x2 &amp;#8722; x1| + |y2 &amp;#8722; y1|. The commandos can only travel in vertical and horizontal directions at each step.<br><br>Can you help them find the best route? Of course, in case that there are multiple routes that keep the same minimum distance to enemy bases, the commandos want to take a shortest route that does so. Furthermore, they don&#xFFFD;&#xFFFD;t want to take a route off their map as it could take them in unknown, dangerous areas, but you don&#xFFFD;&#xFFFD;t have to worry about unknown enemy bases off the map.","type":"description","format":"html"},{"title":"Input","content":"On the first line one positive number: the number of testcases, at most 100. After that per testcase:<br><br>One line with three positive numbers N, X, Y. 1 &#xFFFD;&#xFFFD; N &#xFFFD;&#xFFFD; 10 000 is the number of enemy bases and 1 &#xFFFD;&#xFFFD; X, Y &#xFFFD;&#xFFFD; 1 000 the size of the map: coordinates x, y are on the map if 0 &#xFFFD;&#xFFFD; x &lt; X, 0 &#xFFFD;&#xFFFD; y &lt; Y.<br><br>One line containing two pairs of coordinates xi, yi and xr, yr: the initial position of the commandos and the rendezvous point.<br><br>N lines each containing one pair of coordinates x, y of an enemy base.<br><br>All pairs of coordinates are on the map and different from each other.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Per testcase:<br><br>One line with two numbers separated by one space: the minimum separation from an enemy base and the length of the route.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 2 2\n0 0 1 1\n0 1\n2 5 6\n0 0 4 0\n2 1\n2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2\n2 14</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Northwestern+Europe+2007&amp;source=1&amp;searchmode=source\"> Northwestern Europe 2007 </a> ","type":"source","format":"html"}]}