{"title":"Tower Parking","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2341","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2341&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2341","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2341"},"statement":[{"title":"Problem Description","content":"There is a new revolution in the parking lot business: the parking tower. The concept is simple: you drive your car into the elevator at the entrance of the tower, and the elevator and conveyor belts drag the car to an empty parking spot, where the car remains until you pick it up. When you return, the elevator and conveyor belts move your car back to the entrance and you&#xFFFD;&#xFFFD;re done.<br><br>The layout of the tower is simple. There is one central elevator that transports the cars between the different floors. On each floor there is one giant circular conveyor belt on which the cars stand. This belt can move in clockwise and counterclockwise direction. When the elevator arrives on a floor, it becomes part of the belt so that cars can move through it.<br><br>At the end of the day the tower is usually packed with cars and a lot of people come to pick them up. Customers are processed in a first come first serve order: the elevator is moved to the floor of the first car, the conveyor belt moves the car on the elevator, the elevator is moved down again, and so on. We like to know how long it takes before the last customer gets his car. Moving the elevator one floor up- or downwards takes 10 seconds and moving a conveyor belt one car in either direction takes 5 seconds.<br>","type":"description","format":"html"},{"title":"Input","content":"On the first line one positive number: the number of testcases, at most 100. After that per testcase:<br><br>One line with two integers h and l with 1 &#xFFFD;&#xFFFD; h &#xFFFD;&#xFFFD; 50 and 2 &#xFFFD;&#xFFFD; l &#xFFFD;&#xFFFD; 50: the height of the parking tower and the length of the conveyor belts.<br><br>h lines with l integers: the initial placement of the cars. The jth number on the ith line describes the jth position on the ith floor. This number is -1 if the position is empty, and r if the position is occupied by the rth car to pick up. The positive numbers form a consecutive sequence from 1 to the number of cars. The entrance is on the first floor and the elevator (which is initially empty) is in the first position. There is at least one car in the parking tower.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Per testcase:<br><br>One line with the number of seconds before the last customer is served.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 5\n-1 2 1 -1 3\n3 6\n-1 5 6 -1 -1 3\n-1 -1 7 -1 2 9\n-1 10 4 1 8 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">25\n320</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Northwestern+Europe+2007&amp;source=1&amp;searchmode=source\"> Northwestern Europe 2007 </a> ","type":"source","format":"html"}]}