{"title":"The Final Countdown","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2359","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2359&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2359","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2359"},"statement":[{"title":"Problem Description","content":"When Doctor Doom modeled LAI-BACH (the Latverian Aerospace Institute, Bolograd Active Control Headquarters) on Mission Command with<br>NASA, he perhaps cribbed from the source a bit too closely.<br><br>NASA (and therefore LAI-BACH) have a peculiar way of handling countdowns to missions. While the clock may state that it is, say, thirty minutes<br>until liftoff for a rocket or shuttle, there are built-in holds where the clock is stopped for a set amount of time. For example, there may be a 15-minute<br>hold when the countdown reaches the 8-minute mark. The end result is that more time passes from the beginning of the countdown to the end than<br>the numbers on the clock would imply.<br><br>LAI-BACH uses a simple &quot;command file&quot; format to manage holds for their countdowns on their computer systems. All commands start with a<br>positive integer no greater than 1440 (countdowns longer than a day make Doctor Doom angry), followed by a directive. The format of the<br>commands is as follows:<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/c131-1009-1.jpg\"></center><br><br>All conditions are represented by short strings of lowercase letters, no more than 20 characters long; their actual values are not provided in the<br>command structure, as they are determined by actual conditions during the launch (whether the fuel tanks have been topped off, whether the<br>Fantastic Four is currently fighting Doctor Doom, and so on), but they are always either true or false and do not change during the course of a single<br>countdown. A hold time n is a positive integer no more than 60 (minutes), as long delays also irritate Victor.<br><br>Given a particular command file, you are to determine both the shortest possible time and the longest possible time that the countdown can run. The<br>commands may be present in any order, but there will always be one and only one START directive; there will be precisely as much whitespace on<br>each line as dictated by the format given above. No two commands in a command file will reference the same minute t.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input to this problem will begin with a line containing a single integer N (1 &#x2264; N &#x2264; 100) indicating the number of data sets. Each data set consists of<br>the following components:<br><br>A line containing a single integer L (1 &#x2264; L &#x2264; 100) indicating the number of lines in the particular &quot;command file&quot;; and<br>A series of L lines representing the command file, in the format described above.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each data set, print &quot;min TO max&quot;, where min is the shortest possible time the countdown can last in minutes, and max is the longest possible<br>time the countdown can last in minutes.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n30 START\n15 HOLD 5\n10 HOLD 5 IF fantasticfour\n3\n75 HOLD 20 IF yellowlightblinks\n150 HOLD 30 IF NOT fueled\n300 START</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">35 TO 40\n300 TO 350</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008%278+%B9%AB%BF%AA%C8%FC%A3%A8%B7%C7%D4%AD%B4%B4%A3%A9&amp;source=1&amp;searchmode=source\"> HDU 2008&apos;8 &#x516C;&#x5F00;&#x8D5B;&#xFF08;&#x975E;&#x539F;&#x521B;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}