{"title":"Bonus Word","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2361","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2361&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2361","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2361"},"statement":[{"title":"Problem Description","content":"Lingo is a once popular game show where the contestants have to guess words. In the original version the contestants would have to guess a five-letter word each round.<br>In between the rounds of regular word guessing, the contestants can win a bonus prize if they can guess a ten-letter word. The ten-letter word is displayed with the letters permuted. Some letters are colored indicating that they are displayed in the right position. Since there are not that many ten-letter words, it happens frequently that the word is actually a compound: a word constructed by concatenating two shorter words. In this problem we<br>assume that the ten-letter word is always of this form.<br>Given a dictionary and a sequence of ten letters, you must calculate the possible solutions to the ten-letter word game. Two solutions are considered different if they are constructed from different parts, even if their concatenation is the same. This is illustrated by the the second sample case.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line an integer t (1 &lt;= t &lt;= 100): the number of test cases. Then for each test case:<br><br>One line with an integer n (1 &lt;= n &lt;= 200): the number of words in the dictionary.<br><br>n lines with a single word in the dictionary. Each word is between 1 and 9 (inclusive) characters long and consists of only lowercase letters.<br><br>One line with an integer q (1 &lt;= q &lt;= 100): the number of queries.<br><br>q lines with a single query string. Each query is exactly 10 characters long and will consist of uppercase and lowercase letters. Lowercase letters are in the right position and uppercase letters may be in the wrong position.<br>All words in the dictionary for a single test case are distinct.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output for each query:<br><br>One line with an integer s: the number of solutions.<br><br>min(1000, s) lines, each a solution formatted as two dictionary words separated by a hyphen (-).<br><br>The solutions to a single query must be ordered lexicographically. If the number of solutions exceeds 1000, then only output the first 1000 solutions.<br><br><br>Notes<br>If s and t are strings of equal length and si denotes the ith character of s, then s precedes t lexicographically if for some i: s<sub>i</sub> &lt; t<sub>i</sub> and s<sub>j</sub> = t<sub>j</sub> for all j &lt; i. In this problem statement, the hyphen precedes all letters lexicographically.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5\ngunner\nintegral\nrelating\ntail\nun\n4\nTAILGUNNER\nunINTEGRAL\nUNrelating\nIMPOSSIBLE\n3\naaaa\naaaaa\naaaaaa\n1\nAAAAAAAAAA</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\ngunner-tail\nintegral-un\nrelating-un\ntail-gunner\nun-integral\nun-relating\n2\nun-integral\nun-relating\n1\nun-relating\n0\n3\naaaa-aaaaaa\naaaaa-aaaaa\naaaaaa-aaaa</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=bapc2007_pre&amp;source=1&amp;searchmode=source\"> bapc2007_pre </a> ","type":"source","format":"html","require":["katex"]}]}