{"title":"Ranking","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2384","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2384&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2384","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2384"},"statement":[{"title":"Problem Description","content":"Hosting a programming contest is fun, but it&apos;s also a lot of work. For instance, at the end of the day the jury will have to create a ranking of the teams based on their results during the contest. This can be tedious to do by hand, so we would like you to write a program for this task. <br><br>For the BAPC, the rules for the ranking are as follows: <br><br>  Teams are ranked according to the most problems solved; teams tied are ordered by increasing total time used. <br><br>  The time used for a problem is the number of minutes between the start of the contest and the first accepted run, plus a 20 minute penalty for each rejected run until the first accepted run. <br><br>  The total time used is the sum of the times used for each problem solved (as described above). Note that penalty time for problems for which no run was accepted does not count toward the total time used. <br><br>  If ties remain at the end of the contest, the point of comparison between tied teams will be the last point in time where their scores differed (e.g. if two teams are tied at the end of the contest, the team which solved their last problem earlier than the other team solved their last problem wins). <br><br>During the contest, teams submit solutions for problems, which are processed by the jury as runs. Each run has four properties: <br><br>the submission time in minutes since the beginning of the contest (an integer between 1 and 300, inclusive); <br><br>the name of the team that submitted the solution (a non-empty string of at most 20 lower-case letters); <br><br>the identifier of the corresponding problem (an upper-case letter A through J, inclusive); <br><br>the result as determined by the judging software (either accepted or rejected). <br><br>At the end of the contest, we have a list of runs available (ordered by non-decreasing submission times) and we want you to determine the final ranking of the teams. <br><br>Teams that are tied will share a position; those teams should be ordered alphabetically in the results.<br>","type":"description","format":"html"},{"title":"Input","content":"On the first line an integer t (1 &lt;= t &lt;= 100): the number of test cases. Then for each test case: <br><br>one line with the number of teams t (1 &lt;= t &lt;= 50) and the number of runs r (0 &lt;= r &lt;= 5 000), seperated by a single space; <br><br>then t lines, each with the name of a team; <br><br>then r lines, each with the description of a run: time, team, problem and result, formatted as described above, and seperated by a single space. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case: <br><br>Print the ordered results: t lines, each with a rank (starting from 1), the team name, the number of correctly solved problems and the total penalty time, separated by single spaces. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n8 28\ntwente\nutrecht\ngroningen\namsterdam\neindhoven\nleiden\ndelft\nnijmegen\n5 utrecht B rejected\n8 eindhoven F accepted\n10 utrecht F accepted\n17 utrecht B rejected\n18 leiden C rejected\n23 twente F rejected\n25 utrecht B accepted\n26 amsterdam D rejected\n27 amsterdam D accepted\n27 leiden C accepted\n27 groningen F accepted\n28 twente F rejected\n30 nijmegen C rejected\n30 nijmegen C accepted\n30 delft B accepted\n30 delft B rejected\n33 twente F accepted\n47 groningen D rejected\n51 leiden D accepted\n51 amsterdam C accepted\n51 groningen D accepted\n60 utrecht D accepted\n65 utrecht J accepted\n67 twente F rejected\n70 twente F accepted\n90 eindhoven D accepted\n100 utrecht A rejected\n101 utrecht C rejected</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 utrecht 4 200\n2 groningen 2 98\n3 amsterdam 2 98\n3 leiden 2 98\n5 eindhoven 2 98\n6 delft 1 30\n7 nijmegen 1 50\n8 twente 1 73</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=bapc2007&amp;source=1&amp;searchmode=source\"> bapc2007 </a> ","type":"source","format":"html"}]}