{"title":"Dart Challenge","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2386","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2386&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2386","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2386"},"statement":[{"title":"Problem Description","content":"Clark and Harry are siblings. As they had been rivals since their early childhood, their father decided that both should concentrate on a different sport when they were thirteen. That way, they would not have to compete for success. Now both are twenty years old and excel in different fields: Clark plays chess while Harry participates in dart-tournaments.<br>Having won a series of three tournaments in a row, Harry started teasing Clark about not having as much success. Clark retorted that chess was less luck-based and thus more difficult. That offended Harry and led him to the reply that in order to play darts optimally, a lot of combinatorics are necessary. Clark returned an icy smile and the comment that memorizing all different late-games could hardly be called &#x201C;combinatorics&#x201D;.<br>This is how it came to the wager. Harry bets that he can find all possible late-games for generalized dart-boards where memorized late-games do not help him. When Clark showed him a list of possible dartboards, Harry had to admit that he probably bit off more than he can chew. As his friend, you have to help him!<br><br>A dart-board consists of different areas. Each area has an assigned score for hitting it. Each area also has a double- and a triple-field that are worth twice and three times the score of the area. The only exception is the area for the highest score: It has only a double- and no triple-field! Given the values of the different areas you have to find the number of possible scores that can be obtained with a given number of darts.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The inputs start with a line containing a single integer n. Each of the n following lines contains one test case. Each test case starts with two integers 1 &lt;= a &lt;= 100; 1 &lt;=  k &lt;= 50, the number of different areas on the<br>dart-board and the number of darts. a integers 1 &lt;=  s<sub>i</sub> &lt;= 100 follow. si is the score for hitting area i. All scores are distinct. Remember that each area has a double- and, with exception of the area with the highest score, a triple-field. It is always possible to score 0 with any given dart by not hitting the board.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The output for every test case begins with a line containing &#x201C;Scenario #i:&#x201D;, where i is the number of the scenario counting from 1. After that, output a single line containing the number of different scores that can be obtained with k darts on the given board. Terminate each test case with an empty line.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n21 3 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 25\n2 2 20 10\n1 50 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Scenario #1:\n172\n\nScenario #2:\n9\n\nScenario #3:\n101</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008-10+Public+Contest&amp;source=1&amp;searchmode=source\"> HDU 2008-10 Public Contest </a> ","type":"source","format":"html","require":["katex"]}]}