{"title":"Online Shopping","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2387","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2387&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2387","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2387"},"statement":[{"title":"Problem Description","content":"The Internet becomes more and more important for our daily life. Aside from information retrieval, many people use the web for comfortable shopping from their home PCs. As the number of online customers grows, so does the number of websites dedicated to comparing online prices. Competitive sites need to quickly visualize the cheapest offers for a certain product. Barter &amp; Haggle Inc. has recently been successful in the field of comparing online prices. However, as more and more comparable services appear, B&amp;H has trouble conserving their market share. This is why the company has decided to improve its technology by comparing prices for different online shops and products simultaneously. The engineers have not been capable of implementing the visualization algorithm, though. This is where you come into play.<br><br>Given a table of prices for different products at different online stores, you need to find an optimal reordering of the rows and columns. In order to compare different reorderings, we define the table string to be the string of cells that is obtained from a table by appending all columns. An optimal reordering has the smallest table string with respect to lexicographical comparison (the table string is compared cell-wise).<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C151-1002-1.jpg\"></center><br>","type":"description","format":"html"},{"title":"Input","content":"The inputs start with a line containing a single integer n. Each of the n following lines contains one test case. Each test case starts with two integers 1 &lt;= a, b &lt;= 5, the number of products and online shops respectively.<br>The table string consisting of the prices separated by single spaces follows. Each price p is given as an integer amount of cents with 0 &lt;= p &lt;= 10<sup>9</sup>.<br>","type":"input_format","format":"html"},{"title":"Output","content":"The output for every test case begins with a line containing &#x201C;Scenario #i:&#x201D;, where i is the number of the test case counting from 1. Then, output a single line containing the table string of the optimal reordering of products and shops. Terminate each test case with an empty line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 2 3999 5000 4000 4000 12999 9999\n4 3 120 120 110 120 80 75 250 50 200 55 80 80</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Scenario #1:\n3999 5000 4000 4000 12999 9999\n\nScenario #2:\n50 200 250 80 75 120 80 80 55 120 110 120</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008-10+Public+Contest&amp;source=1&amp;searchmode=source\"> HDU 2008-10 Public Contest </a> ","type":"source","format":"html"}]}