{"title":"Rain on your Parade","time_limit":3000,"memory_limit":161.6552734375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2389","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2389&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2389","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2389"},"statement":[{"title":"Problem Description","content":"You&#xFFFD;&#xFFFD;re giving a party in the garden of your villa by the sea. The party is a huge success, and everyone is here. It&#xFFFD;&#xFFFD;s a warm, sunny evening, and a soothing wind sends fresh, salty air from the sea. The evening is progressing just as you had imagined. It could be the perfect end of a beautiful day.<br>But nothing ever is perfect. One of your guests works in weather forecasting. He suddenly yells, &#xFFFD;&#xFFFD;I know that breeze! It means its going to rain heavily in just a few minutes!&#xFFFD;&#xFFFD; Your guests all wear their best dresses and really would not like to get wet, hence they stand terrified when hearing the bad news.<br>You have prepared a few umbrellas which can protect a few of your guests. The umbrellas are small, and since your guests are all slightly snobbish, no guest will share an umbrella with other guests. The umbrellas are spread across your (gigantic) garden, just like your guests. To complicate matters even more, some of your guests can&#xFFFD;&#xFFFD;t run as fast as the others.<br>Can you help your guests so that as many as possible find an umbrella before it starts to pour? <br><br>Given the positions and speeds of all your guests, the positions of the umbrellas, and the time until it starts to rain, find out how many of your guests can at most reach an umbrella. Two guests do not want to share an umbrella, however. <br>","type":"description","format":"html"},{"title":"Input","content":"The input starts with a line containing a single integer, the number of test cases.<br>Each test case starts with a line containing the time t in minutes until it will start to rain (1 &lt;=t &lt;= 5). The next line contains the number of guests m (1 &lt;= m &lt;= 3000), followed by m lines containing x- and y-coordinates as well as the speed si in units per minute (1 &lt;= s<sub>i</sub> &lt;= 3000) of the guest as integers,  separated by spaces. After the guests, a single line contains n (1 &lt;= n &lt;= 3000), the number of umbrellas, followed by n lines containing the integer coordinates of each umbrella, separated by a space.<br>The absolute value of all coordinates is less than 10000.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, write a line containing &#xFFFD;&#xFFFD;Scenario #i:&#xFFFD;&#xFFFD;, where i is the number of the test case starting at 1. Then, write a single line that contains the number of guests that can at most reach an umbrella before it starts to rain. Terminate every test case with a blank line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n2\n1 0 3\n3 0 3\n2\n4 0\n6 0\n1\n2\n1 1 2\n3 3 2\n2\n2 2\n4 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Scenario #1:\n2\n\nScenario #2:\n2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008-10+Public+Contest&amp;source=1&amp;searchmode=source\"> HDU 2008-10 Public Contest </a> ","type":"source","format":"html"}]}