{"title":"Olympic Games","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2390","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2390&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2390","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2390"},"statement":[{"title":"Problem Description","content":"Mike loves the olympic games. What he hates about olympic games &#x2013; besides them taking place only once every four years &#x2013; is that the individual events are scheduled concurrently. That way it is never possible to watch all competitions live. Mike always tries to plan his personal schedule in order to maximize the number of events he can attend to. However, at the end he is never sure whether or not his schedule actually is optimal. Help him!<br><br>Given the days and times on which events take place, determine the maximum number of events Mike can watch. Mike never leaves during an event, so it is not possible to partially attend to events.<br>","type":"description","format":"html"},{"title":"Input","content":"The input starts with a line containing a single integer n, the number of test cases.<br>Each test case starts with a line containing an integer 1 &lt;= m &lt;= 50000 that specifies the number of different events. The next m lines describe one event with three integers d, s, e. The event takes place on day d of the olympics, it starts at s and it ends at e, where the times are given in the form hhmm. All events are assumed to conclude the same day they started.<br>","type":"input_format","format":"html"},{"title":"Output","content":"The output for every test case begins with a line containing &#x201C;Scenario #i:&#x201D;, where i is the number of the test case counting from 1. Then, output a single line containing the number of events Mike can attend to at most. The time for getting from one event to another can be neglected. Events starting at time t can be scheduled after events ending at t as long as there are no other conflicts. Terminate each test case with an empty line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n10\n1 1220 1340\n2 1155 1220\n2 1220 1340\n3 1220 1240\n1 1200 1320\n2 1250 1310\n2 1330 1550\n3 1030 1130\n3 1130 1300\n3 1240 1330\n3\n1 0500 2200\n1 0000 0700\n1 2000 2359</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Scenario #1:\n7\n\nScenario #2:\n2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008-10+Public+Contest&amp;source=1&amp;searchmode=source\"> HDU 2008-10 Public Contest </a> ","type":"source","format":"html"}]}