{"title":"Robotic Invasion","time_limit":4000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2392","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2392&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2392","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2392"},"statement":[{"title":"Problem Description","content":"The pacifistic people of planet Pax are at war with the evil guys from planet Googol. Although they are strictly pacifistic they have means of defense. Their cryptographers are able to routinely decrypt the commands sent to Googol&#x2019;s robots and they can &#x2013; using huge amounts of energy &#x2013; construct bogus commands. It is the job of the Tactical Unit Defense (TUD) to find the best way to interfere with the command transmission from Googol.<br><br>You are given a string of movements (each being a step to the north, east, south or west) and a map containing an invading robot from Googol and, possibly, several obstacles and traps.<br>Your task is to find a way to overcome the threat by changing as few movements as possible and guiding the robot into a trap. A single change replaces a step by another direction or no movement at all.<br>A robot will move in the given direction if the position is not blocked or outside the given map. If given such a direction, the robot does not move instead.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains the number of scenarios. For each scenario a line containing two integers 1 &lt;= w; h &lt;= 100 separated by a single space is given, followed by h lines each containing w characters. This is a map of the area.<br>Exactly one character is a R which is the starting position of the invading robot. Other characters are &#x2018;.&#x2019; to denote free positions, X to denote blocked positions and + to denote traps.<br>This is followed by a line containing an integer 0 &lt;= c &lt;= 100 and another line containing c characters of communication. Each character is either N, E, S or W to denote a command to move one position up, right, down or left, respectively.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The output for every scenario begins with a line containing &#x201C;Scenario #i:&#x201D;, where i is the number of the scenario starting at 1.<br>Then print on a single line the string of movements (denoted by characters N, E, S, W and, for no movement, X) that leads into a trap, of those the one that changes as few characters as possible, of those the one that leads into a trap as early as possible, of those the lexicographically first. This string must have c characters.<br>If no such string exists, output &#x201C;impossible&#x201D; on a single line. Terminate the output for the scenario with a blank line.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3 2\nR+.\n...\n3\nEEE\n3 3\nR..\n.X+\n...\n3\nSSE\n3 3\nR..\n..+\n...\n3\nSSE</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Scenario #1:\nEEE\n\nScenario #2:\nEES\n\nScenario #3:\nESE</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2008-10+Public+Contest&amp;source=1&amp;searchmode=source\"> HDU 2008-10 Public Contest </a> ","type":"source","format":"html","require":["katex"]}]}