{"title":"Human Knot","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2403","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2403&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2403","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2403"},"statement":[{"title":"Problem Description","content":"A classic ice-breaking exercise is for a group of n people to form a circle and then arbitrarily join hands with one another. This forms a &quot;human knot&quot; since the players&apos; arms are most likely intertwined. The goal is then to unwind the knot to form a circle of players with no arms crossed. <br><br>We now adapt this game to a more general and more abstract setting where the physical constraints of the problem are gone. Suppose we represent the initial knot with a 2-regular graph inscribed in a circle (i.e., we have a graph with n vertices with exactly two edges incident on each vertex). Initially, some edges may cross other edges and this is undesirable. This is the &quot;knot&quot; we wish to unwind. <br><br>A &quot;move&quot; involves moving any vertex to a new position on the circle, keeping its edges intact. Our goal is to make the fewest possible moves such that we obtain one n-sided polygon with no edge-crossings remaining. <br><br>For example, here is a knot on 4 vertices inscribed in a circle, but two edges cross each other. By moving vertex 4 down to the position between 2 and 3, a graph without edge-crossings emerges. This was achieved in a single move, which is clearly optimal in this case. <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C137-1004-1.jpg\"></center><br>When n is larger, things may not be quite as clear. Below we see a knot on 6 vertices. We might consider moving vertex 4 between 5 and 6, then vertex 5 between 1 and 2, and finally vertex 6 between 3 and 4; this unwinds the knot in 3 moves.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C137-1004-2.jpg\"></center><br>But clearly we can unwind the same knot in only two moves: <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C137-1004-3.jpg\"></center><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of a number of cases. Each case starts with a line containing the integer n (3 &lt;= n &lt;= 500), giving the number of vertices of the graph. The vertices are labelled clockwise from 1 to n. Each of the next n lines gives a pair of neighbors, where line i (1 &lt;= i &lt;= n) specifies the two vertices adjacent to vertex i. The input is terminated by n = 0. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, if there is no solution, print &quot;Not solvable.&quot; on a line by itself. If there is a solution, print &quot;Knot solvable.&quot; on a line by itself, followed by the minimum number of moves required to solve the problem, on a line by itself. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n4 5\n3 5\n2 6\n1 6\n1 2\n3 4\n6\n2 6\n1 4\n5 6\n2 5\n3 4\n1 3\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Knot solvable.\n2\nKnot solvable.\n1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%2FICPC+2008+Warmup%A3%A82%A3%A9%A1%AA%A1%AA%B2%E2%CA%D4%D5%CA%BA%C5%A3%A8%BA%BC%D6%DD%A3%A9&amp;source=1&amp;searchmode=source\"> ACM/ICPC 2008 Warmup&#xFF08;2&#xFF09;&#x2014;&#x2014;&#x6D4B;&#x8BD5;&#x5E10;&#x53F7;&#xFF08;&#x676D;&#x5DDE;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}