{"title":"Marbles in Three Baskets","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2405","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2405&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2405","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2405"},"statement":[{"title":"Problem Description","content":"Each of three baskets contains a certain number of marbles. You may move from one basket into another basket as many marbles as are already there, thus doubling the quantity in the basket that received the marbles. You must find a sequence of moves that will yield the same number of marbles in the three baskets. Moreover, you must achieve the goal in the smallest possible number of moves. Your program must also recognize the case in which there is no such sequence of moves. <br><br>","type":"description","format":"html"},{"title":"Input","content":"Each line of the input file will contain data for one instance of the problem: three positive integers, with one blank space separating adjacent integers. The three integers represent the initial numbers of marbles in the three baskets. The sum of the three integers will be at most 60. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"The output will begin with the initial configuration from the input. Thereafter, on successive lines, the number of marbles in the respective baskets will be printed after each move, concluding with the line in which the three numbers are identical. As stated above, the goal must be achieved in the smallest possible number of moves. (The correct output is not unique, however. There may be different sequences of moves which achieve the goal correctly in the smallest possible number of steps.) If there is no sequence of moves to achieve the goal, only the initial configuration will be printed. Each integer in the output will be right-justified in a field of width 4. Each instance of the problem will be concluded by a line of 12 equal signs. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 7 11\n15 18 3\n5 6 7</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">   6   7  11\n   6  14   4\n  12   8   4\n   8   8   8\n============\n  15  18   3\n  12  18   6\n  12  12  12\n============\n   5   6   7\n============</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=ACM%2FICPC+2008+Warmup%A3%A82%A3%A9%A1%AA%A1%AA%B2%E2%CA%D4%D5%CA%BA%C5%A3%A8%BA%BC%D6%DD%A3%A9&amp;source=1&amp;searchmode=source\"> ACM/ICPC 2008 Warmup&#xFF08;2&#xFF09;&#x2014;&#x2014;&#x6D4B;&#x8BD5;&#x5E10;&#x53F7;&#xFF08;&#x676D;&#x5DDE;&#xFF09; </a> ","type":"source","format":"html"}]}