{"title":"Chessboard Dance","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2414","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2414&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2414","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2414"},"statement":[{"title":"Problem Description","content":"Another boring Friday afternoon, Betty the Beetle thinks how to amuse herself. She goes out of her hiding place to take a walk around the living room in Bennett&apos;s house. Mr. and Mrs. Bennett are out to the theatre and there is a chessboard on the table! &quot;The best time to practice my chessboard dance,&quot; Betty thinks! She gets so excited that she does not note that there are some pieces left on the board and starts the practice session! She has a script showing her how to move on the chessboard. The script is a sequence like the following example:<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C152-1006-1.jpg\"></center><br>At each instant of time Betty, stands on a square of the chessboard, facing one of the four directions (up, down, left, right) when the board is viewed from the above. Performing a &quot;move n&quot; instruction, she moves n squares forward in her current direction. If moving n squares goes outside the board, she stays at the last square on the board and does not go out. There are three types of turns: turn right, turn left, and turn back, which change the direction of Betty. Note that turning does not change the position of Betty.<br><br>If Betty faces a chess piece when moving, she pushes that piece, together with all other pieces behind (a tough beetle she is!). This may cause some pieces fall of the edge of the chessboard, but she doesn&apos;t care! For example, in the following figure, the left board shows the initial state and the right board shows the state after performing the script in the above example. Upper-case and lower-case letters indicate the white and black pieces respectively. The arrow shows the position of Betty along with her direction. Note that during the first move, the black king (r) falls off the right edge of the board!<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C152-1006-2.jpg\"></center><br>You are to write a program that reads the initial state of the board as well as the practice dance script, and writes the final state of the board after the practice.<br><br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases in the input. Each test case has two parts: the initial state of the board and the script. The board comes in eight lines of eight characters. The letters r, d, t, a, c, p indicate black pieces, R, D, T, A, C, P indicate the white pieces and the period (dot) character indicates an empty square. The square from which Betty starts dancing is specified by one of the four characters &lt;, &gt;, ^, and v which also indicates her initial direction (left, right, up, and down respectively). Note that the input is not necessarily a valid chess game status.<br><br>The script comes immediately after the board. It consists of several lines (between 0 and 1000). In each line, there is one instruction in one of the following formats (n is a non-negative integer number):<br><br>move n<br>turn left<br>turn right<br>turn back<br><br>At the end of each test case, there is a line containing a single # character. The last line of the input contains two dash characters.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"The output for each test case should show the state of the board in the same format as the input. Write an empty line in the output after each board.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">.....c..\n.p..A..t\nD..&gt;T.Pr\n....aP.P\np.d.C...\n.....p.R\n........\n........\nmove 2\nturn right\nmove 3\nturn left\nturn left\nmove 1\n#\n--</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">.....c..\n.p..A..t\nD.....TP\n....a..P\np.d.C^..\n.......R\n.....P..\n.....p..</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Tehran&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Tehran </a> ","type":"source","format":"html"}]}