{"title":"Shell Pyramid","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2446","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2446&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2446","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2446"},"statement":[{"title":"Problem Description","content":"In the 17th century, with thunderous noise, dense smoke and blazing fire, battles on the sea were just the same as those in the modern times. But at that time, the cannon ,were extremely simple. It was just like an iron cylinder, with its rearward end sealed and forward end open. There was a small hole at the rearward end of it, which was used to install the fuse. The cannons on the warships were put on small vehicles which had four wheels and the shells were iron spheres with gunpowder in them.<br><br>At that time, it was said that there was an intelligent captain, who was also a mathematician amateur. He liked to connect everything him met to mathematics. Before every battle, he often ordered the soldiers to put the shells on the deck and make those shells to form shell pyramids.<br><br>Now let&apos;s suppose that a shell pyramid has four layers, and there will be a sequence of ordinal numbers in every layer. They are as the following figure:<br><br>                         <img style=\"max-width:100%;\" src=\"../../../data/images/2446-1.jpg\"><br><br>In the figure, they are the first layer, the second layer, the third layer and the fourth layer respectively from the left to the right.<br><br>In the first layer, there is just 1 shell, and its ordinal number is 1. In the second layer, there are 3 shells, and their ordinal numbers are 1, 2, and 3. In the third layer, there are 6 shells, and their ordinal numbers are 1, 2, 3, 4, 5, and 6. In the fourth layer, there are 10 shells, and their ordinal numbers are shown in the figure above.<br><br>There are also serial numbers for the whole shell pyramid. For example, the serial number for the third shell in the second layer is 4, the serial number for the fifth shell in the third layer is 9, and the serial number for the ninth shell in the fourth layer is 19.<br><br>There is also a interrelated problem: If given one serial number s, then we can work out the s th shell is in what layer, what row and what column. Assume that the layer number is i, the row number is j and the column number is k, therefore, if s=19, then i=4, j=4 and k=3.<br><br>Now let us continue to tell about the story about the captain.<br>A battle was going to begin. The captain allotted the same amount of shells to every cannon. The shells were piled on the deck which formed the same shell pyramids by the cannon. While the enemy warships were near, the captain ordered to fire simultaneously. Thunderous sound then was heard. The captain listened carefully, then he knew that how many shells were used and how many were left. <br><br>At the end of the battle, the captain won. During the break, he asked his subordinate a question: For a shell pyramid, if given the serial number s, how do you calculate the layer number i, the row number j and column number k? <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"First input a number n,repersent n cases.For each case there a shell pyramid which is big enough, a integer is given, and this integer is the serial number s&#xFF08;s&lt;2^63&#xFF09;. There are several test cases. Input is terminated by the end of file.<br> ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output the corresponding layer number i, row number j and column number k.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n19\n75822050528572544</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 4 3\n769099 111570 11179</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Harbin&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Harbin </a> ","type":"source","format":"html","require":["katex"]}]}