{"title":"Navy maneuvers","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2452","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2452&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2452","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2452"},"statement":[{"title":"Problem Description","content":"In times of peace, various countries have held regular maneuvers to maintain military&#xFFFD;&#xFFFD;s vigilance. There is a navy fleet in a certain country which also starts a new round imaginary naval battle.<br><br>At the maneuver stage, the admiral intends to assess the combat effectiveness of two warships, &#xFFFD;&#xFFFD;Victory&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;Glory&#xFFFD;&#xFFFD;, so he lets two warships carry out countering exercises. Both of the warship commanders are young and promising, who graduated from naval academy as outstanding students. Not only have they had rich navigation direction experiences, but also have profound scientific knowledge, especially in mathematics. <br><br>The admiral appoints one marine area dotted with many islets. Suppose all these islets are occupied by the enemy, and there are positive integers of enemy firebases. The hypothetical exercise situations given by the admiral and the rule of the competition are as follows:<br><br>(1) All the occupied islets are connected. There are some routes among these islets, but the route from one islet to another islet is unidirectional. In other words, if we take an islet as a node and an islet route as an edge, then we will get a directed non-cyclic connected graph.<br>(2) There is a unique 1st islet in the graph. If we start from this islet, we can reach any other islet. &#xFFFD;&#xFFFD;maybe the 1st islet is not the islet which is numbered 1&#xFFFD;&#xFFFD;<br>(3) At the beginning of the maneuver, two warships simultaneously sail to the 1st islets and eliminate all enemy firebases together.  <br>(4) The two warships, &#xFFFD;&#xFFFD;Victory&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;Glory&#xFFFD;&#xFFFD; take turns to navigate and exchange as soon as they arrive at an islet, then they move forward together. But each time they can only go along the unidirectional route, sail to the islet directly connected to the current, and eliminates all the enemy firebases on the islet. By the way, when start from 1st islet, &#xFFFD;&#xFFFD;Victory&#xFFFD;&#xFFFD; first navigates.<br>(5) Because each route is unidirectional, and graph is non-cycle, therefore the maneuver terminates when the two warships fail to go on navigating.<br>(6)When the maneuver ends, sum the numbers of eliminated enemy firebases on the routing path. If the number is greater than or equal to certain number f assigned by the admiral, then &#xFFFD;&#xFFFD;Victory&#xFFFD;&#xFFFD; wins. Otherwise, &#xFFFD;&#xFFFD;Glory&#xFFFD;&#xFFFD; wins.<br><br>The warship commanders are both mathematicians. After being assigned to such task, they see it is a Graph Theory problem. On the first simple directed non-cyclic connected graph, each node has a certain positive integer,it indicates the enemy firebases. The assignment is that two captains take turn to move forward along the directed edge until they are unable to do so. Then sum the total positive integers of the nodes on the routing path. Compare the number with the certain number f, and decides the final winning or losses.<br><br>Therefore, when it is the time for their own navigation, they are supposed to choose the route to win the final success.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases, in each case there are three positive integers n, m and f in first line. n indicates there are n (1&lt; n &lt;10000 ) nodes in the graph. The node serial number is arranged from 1 to n. m indicates that there are m edges in the graph. The following line has n positive integers, which indicate in sequence the positive integers in the nodes. Finally, there are m lines, and each line has two positive integers a, b (1&lt; = a, b&lt; =n), indicating there is a directed edge from the a node to the b node. Input is terminated by the end of file.","type":"input_format","format":"html"},{"title":"Output","content":"To each group of the test case, if &#xFFFD;&#xFFFD;Victory&#xFFFD;&#xFFFD; wins, then output &#xFFFD;&#xFFFD;Victory&#xFFFD;&#xFFFD;. Otherwise, output &#xFFFD;&#xFFFD;Glory&#xFFFD;&#xFFFD;. The output each case takes up one line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 4 7\n2 2 2 2\n4 2\n2 1\n4 3\n3 1\n4 5 6\n1 2 3 4\n1 2\n1 3\n1 4\n2 3\n4 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Glory\nVictory\n </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Harbin&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Harbin </a> ","type":"source","format":"html"}]}