{"title":"Degree Sequence of Graph G","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2454","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2454&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2454","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2454"},"statement":[{"title":"Problem Description","content":"Wang Haiyang is a strong and optimistic Chinese youngster. Although born and brought up in the northern inland city Harbin, he has deep love and yearns for the boundless oceans. After graduation, he came to a coastal city and got a job in a marine transportation company. There, he held a position as a navigator in a freighter and began his new life.<br><br>The cargo vessel, Wang Haiyang worked on, sails among 6 ports between which exist 9 routes. At the first sight of his navigation chart, the 6 ports and 9 routes on it reminded him of Graph Theory that he studied in class at university. In the way that Leonhard Euler solved The Seven Bridges of Knoigsberg, Wang Haiyang regarded the navigation chart as a graph of Graph Theory. He considered the 6 ports as 6 nodes and 9 routes as 9 edges of the graph. The graph is illustrated as below.<br><br>                      <img style=\"max-width:100%;\" src=\"../../../data/images/2454-1.jpg\"> <br><br>According to Graph Theory, the number of edges related to a node is defined as Degree number of this node.<br><br>Wang Haiyang looked at the graph and thought, If arranged, the Degree numbers of all nodes of graph G can form such a sequence: 4, 4, 3,3,2,2, which is called the degree sequence of the graph. Of course, the degree sequence of any simple graph (according to Graph Theory, a graph without any parallel edge or ring is a simple graph) is a non-negative integer sequence?<br><br>Wang Haiyang is a thoughtful person and tends to think deeply over any scientific problem that grabs his interest. So as usual, he also gave this problem further thought, As we know, any a simple graph always corresponds with a non-negative integer sequence. But whether a non-negative integer sequence always corresponds with the degree sequence of a simple graph? That is, if given a non-negative integer sequence, are we sure that we can draw a simple graph according to it.?<br><br>Let&apos;s put forward such a definition: provided that a non-negative integer sequence is the degree sequence of a graph without any parallel edge or  ring, that is, a simple graph, the sequence is draw-possible,  otherwise, non-draw-possible. Now the problem faced with Wang Haiyang is how to test whether a non-negative integer sequence is draw-possible or not. Since Wang Haiyang hasn&apos;t studied Algorithm Design course, it is difficult for him to solve such a problem. Can you help him?<br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains an integer T, indicates the number of test cases. In each case, there are n+1 numbers; first is an integer n (n&lt;1000), which indicates there are n integers in the sequence; then follow n integers, which indicate the numbers of the degree sequence.<br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, the answer should be &quot;yes&quot;or &quot;no&quot; indicating this case is &quot;draw-possible&quot; or &quot;non-draw-possible&quot;<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6 4 4 3 3 2 2\n4 2 1 1 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">yes\nno</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Harbin&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Harbin </a> ","type":"source","format":"html","require":["katex"]}]}