{"title":"Dividing Sea Area to Navigation-Triangle","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2455","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2455&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2455","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2455"},"statement":[{"title":"Problem Description","content":"When a vessel sails on the vast and boundless sea, the captain must know his position in any time.  There is a technique called triangle-navigation can solves this problem.<br><br>Suppose there are three islands in some sea area. They form a large triangle. There is a radio navigation station respectively on each island. The navigation station sends out radio signals continuously. After the vessel receives the signals, its position can be known by calculating those three different signals. <br><br>There is a raised n-multilateral sea area which is formed by n islands. Each island has a radio navigation station. The n islands form a raised n-multilateral graph. Every three islands form a triangle division area. Vessels sailing in this triangle area should determine the position by the signals from those three radio navigation stations in the three islands. <br><br>Of course, all navigation triangles divided from the raised n-multilateral graph can not overlap one another. Consequently, this raised n-multilateral graph is divided into n-2 triangles areas.<br><br>                  <img style=\"max-width:100%;\" src=\"../../../data/images/2455-1.jpg\"><br><br>By the way, there are some smaller islets in the raised n-multilateral sea area and there is no navigation station in any islet. These small islets are related with our problem, we will explain it later.<br><br>An experienced captain had navigated in this sea area for several years. However, he found it is improper to divide the sea area to n-2 navigation triangles as the current scheme. After deep thinking, he put forward a new method.<br><br>Of course, he still divided raised n-multilateral graph sea area into n-2 navigation triangles which are not overlapped one another. The three vertexes of the triangles are three islands with navigation station. According to the scheme which is put forward by the old captain, a weight value is necessary for each triangle sea division area. Calculating formula of the weight value is as follows:<br>V= S+2*a +b<br><br>In that formula, the letter &#xFFFD;&#xFFFD;V&#xFFFD;&#xFFFD; expresses the weight value of the triangle sea area, the letter &#xFFFD;&#xFFFD;S&#xFFFD;&#xFFFD; expresses the area of that triangle sea, The letter &#xFFFD;&#xFFFD;a&#xFFFD;&#xFFFD; expresses the number of smaller islets inside the triangle. The letter &#xFFFD;&#xFFFD;b&#xFFFD;&#xFFFD; expresses the number of those small islets on the common edge between the two triangle sea areas. After calculating according to the formula above, each triangle sea area division has a weight value. The old captain thought, for the n-2 triangle areas, there will be n-2 weight values. Among these weight values, when the difference of the maximum weight value and the minimum weight value reaches a minimum, this scheme of division is optimum. That scheme will benefit sailing most.<br>As none people can solve that problem on the vessel. Now the captain is visiting you, he hopes you can help him.<br><br>","type":"description","format":"html"},{"title":"Input","content":"Two positive integers n (3&lt;=n &lt;=100) and m (0 &lt;=m&lt;=20) are provided firstly in each test case. They take up one line respectively, then n lines of data follow, there are 2 floating numbers in each line expressing coordinates of radio navigation station, then following m lines, there are 2 floating numbers in every line expressing coordinates of smaller islets which are not equipped with radio navigation station. Input is terminated by end of file.","type":"input_format","format":"html"},{"title":"Output","content":"For each case, when the difference of weight value between the maximum weight value and minimum weight value is minimum, output this difference, the result should be a floating-point-number, having 2 digits after radix point.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2\n0 0\n1 0 \n1 1 \n0 1\n0.2 0.2\n0.5 0.9\n4 10\n0 0\n1 0 \n1 1\n0 1\n0.5 0.1\n0.5 0.2\n0.5 0.3\n0.5 0.4\n0.5 0.5\n0.5 0.6\n0.5 0.7\n0.5 0.8\n0.5 0.9\n0.2 0.1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.00\n2.00</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Harbin&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Harbin </a> ","type":"source","format":"html"}]}