{"title":"Cryptography Reloaded","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2466","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2466&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2466","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2466"},"statement":[{"title":"Problem Description","content":"What do researchers working at ICPC (Institute for Cryptographic Programming and Computing) do for fun? Well, as you probably have expected, in addition to solving algorithm-related problems on online judges, they also like to toy with various cryptographic schemes. Recently one of the researchers, Tom, has become interested in RSA algorithm implementations used in handheld devices.<br>Note that the description of the general RSA algorithm is as follows:<br>1) Choose two distinct prime numbers p and q, and let n = pq;<br>2) Choose an integer e such that gcd(e , (p-1)(q-1)) = 1;<br>3) Compute the integer d that satisfies the congruence relation<br>.<br>de &#xFFFD;&#xFFFD; 1 (mod (p-1)(q-1))<br>Then, if person A wants to give person B a way to send an encrypted message to him, A can follow the above steps and release (n, e) as his public key. Upon receiving A&#xFFFD;&#xFFFD;s public key, B can simply encrypt message x (0 &#xFFFD;&#xFFFD; x &lt; n) by computing y &#xFFFD;&#xFFFD; x<sup>e</sup> mod n . This would result in a message which ideally only A could decrypt with his private key d:  x &#xFFFD;&#xFFFD; y<sup>d</sup> mod n .<br>As the computation power of handheld devices is usually limited, a relatively<br>small e is usually used to encrypt data. However this can lead to great security risks.<br>For example, it is quite simple to recover p and q (i.e., factor n) when you have both the public key (n, e) and the private key d. Could you help Tom write a program to demonstrate this?","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases in the input file.<br>Each test case contains three integers, n, d, and e (n &#xFFFD;&#xFFFD; 10<sup>100</sup> , 3 &#xFFFD;&#xFFFD; e &#xFFFD;&#xFFFD; 31 ). All three integers are given without any preceding zeros. It is guaranteed that all numbers satisfy the condition as given in the problem statement.<br>Two successive test cases are separated by a blank line. A case with n = 0, d = 0 and e = 0 indicates the end of the input file, and should not be processed by your program.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, please print two prime numbers, p and q, such that n = pq and p &lt; q, in the format as illustrated below.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">55 27 3\n290203 168101 5\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 5 11\nCase #2: 29 10007</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Hangzhou&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Hangzhou </a> ","type":"source","format":"html"}]}