{"title":"Crop circles","time_limit":6000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2477","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2477&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2477","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2477"},"statement":[{"title":"Problem Description","content":"Is there really a monster living in Loch Ness? <br>Did the lost city of Atlantis ever exist? <br>Are UFOs tricks of the light, or actually vehicles from outer space? <br>Who is responsible for the strange patterns called crop circles&#x2014;&#x2014;clever hoaxers or alien beings? <br><br>As we can see, there are so many mysterious places, creatures and events in the world which puzzled people for centuries. In this problem, we won&#x2019;t go through all that puzzles. Which we are interested in is this one -- crop circles.<br><img style=\"max-width:100%;\" src=\"../../data/images/C165-1004-1.jpg\"><br>You have probably seen pictures of crop circles. (i.e. see above) They are circular patterns which mysteriously appear in fields of crop, such as wheat and barley. For research, we model these patterns as N circles in the plane and number them with 1, 2, &#x2026;, N. Each of them has its center (Xi, Yi), radius Ri and an importance value Vi which is evaluated by the scientists.<br><br>After our observation, we found that there aren&#x2019;t any two circles touch each other in the crop circles. But it&#x2019;s possible that a circle is completely within another one. When we are in a certain circle, we should pass through its borderline once in order to get out from it. <br><br>For two distinct circles A and B, if one can go to B from A without passing through more than K borderlines, we say that A and B are connected. Here comes the problem: For all connected cycle pairs (A, B), what&#x2019;s the maximum difference of the importance value between them? The difference of the importance value between A and B can be defined as |VA &#x2013; VB|.<br>For example, look at the picture below. For K = 3, the optimal solution is to select the circle 1 and 3 which make the difference of importance value 220. And there are 3 borderlines between circle 1 and 3.<br>|V5 &#x2013; V1| = 300, which is larger than 220, but circle 5 and circle 1 are not connected. There&#x2019;re 4 borderlines between them, so we won&#x2019;t consider these kinds of pairs.<br><img style=\"max-width:100%;\" src=\"../../data/images/C165-1004-2.jpg\">","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input gives the number of cases T &lt;= 20. T test cases follow.<br>&#xA0;&#xA0;&#xA0;&#xA0;The first line of each case contains two integers N, K as described above. (1 &lt; N &lt; 50001, 1 &lt; K &lt; 101).<br>Next follow N lines, each contains four integers Xi, Yi, Ri, Vi, separated by spaces. The i-th line specifying the information of the i-th circle, where (Xi, Yi) are the coordinates of the center, Ri specifies the radius and Vi is the importance value. <br>(0 &lt; Ri &lt;= 2 * 10^8, -10^9 &lt; Xi, Yi, Vi &lt; 10^9)<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case you should output a single line containing &quot;Case X: Y&quot; (quotes for clarity) where X is the number of the test case (starting at 1) and Y is the maximum difference of importance value between two connected circles.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5 3\n10 10 1 -200\n0 0 8 10\n-2 2 2 20\n3 -3 3 2\n3 -3 1 100\n3 2\n-200 0 1 0\n0 0 100 2\n200 0 1 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 220\nCase 2: 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Chengdu&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Chengdu </a> ","type":"source","format":"html","require":["katex"]}]}