{"title":"Kingdoms","time_limit":8000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2479","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2479&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2479","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2479"},"statement":[{"title":"Problem Description","content":"The former king of Gridland -- CR -- has just passed away, leaving his K sons that all desire the throne. Then the war of succession breaks out and the K-King era begins.<br>Gridland is a rectangle of N*M, with each grid unit as a city. Each city supports one and only one of the K kings as its leader. Cities supporting the same king will always endeavor to establish a kingdom through fighting the rival, and they will not stop until they establish a kingdom satisfying the following rules:<br>1. The kingdom is a rectangle on the map.<br>2. Every city on the Gridland supporting that king should be inside the kingdom.<br>Sadly, through the process of establishing a kingdom, once the opposite cities find that an overlapping of domain is unavoidable, they will inevitably engage in a conflict.<br>Sometimes for a temporary benefit a bunch of kings may ally into a party.  It is certain that one king can only take part in one party at one time, and the cities following a king will correspondingly support the party he joins.<br>Rather than fighting each other fiercely, cities supporting the same party cooperate and strive to establish a kingdom of the whole party.<br>Such kingdoms follow the similar rules:<br>1. The kingdom is a rectangle on the map.<br>2. Every city on the Gridland supporting that party should be inside the kingdom.<br>And the fighting trigger with other kingdoms is exactly the same as the above one.<br>A established kingdom is called stable if and only if:<br>1. No city in the kingdom has to fight with another kingdom..<br>2. If the kingdom stands for a party, the party must never have more than R kings.<br>Now, your job is to find the largest possible stable kingdom. By &apos;largest&apos; we mean the one with the largest number of cities.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input contains multiple cases. Each case consists of:<br>Line 1:Two integers : N and M  (1&lt;= N, M &lt;=1000)<br>Line 2:Two integers : K and R  (1&lt;=K&lt;=1000)<br>Line 3..N+2: M integers each line. the jth integer on the i+2th line will be between 1 and k, indicating which king that city supports.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output one line containing an integer that is the area of the largest possible stable kingdom.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n5 3\n4 1 1\n2 3 1\n2 2 5\n10 10\n13 5\n1 1 1 4 4 4 4 4 3 11\n1 1 1 4 4 4 4 4 11 3\n1 1 1 2 2 2 2 2 3 3\n1 1 1 2 2 2 2 2 3 11\n1 1 1 2 2 2 2 2 11 11\n1 1 1 2 2 2 2 2 3 11\n1 1 1 6 6 6 7 7 3 3\n1 1 1 6 6 6 7 7 3 3\n5 5 5 5 10 13 8 12 9 9\n5 5 5 5 13 10 8 8 9 9\n2 2\n2 1\n2 2\n2 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n64\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Chengdu&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Chengdu </a> ","type":"source","format":"html","require":["katex"]}]}