{"title":"Build the Tower","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2484","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2484&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2484","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2484"},"statement":[{"title":"Problem Description","content":"One of our judges gets bored! Fortunately a toy named Hanoi Tower is there, which may help him to kill time. You know it well that the toy consists of three stacks and some disks. The size of each disk can be indicated by its radius and thickness. Tired of the usual ways of playing the toy, he devises his new rule. He uses only one stack in the game. Before the game, he colors one disk red, the others blue. Starting with an empty peg, the game runs on turn by turn. Each turn, he puts all the valid blue disks as well as the special red disk, which is not on the stack at the time, into a black box and picks out one blindly. By this way he can select one of the disks in the box with equal possibility. Which disk is so-called valid? It is decided by comparing its radius to the radius of the top-most disk on the stack. If its radius is strictly less than the top-most disk&#x2019;s, it&#x2019;s considered valid. If no disk is on the stack at that time, all the disks are considered valid. If a disk is chosen, our cute judge then puts it on the top of the stack, with one exceptional case, the red one. If the special red disk is chosen, instead of putting it onto the stack, the disk currently at the top of the stack should be removed. Wired, isn&#x2019;t it?<br>The stack&#x2019;s height is given. The game ends when after some turns the total thickness of all the disks on the stack is greater than the stack&#x2019;s height, or the red disk is picked but the stack is empty. By then, the guy may get bored again and start to complain about his tedious work (doesn&#x2019;t he suppose to be a judge?) Could you help us to figure out, after how many turns expectedly will the game last?<br><br>","type":"description","format":"html"},{"title":"Input","content":"Input contains no more than 60 cases. There is one empty line between two cases. Your program should process to the end of file.<br>&#xA0;&#xA0;For each test case, the first line contains two integers, N and H (1&lt;=N, H&lt;=100). The toy contains N+ 1 disks, and the stack&#x2019;s height is H. Then N lines follow. Each contains two integers   and   (1&lt;= , &lt;=100), describing one blue disk by giving its radius and thickness. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output one line containing the expected turns the game lasts, to three (3) digits after the decimal point. If the answer is greater than 18000 (that&#x2019;s the 5 hours contest time measured in seconds), output a line &#x201C;INF&#x201D; instead (without quotation). ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2\n1 1\n2 2\n\n1 1\n1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3.333\n1.000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Chengdu&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Chengdu </a> ","type":"source","format":"html"}]}