{"title":"Parade","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2490","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2490&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2490","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2490"},"statement":[{"title":"Problem Description","content":"Panagola, The Lord of city F likes to parade very much. He always inspects his city in his car and enjoys the welcome of his citizens. City F has a regular road system. It looks like a matrix with n+1 west-east roads and m+1 north-south roads. Of course, there are (n+1)&#xD7;(m+1) road crosses in that system. The parade can start at any cross in the southernmost road and end at any cross in the northernmost road. Panagola will never travel from north to south or pass a cross more than once. Citizens will see Panagola along the sides of every west-east road.  People who love Panagola will give him a warm welcome and those who hate him will throw eggs and tomatoes instead. We call a road segment connecting two adjacent crosses in a west-east road a  &#x201C;love-hate zone&#x201D;. Obviously there are m love-hate zones in every west-east road. When passing a love-hate zone, Panagola may get happier or less happy, depending on how many people love him or hate him in that zone. So we can give every love-hate zone a &#x201C;welcome value&#x201D; which may be negative, zero or positive. As his secretary, you must make Panagola as happy as possible.  So you have to find out the best route ----- of which the sum of the welcome values is maximal. You decide where to start the parade and where to end it.<br><br><br><br>When seeing his Citizens, Panagola always waves his hands. He may get tired and need a break. So please never make Panagola travel in a same west-east road for more than k minutes. If it takes p minutes to pass a love-hate zone, we say the length of that love-hate zone is p. Of course you know every love-hate zone&#x2019;s length. <br><br><br><br>The figure below illustrates the case in sample input. In this figure, a best route is marked by thicker lines.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con212-1006-1.JPG\"></center>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. Input ends with a line containing three zeros.<br>Each test case consists of 2&#xD7;n + 3 lines. <br><br>The first line contains three integers: n, m and k.(0&lt;n&lt;=100,0&lt;m&lt;=10000, 0&lt;=k&lt;=3000000)<br><br>The next n+1 lines stands for n + 1 west-east roads in north to south order. Each line contains m integers showing the welcome values of the road&#x2019;s m love-hate zones, in west to east order.<br><br>The last n+1 lines also stands for n + 1 west-east roads in north to south order. Each line contains m integers showing the lengths (in minutes) of the road&apos;s m love-hate zones, in west to east order.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the sum of welcome values of the best route. The answer can be fit in a  32 bits integer.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3 2\n7 8 1\n4 5 6\n1 2 3\n1 1 1\n1 1 1\n1 1 1\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">27</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Beijing&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Beijing </a> ","type":"source","format":"html"}]}