{"title":"Timer","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2493","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2493&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2493","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2493"},"statement":[{"title":"Problem Description","content":"Recently, some archaeologists discovered an ancient relic on a small island in the Pacific Ocean. In the relic, they found an interesting cone shaped container with transparent bottom. The container lay on the horizontal ground with its central axis parallel to the ground. Just beside the container, they found a manual telling them something about the container. <br><br>The container was a timer for a special ceremony. Ancient people filled it all with water before the ceremony, and when the ceremony began, they pulled out the plug in the small hole on the tip of the cone to let the water out. There was a horizontal line called &#x201C;sacred line&#x201D; carved on the bottom of the cone, and when the water level hit that line, they pushed the plug back and ended the ceremony. But the archaeologists could not found the sacred line on that cone. In order to sell the timer at a good prize, the archaeologists wanted to recover that very important line. <br><br><br>By the manual they figured out how much water flew out when the ceremony ended, but they don&#x2019;t know what to do next, so they come to you for help. <br><br>They measures the height of the cone, and the diameter of the bottom, you should tell them the sacred line&#x2019;s height above the ground.  <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con212-1009-1.JPG\"></center>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains an integer T(1&lt;=T&lt;=20), indicating the number of test cases.<br><br><br>Each line after that is a test case. It contains three real numbers, H, D(1&lt;=H,D&lt;=1000) and V, indicating the height and bottom diameter of the timer, and the volume of water that flew out during the ceremony. That volume is guaranteed to be less than half volume of the container.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing the height of the sacred line above the ground.<br><br><br>You should round off the answers to the 5th decimal place. (For example, rounding off 4.000005 equals to 4.00001 and rounding off 4.000004 equals to 4.00000)<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5.0 10.0 0.0\n5.0 10.0 65.4498</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10.00000\n5.00000\n\n<center><img src=\"../../../data/images/con212-1009-2.JPG\"></center></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Beijing&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Beijing </a> ","type":"source","format":"html"}]}