{"title":"Elevator","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2494","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2494&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2494","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2494"},"statement":[{"title":"Problem Description","content":"Too worrying about the house price bubble, poor Mike sold his house and rent an apartment in a 50-floor building several months ago. This building has only one elevator because it is a so called &#x201C;rotten tail building&#x201D;. There are always a lot of people crowding at the gate of the elevator on every floor. Many people have to climb hundreds of steps in order to save time. <br><br>After months of climbing, Mike feels that he can&#x2019;t stand it any more. He wants to sue the building owner.  In order to let the judge understand how terrible the situation is, he decides to write a program to simulate the running of the elevator in a day. You&#x2019;d better let him copy one from you .<br><br><br>At first, the elevator is at the status of &#x201C;idle&#x201D;. If the three conditions below are all satisfied at the same time, we say the elevator is at &#x201C;idle&#x201D; status: <br>1)&#xA0;&#xA0;The elevator is stopped.<br>2)&#xA0;&#xA0;Nobody outside is waiting for the elevator. <br>3)&#xA0;&#xA0;There is nobody in the elevator or all people in the elevator are just on their destination floor. <br><br><br>There are an up button and a down button at the elevator gate on every floor except that only up button on the first floor, and only down button on the 50th floor. When someone wants to take the elevator, he pushes a button according to the direction he wants to go, and then wait. If the elevator is not moving towards his destination floor, he will not get in even the elevator comes and opens its door. When someone pushes a button, we say that he send a request to the elevator. <br><br><br>When the elevator is idle and then some requests are sent to it, it will move towards the direction from which the first request is sent. If more than one request is sent at the same time, the requests sent form the same floor where the elevator stays have higher priority. In other cases, requests which will make the elevator go up, have higher priority than the same time requests which will make the elevator go down. <br><br><br>Once the elevator starts moving, it keeps its moving direction until the three conditions below are all satisfied at the same time:<br>1)&#xA0;&#xA0;All the people in the elevator have reached their destination floor. <br>2)&#xA0;&#xA0;There is nobody waiting for the elevator at the elevator&#x2019;s moving direction.<br>3)&#xA0;&#xA0;Nobody on the floor where the elevator stays wants to go towards the elevator&#x2019;s moving direction.<br>When the three conditions above are all satisfied at the same time, if there are requests from the direction opposite to the elevator&#x2019;s last moving direction, the elevator will turn around and start moving; and if there are no requests at that time, the elevator will stay there and become idle.<br><br>When the elevator reaches a certain floor, it will stop and open its door when one of the two conditions below is satisfied:<br>1) Someone inside the elevator wants to get off on that floor.<br>2) Someone on that floor wants to go towards the elevator&#x2019;s moving direction.<br><br>It takes one second for the elevator to move from one floor to another. <br>It takes one second for the elevator to open the door or close the door.<br>It takes one second for people outside the elevator to get in, no mater how many people.<br>It takes one second for people inside the elevator go get out, no mater how many people.<br><br>The elevator can&#x2019;t stop between two floors.<br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line is an integer T indicating the number of test cases. ( T &lt;= 20)<br><br>For each test case:<br><br>The first line contains two integers: i and n. The elevator is on the i-th floor at first, and n is the total number of requests. ( 1 &lt;= i &lt;= 50, 1&lt;=n&lt;=100)<br>Then n lines follow. Each line contains three integers: t, s and d. It means that at the time of t-th second, a person on the s-th floor sends a request, and he wants to go to the d-th floor.<br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print &#x201C;Case N:&#x201D; in a line at first. N is the test case number starting from 1. <br>Then, print the details of how the elevator runs. You should print information like:<br><br><br><br>mm:ss The elevator starts to move (up|down) from floor x.<br>mm:ss The elevator stops at floor x.<br>mm:ss The elevator door is opening.<br>mm:ss x people leave the elevator.<br>mm:ss x people enter the elevator.<br>mm:ss The elevator door is closing.<br><br>&quot;mm:ss&quot; means time, &quot;mm&quot; for minute, &quot;ss&quot; for second .<br>Please append a blank line to the end of the output of each test case.<br>It is guaranteed that the elevator will finish all requests within 3600 seconds&#x3002;<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2 9\n4 1 3\n5 1 3\n6 1 3\n7 1 3\n9 1 3\n0 2 1\n0 4 1\n0 5 6\n0 6 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n00:00 The elevator door is opening.\n00:01 1 people enter the elevator.\n00:02 The elevator door is closing.\n00:03 The elevator starts to move down from floor 2.\n00:04 The elevator stops at floor 1.\n00:04 The elevator door is opening.\n00:05 1 people leave the elevator.\n00:06 3 people enter the elevator.\n00:07 1 people enter the elevator.\n00:08 The elevator door is closing.\n00:09 The elevator door is opening.\n00:10 1 people enter the elevator.\n00:11 The elevator door is closing.\n00:12 The elevator starts to move up from floor 1.\n00:14 The elevator stops at floor 3.\n00:14 The elevator door is opening.\n00:15 5 people leave the elevator.\n00:16 The elevator door is closing.\n00:17 The elevator starts to move up from floor 3.\n00:19 The elevator stops at floor 5.\n00:19 The elevator door is opening.\n00:20 1 people enter the elevator.\n00:21 The elevator door is closing.\n00:22 The elevator starts to move up from floor 5.\n00:23 The elevator stops at floor 6.\n00:23 The elevator door is opening.\n00:24 1 people leave the elevator.\n00:25 1 people enter the elevator.\n00:26 The elevator door is closing.\n00:27 The elevator starts to move down from floor 6.\n00:29 The elevator stops at floor 4.\n00:29 The elevator door is opening.\n00:30 1 people enter the elevator.\n00:31 The elevator door is closing.\n00:32 The elevator starts to move down from floor 4.\n00:35 The elevator stops at floor 1.\n00:35 The elevator door is opening.\n00:36 2 people leave the elevator.\n00:37 The elevator door is closing.\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nHint\nAt time 00:00, there are 4 requests at the same time. The upwards request on the floor where the elevator stays has the highest priority.\n\nAt time 00:07, because a new person comes, the elevator delays its door closing.\n\nAt time 00:09, the door is just closed. But a new person comes, so the elevator has to reopen its door.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Beijing&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Beijing </a> ","type":"source","format":"html","require":["katex"]}]}