{"title":"Rotate to root","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2499","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2499&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2499","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2499"},"statement":[{"title":"Problem Description","content":"Rotate-to-root is a heuristic for balancing binary search trees. In this problem, the contents of the tree will be ignored, and you will be asked about the effect the heuristic has on the structure of the tree.<br><br>A binary tree is either empty or consists of a node with a left child and a right child, where each of the children are also binary trees. No node has more than one parent, and there are no cycles. In any non-empty tree, there is exactly one node without a parent, which is called the root of the tree.<br><br>The rotate-to-root heuristic takes effect when a node in the tree, say X, is accessed. While X is not the root of the tree, the following procedure is executed:<br><ul><li>If X is the left child of its parent, a right tree rotation is performed. Let P be the parent of X, let A be X&apos;s left child, let B be X&apos;s right child, and let C be the right child of P. Then, P is replaced in the tree by X, so P&apos;s parent (if any) becomes X&apos;s parent; X&apos;s right child becomes P&apos;s left child (which replaces X); and P replaces X&apos;s right child. Diagram:</li><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C240-1005-2.jpg\"></center><br><li>If X is the right child of its parent, a left tree rotation is performed. Let P be the parent of X, let A be the left child of P, let be B be X&apos;s left child, and let C be X&apos;s right child. Then, P is replaced in the tree by X, so P&apos;s parent (if any) becomes X&apos;s parent; X&apos;s left child becomes P&apos;s right child (which replaces X); and P replaces X&apos;s left child. Diagram:<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C240-1005-1.jpg\"></center></li></ul><br>Tree rotations preserve the order of the nodes in the tree, which is why they are useful, but that is not important for this problem. <br><br>The height of a binary tree is the longest length of a path from its root to the bottom of the tree. More formally, the height of the empty tree is 0, and the height of a non-empty tree that has a root node X with children A and B is 1 + max{height(A), height(B)}.<br><br>Given a binary tree, you must determine, for each node X, what the height of the tree would be after X is rotated to root.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input consists of a number of test cases. The first line of each test case contains the integer <i>N</i>, the number of nodes in the binary tree, where 1 &lt;= <i>N</i> &lt;= 10<sup>5</sup>.<br><br>The following <i>N</i> lines of input each contain two integers. The <i>i</i><sup>th</sup> pair of these integers is <i>l<sub>i</sub></i> and <i>r<sub>i</sub></i>, the left and right children of node <i>i</i>. If <i>l<sub>i</sub></i> = 0, then the left child of node <i>i</i> is the empty tree, and if <i>r<sub>i</sub></i> = 0, then the right child of node <i>i</i> is the empty tree. Otherwise, 1 &lt;= <i>l</i>, <i>r</i> &lt;= <i>N</i>.<br><br>It is guaranteed that the input will describe a binary tree.<br><br>The last test case is followed by a line containing the integer 0. This final line is not a test case and should not be processed.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output consists of <i>N</i> lines for each test case, where the <i>i</i><sup>th</sup> line contains an integer giving the height of the tree after node <i>i</i> is rotated to root.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n2 3\n4 0\n0 0\n0 0\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3\n4\n3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2009.09&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2009.09 </a> ","type":"source","format":"html","require":["katex"]}]}