{"title":"Cutting trees","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2558","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2558&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2558","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2558"},"statement":[{"title":"Problem Description","content":"A rooted graph is an indirected graph with every edge attached by some path to a special vertex called the root or the ground. The ground is denoted in the below figures that follow by a dotted line.<br>A bamboo stalk with n segments is a linear graph of n edges with the bottom of the n edges rooted to the ground. A move consists of hacking away one of the segments, and removing that segment and all segments above it no longer connectd to the ground. Two players alternate moves and the last player to move wins. A single bamboo stalk of n segments can be moved into a bamboo stalk of any smaller number of segments from n-1 to 0. So a single bamboo stalk of n segments is equivalent to a nim pile of n chips.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C158-1006-1.jpg\"></center><br>As you known, the player who moves first can win the the game with only one bamboo stalk. So many people always play the game with several bamboo stalks. One example is as below:<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C158-1006-2.JPG\"></center><br>Playing a sum of games of bamboo stalks is thus equivalent to playing a nim game that with several piles. A move consisits of selecting a bamboo stalk containg n segments and hacking away one of the segments in the selected bamboo stalk. <br>I think the nim game is easy for you, the smart ACMers. So, today, we play a game named &quot;cutting trees&quot;. A &quot;rooted tree&quot; is a graph with a distinguished vertex called the root, with the property that from every vertex there is unique path(that doesn&apos;t repeat edges) to the root. Essentially this means there are no cycles.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C158-1006-3.jpg\"></center><br>Of course, in the game &quot;cutting trees&quot;, there are several trees.Again, a move consisits of selecting a tree and hacking away any segment and removing segment and anything not connected to the ground. The player who cuts the last segment wins the game.","type":"description","format":"html"},{"title":"Input","content":"Standard input will contain multiple test cases. The first line of the input is a single integer T which is the number of test cases. T test cases follow.<br>Each case begins with a N(1&lt;=N&lt;=1000), the number of trees in the game.A tree is decribed by a number m, the nodes of the tree and R(0&lt;=R&lt;=m-1), the root of the tree. Then m-1 lines follow, each line containg two positive integers A,B&#x2208;[0,m-1], means that there is a edge between A and B.<br>In the game, the first player always moves first.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Results should be directed to standard output. For each case, if the first player wins, ouput &quot;The first player wins&quot;, or else, output &quot;The second player wins&quot;,in a single line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n1\n4 0\n0 1\n1 2\n1 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">The first player wins</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+HZNU+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2008 HZNU Programming Contest </a> ","type":"source","format":"html"}]}