{"title":"Garbage collecting station","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2559","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2559&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2559","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2559"},"statement":[{"title":"Problem Description","content":"As everyone knows, the garbage collecting station is very important to our daily life. With the growing of the city, more and more garbage need to be collected timely. First, let us see what will the garbage collecting station do everyday.<br>The station divide the city into N*M blocks, each block contains some buindings, as the picture below shows. And the garbage collecting station lies at the suburban district, but not inside any one of these blocks.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C158-1007-1.JPG\"></center><br>The station will sort the blocks (b1, b2, &#x2026; bK, K = N*M )by their priority in a line. For instance, after the sort process, the blocks will be arranged as a sequence b1. b2. b3&#x2026;.bK, then the garbage collecting lorry will begin to collect garbage at b1, loading the garbage at b1, then go to b2, loading garbage then go to b3, and so on. After loaded the garbage at bK, the lorry will go to the station and upload all the garbage.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C158-1007-2.JPG\"></center><br>Now the station want to build another two stations, and these two stations will build inside two different blocks bi and bj (i&lt;j). And the garbage of blocks b1 to bi will be carried to bi, the garbage of blocks bi+1 to bj will be carried to bj, the garbage of blocks bj+1 to bK will be carried to the station at the suburban district. <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C158-1007-3.JPG\"></center><br>Now the problem is: we assume that carrying one unit of garbage in one meter will cost $1. Given the weight of the garbage of each block and the distance between bi and bi+1(1&lt;=i&lt;k), bk and the station, you should find out where to build the two new stations(i.e, choose two blocks bi and bj and make them as new stations) to make the cost as low as possible.","type":"description","format":"html"},{"title":"Input","content":"Standard input will contain multiple test cases. The first line of the input is a single integer T which is the number of test cases. T test cases follow. <br>The first line of each test case contains an integer N(1&lt;=N&lt;=10000), the number of blocks. N lines follow. The i-th line containing two integers, wi (the weight of garbage of block i, 1&lt;=wi&lt;=10000) and di(the distance between di and di+1, 1&lt;=di&lt;=10000), the last one dk means the distance between dk and the station.","type":"input_format","format":"html"},{"title":"Output","content":"Results should be directed to standard output. For each case, output an integers S, the least $ we have to spend to carry the garbage to the collecting station.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n4\n1 2\n2 1\n3 3\n1 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+HZNU+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2008 HZNU Programming Contest </a> ","type":"source","format":"html"}]}