{"title":"Pirates’ Code","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2593","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2593&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2593","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2593"},"statement":[{"title":"Problem Description","content":"Davy Jones has captured another ship and is smiling contently under the sun. Today is a good day for him. He will get more souls to serve on his crew. The day, however, looks so nice, the sun shining brightly above all and the ocean spilled calmly around, that he decides to be merciful and give some<br>chance to the wretched seamen of the captured ship. He decides to play the following game.<br>He will line a group of captives in front of him, and then write a number of his choice on each<br>man&#x2019;s forehead. After that, he wants to check if the set of numbers is 3-free. What does it mean for a set to be 3-free? It means that there are no 3 numbers in the set that form an increasing arithmetic progression (weird games have damned Jones, aye), i.e., a sequence of numbers such that the difference of any two successive members of the sequence is a positive constant, such as {1 2 3}, {4 6 8}, or {-2, 1, 4}. If the the set of numbers on men&#x2019;s foreheads is 3-free, the group is free, too (what an irony).<br>However, if not, those who have the numbers of the lexicographically first triple that proves (i.e. is a witness) that the set is not 3-free will serve on Jones&#x2019; crew for an eternity.<br>And you ... You will be Jones&#x2019; assistant in this game. Checking each group whether it is 3-free or not. And you&#x2019;d better check right or you will end up on Jones&#x2019; crew as well.<br>A triple (a1, a2, a3) is an increasing arithmetic progression if a2-a1=a3-a2, and a2-a1&gt;0.<br>A triple (a1, a2, a3) is lexicographically smaller than (b1, b2, b3) if<br>a1 &lt; b1, or<br>a1 = b1 and a2 &lt; b2, or<br>a1 = b1, a2 = b2 and a3 &lt; b3.<br>Note that you will be looking at triples (a1, a2, a3) of increasing order, i.e. a1 &#x2264; a2 &#x2264; a3. The numbers on men&#x2019;s foreheads need not be in increasing order though.<br>","type":"description","format":"html"},{"title":"Input","content":"Input consists of a single line with the numbers written on the captured men&#x2019;s foreheads. The first number of the line denotes how many men are there in the group(it will not exceed 10000) and should not be included in the sequence.","type":"input_format","format":"html"},{"title":"Output","content":"Output should consist of a single line. If the sequence of numbers in the input is 3-free, output &#x201C;Sequence is 3-free.&#x201D; If the sequence is not 3-free, output &#x201C;Sequence is not 3-free. Witness: w1, w2, w2.&#x201D; (note the intervals after the first dot and the colon), where w1, w2, w3 is the lexicographically first witness that the sequence is not 3-free.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 1 5 6 8\n7 1 3 5 2 -7 0 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Sequence is 3-free.\nSequence is not 3-free. Witness: -7,-1,5.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2010-05+Programming+Contest+&amp;source=1&amp;searchmode=source\"> HDU 2010-05 Programming Contest  </a> ","type":"source","format":"html"}]}