{"title":"Thanks for your love","time_limit":4000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2624","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2624&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2624","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2624"},"statement":[{"title":"Problem Description","content":"Thanks for your love------Do not ask me how many people ever I loved&#xFF0C;you do not know how deep my injury. Did not dare, do not want to, should not be, thank you for your love again. I had to exist like a dust or will bring you harm. Did not dare, do not want to, should not be, thank you for your love again. I had to exist in your future. <br>This is my most fear that brought to your harm Forever.<br><br>Zty have N friends, most friends in his feeling were the same but exactly one (while all other people are equal in his felling). In order to detect which is the people that he has different feeling, he ask himself a lot of questions. With this question , your task is to determine the identifier of the friend who he has different feeling about using the results of these questions. We assigning each friend of him a unique integer identifier from 1 to N.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input file contains two integers N and M, separated by spaces, where N is the number of friends Zty has (2&lt;=N&lt;=10000 ) and M is the number of questions fulfilled (1&lt;=M&lt;=100). The following 2M lines describe all questions. Two consecutive lines describe each question. The first of them starts with a number T<sub>i</sub> (1 &lt;= T<sub>i</sub> &lt;= N/2), representing the number of friends placed in the left group and in the right group, followed by Ti identifiers of friends placed in the left group and Ti identifiers of friends placed in the right group. All numbers are separated by spaces. The second line contains one of the following characters: &apos;&lt;&apos;, &apos;&gt;&apos;, or &apos;=&apos;. <br>It represents the result of the sum feelings: <br>&apos;&lt;&apos; means that the sum of all the feeling in the left group is less than the sum of all the feeling in the right group.<br>&apos;&gt;&apos; means that the sum of all the feeling in the left group is greater than the sum of all the feeling in the right group, <br>&apos;=&apos; means that the sum of all the feeling in the left group is equal to the sum of all the feeling in the right group. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Write to the output file the identifier of the friend or 0, if it cannot be found by the results of the given questions.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 3\n1 1 2\n=\n1 3 4\n&gt;\n1 4 5\n=</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"WhereIsHeroFrom","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%D7%ED%CE%D4%C9%B3%B3%A1%BE%FD%C4%AA%D0%A6&amp;source=1&amp;searchmode=source\"> &#x9189;&#x5367;&#x6C99;&#x573A;&#x541B;&#x83AB;&#x7B11; </a> ","type":"source","format":"html","require":["katex"]}]}