{"title":"Samuel's NOKIA N73","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2632","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2632&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2632","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2632"},"statement":[{"title":"Problem Description","content":"  Samuel got an NOKIA N73 from his two aunts in the summer of 2007,he is so delighted that he often shows his cellphone off in public. But now he has a problem of his N73,because the appearance of his mobile phone is getting much uglier. As is known to all N73 users,N73&apos;s paint peels off easily. Due to Samuel&apos;s poor protection nearly all the paint on N73 has peeled off. So he made up his mind to do something with his cellphone. Now the cellphone seller gave him two pieces of advise:<br>       1.Sell N73 to buy a new one due to the fact that he has not got enough money. <br>       2.Change the appearance of his N73,but if he changed the value of his cellphone will reduce.<br>He has to make a decision. However,the right choice that will be made is based on the price he can get if he sells and the changing fee in case he changed N73&apos;s appearance. <br>    Suppose the cellphone he bought at the price of x RMB,and the sell price is fixed at a RMB,if Samuel changes the appearance once the price of cellphone will be reduced by b(0&lt;b&lt;1).So the value of the cellphone after the change is x(1-b)^1.That is too say,if Samuel change for a second time the value is x(1-b)^2. Every time you should compare the left value with the sell price,if the former is higher than the later,Samuel will keep it for another month or he will sell it immediately. And the seller says he will change for Samuel for free. <br>     The question is:<br>            How many times will Samuel change the appearance of his N73 before he decide to sell it at a second hand price? <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists 2 parts:<br>the test case&apos;s number t. For each case,the input will contains the original price of N73 x, the money a he will get if he sells,and the reducing rate b.  Notice all the numbers here are integers except b. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output the time n Samuel will change his N73&apos;s appearance in the format of&#x201D;Samuel will change the appearance for n time(s),before he decide to sell it.&#x201D;","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3000 2000 0.1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Samuel will change the appearance for 3 time(s),before he decide to sell it.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Samuel","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BB%D2%C9%AB%B3%C8%D7%D3+%D7%A8%B3%A1&amp;source=1&amp;searchmode=source\"> &#x7070;&#x8272;&#x6A59;&#x5B50; &#x4E13;&#x573A; </a> ","type":"source","format":"html","require":["katex"]}]}