{"title":"Getting Driving License","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2633","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2633&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2633","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2633"},"statement":[{"title":"Problem Description","content":"      Have you got a driving license? Acquiring a driving license brings you a lot of benefits. You will regret for not passing the driving test or getting a driving license in your campus life. Why?College life is filled with much spare time,which you can use to improve yourself in many fields such as driving.<br>      During the time of taking driving lessons,Samuel met a lot of classmates whose time are occupied by their own work. The fact that they have little time to practice makes  getting driving license increasingly difficult. Passing the driving test as soon as possible is suggested by these mates to the our college students who cannot drive.<br>       Know something about the driving test you can read the information in the background section,however,it is not related with this problem firmly. Surely,you can go to the problem section directly.   <br>       Here is the background information on owning driving licenses in China mainland:<br>       To get a driving license successfully,you need to take about 4 tests at least. <br>       The first part is the theory exam which helps you know clearly about the transportation law in China mainland and other driving theory.<br>       The  second is to test you whether you can drive a car forward out and backward in the garage at a very low speed(like aunts moving),move the car from one garage to another and drive out. <br>        The third section you need to pass is a little difficult than the second test. In this section,you should be able to drive to avoid the obstacles on the road,manage your car pass S formed way(your car&apos;s wheels can not be moved onto one of the tracks which leads your way out),after that you may have to make your car  pass the 90 degree angle track,then pass the course equipped with very low bridge using  one side of your car&apos;s wheel and so on. <br>        The forth part which is test the same day with the third test is called road driving test(but in the problem I designed the time between Part 3 and Part 4 is 1 month,just want to make the problem much easier).As you can refer from the word,it tests the ability of driving on the road,it is more practical and of more importance. <br>        If you seems not very lucky,you will have fifth section(The problem does not include the 5th part,you can ignore it in solving the problem).In this part you are required to driving at night which involves changing lights in addition . Teachers never taught how to drive at night unless your group is asked to take part in this test. But on the contrary,taught how to driving at night,of course,is necessary. Samuel had an experience of taking the fifth test to get the driving license in the summer of 2008. Tell you a secret,next time you meet a car comes from an opposite direction and the driver of that car does not change his front lights ,it probably means he/she needs special training on how to drive at night.  <br>       To get a driving license,you should pass the 4 parts one by one. For example,if you failed in the section 2,you have to retry for a second time,third time...before you pass. After that you have the opportunity to enter Part 3.<br>       Here is the problem section you need read patiently:<br>       Some details you need to know: <br>       1.The time between the two tests is generally about 1 month(If you fail in the test on your first attempt,you can try it a second time. Fail again the second time he have to go home and retry after 1 month). <br>       2.And the time from you take the first test to your owning a license is within 2 years.<br>       3.What&apos;s more,the passing score in Part 1 test is 90(that is to say if you get 89 or even lower at your first attempt,a second attempt is needed. You will pass until you get 90  or higher at the second time)and each of the rest parts the passing score is 80 at least.<br>","type":"description","format":"html"},{"title":"Input","content":"The input consists 2 major sections as usual,<br>the test cases t,each of the test case involves an integer n and n scores one gets in the test and with n scores he passed the test or he failed to pass in the 2 years(of course here n&gt;=4). All the number here are integers. <br>","type":"input_format","format":"html"},{"title":"Output","content":"Output is simple. Just output the time one needs to get a driving license (if time is within 2 years)using the format &#xFFFD;&#xFFFD;It takes about m months to get a driving license.&#xFFFD;&#xFFFD;If time is beyond 2 years please output the sentence &#xFFFD;&#xFFFD;He failed to get a driving license within 2 years! &#xFFFD;&#xFFFD;","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n5\n89 90 95 84 80\n7\n80 90 70 80 75 85 80\n7\n80 90 70 70 80 85 85</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">It takes about 3 months to get a driving license.\nIt takes about 3 months to get a driving license.\nIt takes about 4 months to get a driving license.\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>Hint:\nIn the first case:first attempt on trying theory test was totally a failure,so he\n tried a second time the same day and he succeeded. The second test was\n taken 1 month later,so it cost 1 month so far. Fortunately, he passed. After\n 1 month he took part 3 and he passed,he waited for another 1 month to attend the part 4 test and succeed. So the total time he needs is 3 months.\nIn the second case:80 90(part 1,passed)70 80(1 months later passed)75 85\n(another 1 month he succeed)80(1 month later he passed and he get the \nlicense finally).It took 3 months.\nIn the 3rd case the second part he took for three times ,so you need to add another 1 month to the result of the second case.\nHope I have made myself understood.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Author","content":"Samuel","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BB%D2%C9%AB%B3%C8%D7%D3+%D7%A8%B3%A1&amp;source=1&amp;searchmode=source\"> &#xFFFD;&#xFFFD;&#x26B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; &#x5E8;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}