{"title":"Ball ","time_limit":20000,"memory_limit":61.296875,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2692","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2692&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2692","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2692"},"statement":[{"title":"Problem Description","content":"Members of Wuhan University ACM Team are fond of playing little games. Ball game is one of them, which is  <br>played with a ball on a rectangle board. The ball should be rolled from the start point to the end point. The  <br>game board is surrounded by walls and contains rectangular obstacles with known dimensions. Obstacles will  <br>not overlap with each other. The ball cannot leave the board, nor can it fly. <br><br>Now, you&apos;re one of the competitors. Can you find the radius of the largest ball to complete the task? ","type":"description","format":"html"},{"title":"Input","content":"The input consists of multiple test cases. The first line of input contains an integer T, which is the number of  <br>test cases.Each test case is on several lines. The first line contains four integers: N, L, W, H, indicating the  <br>number of obstacles; the length, width of the board; and the height of walls.  <br><br>The coordinate of the lower-left corner is (0,0), the upper-right one is (L, W). <br><br>Each of the following N lines consists of five integers: Xi, Yi, Li, Wi, Hi, indicating the coordinate of the  <br>lower-left corner of an obstracle and it&apos;s length, width and height. So the upper-right corner of the obstracle  <br>is (Xi + Li, Yi + Wi).  <br><br>The last line of a test case consists of four integers: Sx, Sy, Tx, Ty  which indicate the coordinates of  <br>start point:(Sx, Sy), and end point:(Tx, Ty). <br><br>[Technical Specification] <br>T is an integer, and T &lt;= 50. <br>N is an integer, and 0 &lt;= N &lt;=10. <br>All integers EXCEPT N are in the range [1, 1000]. <br>You can assume those obstracles? sides are parallel to OX, OY and OZ axis, the start point and end point are  <br>rightful(not outside the board or inside an obstracle). <br>All part of an obstracle is in the board. <br>The integers on the same line are separated by ONE space.  <br>The test cases are separated by ONE empty line.  <br>NO other spaces or lines will appear in the test data. ","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a single line consists of the radius of the largest ball, rounded to two fractional  <br>digits. Output &apos;0.00&apos;(without quotes) if there is no ball can reach its end point from the start point.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 \n3 1000 1000 42 \n102 101 3 2 468 \n106 104 2 3 335 \n100 107 4 1 501 \n101 106 106 100 \n\n4 1000 1000 170 \n108 103 2 3 725 \n105 109 4 1 479 \n101 104 1 4 359 \n103 101 2 2 963 \n100 100 105 106 \n\n2 1000 1000 465 \n102 100 2 3 706 \n106 103 2 3 146 \n100 103 110 103 \n\n0 1000 1000 282 \n100 100 102 102 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1.00 \n1.58 \n2.00 \n100.00 </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+4th+Baidu+Cup+Central+China+Invitational+Programming+Contest&amp;source=1&amp;searchmode=source\"> The 4th Baidu Cup Central China Invitational Programming Contest </a> ","type":"source","format":"html"}]}