{"title":"ISBN","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2714","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2714&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2714","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2714"},"statement":[{"title":"Problem Description","content":"Farmer John&apos;s cows enjoy reading books, and FJ has discovered that his cows produce more milk when they read books of a somewhat intellectual nature. He decides to update the barn library to replace all of the cheap romance novels with textbooks on algorithms and mathematics. Unfortunately, a shipment of these new books has fallen in the mud and their ISBN numbers are now hard to read.<br><br>An ISBN (International Standard Book Number) is a ten digit code that uniquely identifies a book. The first nine digits represent the book and the last digit is used to make sure the ISBN is correct. To verify that an ISBN number is correct, you calculate a sum that is 10 times the first digit plus 9 times the second digit plus 8 times the third digit ... all the way until you add 1 times the last digit. If the final number leaves no remainder when divided by 11, the code is a valid ISBN.<br><br>For example 0201103311 is a valid ISBN, since<br>10*0 + 9*2 + 8*0 + 7*1 + 6*1 + 5*0 + 4*3 + 3*3 + 2*1 + 1*1 = 55.<br><br>Each of the first nine digits can take a value between 0 and 9. Sometimes it is necessary to make the last digit equal to ten; this is done by writing the last digit as X. For example, 156881111X is a valid ISBN number.<br><br>Your task is to fill in the missing digit from a given ISBN number where the missing digit is represented as &apos;?&apos;. ","type":"description","format":"html"},{"title":"Input","content":"* Line 1: A single line with a ten digit ISBN number that contains &apos;?&apos; in a single position ","type":"input_format","format":"html"},{"title":"Output","content":"* Line 1: The missing digit (0..9 or X). Output -1 if there is no acceptable digit for the position marked &apos;?&apos; that gives a valid ISBN. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">15688?111X</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=USACO+2003+Fall+Orange&amp;source=1&amp;searchmode=source\"> USACO 2003 Fall Orange </a> ","type":"source","format":"html"}]}