{"title":"Time to Graduate","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2729","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2729&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2729","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2729"},"statement":[{"title":"Problem Description","content":"A prospective CS student is investigating how many semesters it will take to graduate from a variety of different universities. Each university provides a list of required courses, their prerequisites, and when each course is offered. Given this information, determine the minimum number of semesters to graduate. Consider the following example. A student is required to take 4 courses, mt42, cs123, cs456, and cs789. mt42 is only offered in the fall semester and has no prerequisites. Similarly, cs123 is only offered in the spring semester and has no prerequisites. cs456 is only offered in the spring semester and has both cs123 and mt42 as prerequisites. Finally, cs789 is offered in both fall and spring and has cs456 as its only prerequisite. The shortest time to graduate is 5 semesters, by taking mt42 in the fall, cs123 in the next spring, cs456 the following spring (since it is not offered in the fall) and finally cs789 the following fall. For this problem, there are only two semesters, fall and spring. Always start counting semesters from the fall.<br>In addition to the fall/spring scheduling issues, there is one slight complication. In order to keep the dormitories full, each university limits the number of courses that can be taken in any semester. This limit appears as part of the input data. The third example below illustrates this issue.","type":"description","format":"html"},{"title":"Input","content":"There are one to twenty-five data sets, followed by a final line containing only the integers -1 -1. A data set starts with a line containing two positive integers n, 1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 12, which is the number of courses in this data set and m, 2 &#xFFFD;&#xFFFD; m &#xFFFD;&#xFFFD; 6, which is the maximum number of courses that can be taken in any single semester. The next line contains the n course identifiers. Each is a 1-5 character string from the set {a-z, 0-9}. Following the course identifiers is the individual course information. This consists of n lines, one line for each course, containing the course identifier, semester offered(&apos;F&apos;=Fall, &apos;S&apos;=Spring, &apos;B&apos;=Both semesters), the number of prerequisite courses, p, 0 &#xFFFD;&#xFFFD; p &#xFFFD;&#xFFFD; 5, and finally p prerequisite course identifiers. The first example data set below corresponds to the problem described above.","type":"input_format","format":"html"},{"title":"Output","content":"The output contains one line for each data set, formatted as shown in the sample output.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 6\ncs123 mt42 cs456 cs789\nmt42 F 0\ncs123 S 0\ncs456 S 2 cs123 mt42\ncs789 B 1 cs456\n3 6\nmath1 comp2 comp3\ncomp3 S 1 comp2\nmath1 S 0\ncomp2 F 1 math1\n4 3\nm10 m20 c33 c44\nm10 B 0\nm20 B 0\nc33 B 0\nc44 B 0\n-1 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">The minimum number of semesters required to graduate is 5.\nThe minimum number of semesters required to graduate is 4.\nThe minimum number of semesters required to graduate is 2.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+USA+2005&amp;source=1&amp;searchmode=source\"> Mid-Central USA 2005 </a> ","type":"source","format":"html"}]}