{"title":"Painter","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2730","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2730&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2730","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2730"},"statement":[{"title":"Problem Description","content":"The local toy store sells small fingerpainting kits with between three and twelve 50ml bottles of paint, each a different color. The paints are bright and fun to work with, and have the useful property that if you mix X ml each of any three different colors, you get X ml of gray. (The paints are thick and &quot;airy&quot;, almost like cake frosting, and when you mix them together the volume doesn&apos;t increase, the paint just gets more dense.) None of the individual colors are gray; the only way to get gray is by mixing exactly three distinct colors, but it doesn&apos;t matter which three. Your friend Emily is an elementary school teacher and every Friday she does a fingerpainting project with her class. Given the number of different colors needed, the amount of each color, and the amount of gray, your job is to calculate the number of kits needed for her class.","type":"description","format":"html"},{"title":"Input","content":"The input consists of one or more test cases, followed by a line containing only zero that signals the end of the input. Each test case consists of a single line of five or more integers, which are separated by a space. The first integer N is the number of different colors (3 &#xFFFD;&#xFFFD; N &#xFFFD;&#xFFFD; 12). Following that are N different nonnegative integers, each at most 1,000, that specify the amount of each color needed. Last is a nonnegative integer G &#xFFFD;&#xFFFD; 1,000 that specifies the amount of gray needed. All quantities are in ml.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the smallest number of fingerpainting kits sufficient to provide the required amounts of all the colors and gray. Note that all grays are considered equal, so in order to find the minimum number of kits for a test case you may need to make grays using different combinations of three distinct colors.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 40 95 21 0\n7 25 60 400 250 0 60 0 500\n4 90 95 75 95 10\n4 90 95 75 95 11\n5 0 0 0 0 0 333\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n8\n2\n3\n4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+USA+2005&amp;source=1&amp;searchmode=source\"> Mid-Central USA 2005 </a> ","type":"source","format":"html"}]}