{"title":"Leapin' Lizards","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2732","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2732&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2732","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2732"},"statement":[{"title":"Problem Description","content":"Your platoon of wandering lizards has entered a strange room in the labyrinth you are exploring. As you are looking around for hidden treasures, one of the rookies steps on an innocent-looking stone and the room&apos;s floor suddenly disappears! Each lizard in your platoon is left standing on a fragile-looking pillar, and a fire begins to rage below... Leave no lizard behind! Get as many lizards as possible out of the room, and report the number of casualties.<br>The pillars in the room are aligned as a grid, with each pillar one unit away from the pillars to its east, west, north and south. Pillars at the edge of the grid are one unit away from the edge of the room (safety). Not all pillars necessarily have a lizard. A lizard is able to leap onto any unoccupied pillar that is within d units of his current one. A lizard standing on a pillar within leaping distance of the edge of the room may always leap to safety... but there&apos;s a catch: each pillar becomes weakened after each jump, and will soon collapse and no longer be usable by other lizards. Leaping onto a pillar does not cause it to weaken or collapse; only leaping off of it causes it to weaken and eventually collapse. Only one lizard may be on a pillar at any given time.","type":"description","format":"html"},{"title":"Input","content":"The input file will begin with a line containing a single integer representing the number of test cases, which is at most 25. Each test case will begin with a line containing a single positive integer n representing the number of rows in the map, followed by a single non-negative integer d representing the maximum leaping distance for the lizards. Two maps will follow, each as a map of characters with one row per line. The first map will contain a digit (0-3) in each position representing the number of jumps the pillar in that position will sustain before collapsing (0 means there is no pillar there). The second map will follow, with an &apos;L&apos; for every position where a lizard is on the pillar and a &apos;.&apos; for every empty pillar. There will never be a lizard on a position where there is no pillar.Each input map is guaranteed to be a rectangle of size n x m, where 1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 20 and 1 &#xFFFD;&#xFFFD; m &#xFFFD;&#xFFFD; 20. The leaping distance is<br>always 1 &#xFFFD;&#xFFFD; d &#xFFFD;&#xFFFD; 3.","type":"input_format","format":"html"},{"title":"Output","content":"For each input case, print a single line containing the number of lizards that could not escape. The format should follow the samples provided below.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n3 1\n1111\n1111\n1111\nLLLL\nLLLL\nLLLL\n3 2\n00000\n01110\n00000\n.....\n.LLL.\n.....\n3 1\n00000\n01110\n00000\n.....\n.LLL.\n.....\n5 2\n00000000\n02000000\n00321100\n02000000\n00000000\n........\n........\n..LLLL..\n........\n........</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 2 lizards were left behind.\nCase #2: no lizard was left behind.\nCase #3: 3 lizards were left behind.\nCase #4: 1 lizard was left behind.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+USA+2005&amp;source=1&amp;searchmode=source\"> Mid-Central USA 2005 </a> ","type":"source","format":"html"}]}