{"title":"Netiquette","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2733","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2733&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2733","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2733"},"statement":[{"title":"Problem Description","content":"Mr. Manners teaches netiquette (&quot;net etiquette&quot;, particularly as it applies to email) at the local community college. There are many different aspects to proper netiquette, including courtesy, correct spelling, and correct grammar. Through experience Mr. Manners has found that his college&apos;s email system does a good job of catching most spelling and grammatical errors, and he&apos;s also found that most of his students are courteous. So there are four violations of netiquette that Mr. Manners pays careful attention to, and he&apos;s devised a quick way to test for them. A message is suspicious if it contains any of the following:<br>1. two adjacent uppercase letters,<br>(because you might be SHOUTING)<br>2. a digit adjacent to a letter,<br>(because you might be l33t, d00d)<br>3. an isolated character other than a, A, or I,<br>(because u r probably abbreviating words; the spell checker doesn&apos;t catch this for some reason)<br>4. two adjacent punctuation marks, unless one of them is a double quote (the character &quot;).<br>(because you might be using an emoticon :-)<br>For this problem, all characters in an email message are printable ASCII characters with codes in the range 32..126 (inclusive). A punctuation mark is any character other than a letter, digit, or space. Two characters are adjacent if they are right next to each other, with no characters in between. An isolated character is one whose only adjacent characters (if any) are spaces. Your job is to write a program that can tell if a one-line email message is suspicious.","type":"description","format":"html"},{"title":"Input","content":"The input consists of one or more email messages, followed by a line containing only # that signals the end of the input. Each message is on a line by itself, does not begin or end with a space, and does not contain consecutive spaces. End-of-line characters occur at the end of every line (of course), but they are not considered to be part of the message. A message will contain 1..80 characters.","type":"input_format","format":"html"},{"title":"Output","content":"For each message, output suspicious if it meets one or more of the four criteria defined above, and output OK otherwise. In the examples below, the second email meets all four criteria, and the fourth and sixth emails meet one criterion each.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">&quot;This is a safe message,&quot; said 50 wise men.\nDON&apos;T b l8 for the Apple ][ user&apos;s group meeting.\nI ate at &quot;Al&apos;s Big Burritos&quot; for lunch!\nIt&apos;s not OK to burp at your grandmother.\n*BuT* YoU _CaN_ Do ThIs, YoU KnOw.\nWe 8 eight oranges.\n#</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">OK\nsuspicious\nOK\nsuspicious\nOK\nsuspicious</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Mid-Central+USA+2005&amp;source=1&amp;searchmode=source\"> Mid-Central USA 2005 </a> ","type":"source","format":"html"}]}