{"title":"WiFi","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2752","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2752&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2752","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2752"},"statement":[{"title":"Problem Description","content":"One day, the residents of Main Street got together and decided that they would install wireless internet on their street, with coverage for every house. Now they need your help to decide where they should place the wireless access points. They would like to have as strong a signal as possible in every house, but they have only a limited budget for purchasing access points. They would like to place the available access points so that the maximum distance between any house and the access point closest to it is as small as possible.<br><br>Main Street is a perfectly straight road. The street number of each house is the number of metres from the end of the street to the house. For example, the house at address 123 Main Street is exactly 123 metres from the end of the street. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of each test chunk contains an integer specifying the number of test cases in this chunk to follow. The first line of each test case contains two positive integers n, the number of access points that the residents can buy, and m, the number of houses on Main Street. The following m lines contain the house numbers of the houses on Main Street, one house number on each line. There will be no more than 100 000 houses on Main Street, and the house numbers will be no larger than one million. <br>Please process to the end of the data file.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a line containing one number, the maximum distance between any house and the access point nearest to it. Round the number to the nearest tenth of a metre, and output it with exactly one digit after the decimal point. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2 3\n1\n3\n10\n1\n2 3\n1\n3\n10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1.0\n1.0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2008.10.04&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2008.10.04 </a> ","type":"source","format":"html","require":["katex"]}]}