{"title":"Logo 2","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2755","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2755&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2755","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2755"},"statement":[{"title":"Problem Description","content":"Logo is a programming language built around a turtle. Commands in the language cause the turtle to move. The turtle has a pen attached to it. As the turtle moves, it draw lines on the page. The turtle can be programmed to draw interesting pictures.<br><br>We are interested in making the turtle draw a picture, then return to the point that it started from. For example, we could give the turtle the following program:<br><br>fd 100 lt 120 fd 100 lt 120 fd 100<br><br>The command fd causes the turtle to move forward by the specified number of units. The command lt causes the turtle to turn left by the specified number of degrees. Thus the above commands cause the turtle to draw an equilateral triangle with sides 100 units long. Notice that after executing the commands, the turtle ends up in the same place as it started. The turtle understands two additional commands. The command bk causes the turtle to move backward by the specified number of units. The command rt causes the turtle to turn right by the specified number of degrees. The distances and angles in all commands are always non-negative integers.<br><br>Unfortunately, we have been messy in writing the program down, and cannot read our own writing. One of the numbers in the program is missing. Assuming the turtle ends up at the place that it started at the end of its journey, can you find the missing number? ","type":"description","format":"html"},{"title":"Input","content":"The first line of each test chunk contains an integer specifying the number of test cases in this chunk to follow.  Each test case starts with a line containing one integer, the number of commands to follow. The commands follow, one on each line. Each test case will contain no more than 1000 commands. The argument of each command is either an integer or a question mark (?). There will be exactly one question mark in each test case. <br>Please process to the end of the data file.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output line containing a single integer n such that when the question mark in the program is replaced by n, the turtle ends up at the same point that it started from once the program completes. If the question mark is the argument of an lt or rt command, the angle in the output must be between 0 and 359 degrees, inclusive. The correct answer will always be an integer, and we guarantee that for every test case, there will be only one correct answer. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5\nfd 100\nlt 120\nfd ?\nlt 120\nfd 100\n1\n5\nfd 100\nlt 120\nfd ?\nlt 120\nfd 100</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">100\n100</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2008.10.04&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2008.10.04 </a> ","type":"source","format":"html"}]}