{"title":"Recursively Palindromic Partitions","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2765","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2765&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2765","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2765"},"statement":[{"title":"Problem Description","content":"A partition of a positive integer N is a sequence of integers which sum to N, usually written with plus signs between the numbers of the partition. For example<br><br>15 = 1+2+3+4+5 = 1+2+1+7+1+2+1<br><br>A partition is palindromic if it reads the same forward and backward. The first partition in the example is not palindromic while the second is. If a partition containing m integers is palindromic, its left half is the first <b>floor(m/2)</b> integers and its right half is the last <b>floor(m/2)</b> integers (which must be the reverse of the left half. (<b>floor(x)</b> is the greatest integer less than or equal to x.)<br><br>A partition is recursively palindromic if it is palindromic and its left half is recursively palindromic or empty. Note that every integer has at least two recursively palindromic partitions one consisting of all ones and a second consisting of the integer itself. The second example above is also recursively palindromic.<br><br>For example, the recursively palindromic partitions of 7 are:<br><br>7, 1+5+1, 2+3+2, 1+1+3+1+1, 3+1+3, 1+1+1+1+1+1+1<br><br>Write a program which takes as input an integer N and outputs the number of recursively palindromic partitions of N.<br><br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a single integer N, (1 &#x2264; N &#x2264; 1000) which is the number of data sets that follow. Each data set consists of a single line of input containing a single positive integer for which the number of recursively palindromic partitions is to be found.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each data set, you should generate one line of output with the following values: The data set number as a decimal integer (start counting at one), a space and the number of recursively palindromic partitions of the input value.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 \n4 \n7 \n20 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 4 \n2 6 \n3 60 </div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU-ACM+2009+%CA%A1%C8%FC%BC%AF%D1%B5%B6%D3%A3%AD%D7%E9%B6%D3PK%A3%A83%A3%A9&amp;source=1&amp;searchmode=source\"> HDU-ACM 2009 &#x7701;&#x8D5B;&#x96C6;&#x8BAD;&#x961F;&#xFF0D;&#x7EC4;&#x961F;PK&#xFF08;3&#xFF09; </a> ","type":"source","format":"html"}]}