{"title":"Cat vs. Dog","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2768","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2768&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2768","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2768"},"statement":[{"title":"Problem Description","content":"The latest reality show has hit the TV: ``Cat vs. Dog&apos;&apos;. In this show, a bunch of cats and dogs compete for the very prestigious Best Pet Ever title. In each episode, the cats and dogs get to show themselves off, after which the viewers vote on which pets should stay and which should be forced to leave the show.<br><br>Each viewer gets to cast a vote on two things: one pet which should be kept on the show, and one pet which should be thrown out. Also, based on the universal fact that everyone is either a cat lover (i.e. a dog hater) or a dog lover (i.e. a cat hater), it has been decided that each vote must name exactly one cat and exactly one dog.<br><br>Ingenious as they are, the producers have decided to use an advancement procedure which guarantees that as many viewers as possible will continue watching the show: the pets that get to stay will be chosen so as to maximize the number of viewers who get both their opinions satisfied. Write a program to calculate this maximum number of viewers. ","type":"description","format":"html"},{"title":"Input","content":"On the first line one positive number: the number of testcases, at most 100. After that per testcase:<br><br>    * One line with three integers c, d, v (1 &#xFFFD;&#xFFFD; c, d &#xFFFD;&#xFFFD; 100 and 0 &#xFFFD;&#xFFFD; v &#xFFFD;&#xFFFD; 500): the number of cats, dogs, and voters.<br>    * v lines with two pet identifiers each. The first is the pet that this voter wants to keep, the second is the pet that this voter wants to throw out. A pet identifier starts with one of the characters `C&apos; or `D&apos;, indicating whether the pet is a cat or dog, respectively. The remaining part of the identifier is an integer giving the number of the pet (between 1 and c for cats, and between 1 and d for dogs). So for instance, ``D42&apos;&apos; indicates dog number 42. ","type":"input_format","format":"html"},{"title":"Output","content":"Per testcase:<br><br>    * One line with the maximum possible number of satisfied voters for the show. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 1 2\nC1 D1\nD1 C1\n1 2 4\nC1 D1\nC1 D1\nC1 D2\nD2 C1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC+2008&amp;source=1&amp;searchmode=source\"> NWERC 2008 </a> ","type":"source","format":"html"}]}