{"title":"Disgruntled Judge","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2769","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2769&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2769","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2769"},"statement":[{"title":"Problem Description","content":"Once upon a time, there was an nwerc judge with a tendency to create slightly too hard problems. As a result, his problems were never solved. As you can image, this made our judge somewhat frustrated. This year, this frustration has culminated, and he has decided that rather than spending a lot of time constructing a well-crafted problem, he will simply write some insanely hard problem statement and just generate some random input and output files. After all, why bother having proper test data if nobody is going to try the problem anyway?<br><br>Thus, the judge generates a testcase by simply letting the input be a random number, and letting the output be another random number. Formally, to generate the data set with T test cases, the judge generates 2T random numbers x1, ..., x2T between 0 and 10000, and then writes T, followed by the sequence x1, x3, x5, ..., x2T-1 to the input file, and the sequence x2, x4, x6, ..., x2T to the output file.<br><br>The random number generator the judge uses is quite simple. He picks three numbers x1, a, and b between 0 and 10000 (inclusive), and then for i from 2 to 2T lets xi = (a &#xFFFD;&#xFFFD; xi-1 + b) mod 10001.<br><br>You may have thought that such a poorly designed problem would not be used in a contest of such high standards as nwerc. Well, you were wrong. ","type":"description","format":"html"},{"title":"Input","content":"On the first line one positive number: the number of testcases, at most 100. After that per testcase:<br><br>    * One line containing an integer n (0 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 10000): an input testcase. <br><br>The input file is guaranteed to be generated by the process described above. ","type":"input_format","format":"html"},{"title":"Output","content":"Per testcase:<br><br>    * One line with an integer giving the answer for the testcase. <br><br>If there is more than one output file consistent with the input file, any one of these is acceptable. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n17\n822\n3014</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9727\n1918\n4110</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC+2008&amp;source=1&amp;searchmode=source\"> NWERC 2008 </a> ","type":"source","format":"html"}]}