{"title":"Sculpture","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2771","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2771&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2771","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2771"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../../data/images/C179-1006-1.jpg\"> </center><br><br>Imagine a box, made of copper plate. Imagine a second one, intersecting the first one, and several others, intersecting each other (or not). That is how the sculptor Oto Boxing constructs his sculptures. In fact he does not construct that much, he only makes the design; the actual construction is contracted out to a construction company. For the calculation of the costs of construction the company needs to know the total area of copper plate involved. Parts of a box that are hidden in another box are not realized in copper, of course. (Copper is quite expensive, and prices are rising.) After construction, the total construction is plunged into a bath of chemicals. To prevent this bath from running over, the construction company wants to know the total volume of the construction. Given that a construction is a collection of boxes, you are asked to calculate the area and the volume of the construction.<br><br>Some of Oto&apos;s designs are connected, others are not. Either way, we want to know the total area and the total volume. It might happen that the boxes completely enclose space that is not included in any of the boxes (see the second example below). Because the liquid cannot enter that space, its volume must be added to the total volume. Copper plate bordering this space is superfluous, of course, so it does not add to the area. ","type":"description","format":"html"},{"title":"Input","content":"On the first line one positive number: the number of testcases, at most 100. After that per testcase:<br><br>    * One line with an integer n (1 &#x2264; n &#x2264; 50): the number of boxes involved.<br>    * n lines with six positive integers x0, y0, z0, x, y, z (1 &#x2264; x0, y0, z0, x, y, z &#x2264; 500): the triple (x0, y0, z0) is the vertex of the box with the minimum values for the coordinates and the numbers x, y, z are the dimensions of the box (x, y and z dimension, respectively). All dimensions are in centimeters. The sides of the boxes are always parallel to the coordinate axes. ","type":"input_format","format":"html"},{"title":"Output","content":"Per testcase:<br><br>    * One line with two numbers separated by single spaces: the total amount of copper plate needed (in cm<sup>2</sup>), and the total volume (in cm<sup>3</sup>). ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2\n1 2 3 3 4 5\n6 2 3 3 4 5\n7\n1 1 1 5 5 1\n1 1 10 5 5 1\n1 1 2 1 4 8\n2 1 2 4 1 8\n5 2 2 1 4 8\n1 5 2 4 1 8\n3 3 4 1 1 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">188 120\n250 250</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NWERC+2008&amp;source=1&amp;searchmode=source\"> NWERC 2008 </a> ","type":"source","format":"html"}]}