{"title":"Jack of All Trades","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2777","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2777&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2777","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2777"},"statement":[{"title":"Problem Description","content":"Jack Barter is a wheeler-dealer of the highest sort. He&apos;ll trade anything for anything, as long as he gets a good deal. Recently, he wanted to trade some red agate marbles for some goldfish. Jack&apos;s friend Amanda was willing to trade him 1 goldfish for 2 red agate marbles. But Jack did some more digging and found another friend Chuck who was willing to trade him 5 plastic shovels for 3 marbles while Amanda was willing to trade 1 goldfish for 3 plastic shovels. Jack realized that he could get a better deal going through Chuck (1.8 marbles per goldfish) than by trading his marbles directly to Amanda (2 marbles per goldfish).<br><br>Jack revels in transactions like these, but he limits the number of other people involved in a chain of transactions to 9 (otherwise things can get a bit out of hand). Normally Jack would use a little program he wrote to do all the necessary calculations to find the optimal deal, but he recently traded away his computer for a fine set of ivory-handled toothpicks. So Jack needs your help. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input will consist of multiple test cases. The first line of the file will contain an integer n  indicating the number of test cases in the file. Each test case will start with a line containing two strings and a positive integer m&lt;=50 . The first string denotes the items that Jack wants, and the second string identifies the items Jack is willing to trade. After this will be m  lines of the form<br><br><br>a1 name1 a2 name2<br><br><br>indicating that some friend of Jack&apos;s is willing to trade an amount a1 of item name1 for an amount a2 of item name2 . (Note this does not imply the friend is also willing to trade a2 of item name2 for a1 of item name1 .) The values of a1 and a2 will be positive and &lt;=20 . No person will ever need more than 2^31 - 1 items to complete a successful trade. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output the phrase `Case i :&apos; (where i  is the case number starting at 1) followed by the best possible ratio that Jack can obtain. Output the ratio using 5 significant digits, rounded. Follow this by a single space and then the number of ways that Jack could obtain this ratio. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 \ngoldfish marbles 3 \n1 goldfish 2 marbles \n5 shovels 3 marbles \n1 goldfish 3 shovels \nthis that 4 \n7 this 2 that \n14 this 4 that \n7 this 2 theother \n1 theother 1 that</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1.8000 1 \nCase 2: 0.28571 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+East+Central+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2008 East Central Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}