{"title":"LCR","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2778","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2778&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2778","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2778"},"statement":[{"title":"Problem Description","content":"LCR is a simple game for three or more players. Each player starts with three chips and the object is to be the last person to have any chips. Starting with Player 1, each person rolls a set of three dice. Each die has six faces, one face with an L, one with a C, one with an R and three with a dot. For each L rolled, the player must pass a chip to the player on their left (Player 2 is considered to be to the left of Player 1); for each R rolled, the player passes a chip to the player on their right; and for each C rolled, the player puts a chip in a central pile which belongs to no player. No action is taken for any dot that is rolled. Play continues until only one player has any chips left. In addition, the following rules apply:<br><br><br>   1. A player with no chips is not out of the game, since they may later gain chips based on other players&apos; rolls.<br>   2. A player with only 1 or 2 chips left only rolls 1 or 2 dice, respectively. A player with no chips left does not roll but just passes the dice to the next player.<br><br>Your job is to simulate this game given a sequence of dice rolls. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input will consist of multiple test cases. Each test case will consist of one line containing an integer n  (indicating the number of players in the game) and a string (specifying the dice rolls). There will be at most 10 players in any game, and the string will consist only of the characters `L&apos;, `C&apos;, `R&apos; and `.&apos;. In some test cases, there may be more dice rolls than are needed (i.e., some player wins the game before you use all the dice rolls). If there are not enough dice rolls left to complete a turn (for example, only two dice rolls are left for a player with 3 or more chips) then those dice rolls should be ignored. A value of n = 0  will indicate end of input. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output the phrase `Game i :&apos; on a single line (where i  is the case number starting at 1) followed by a description of the state of the game. This desciption will consist of n + 1  lines of the form<br><br><br>Player 1:c1<br>Player 2:c2<br>...<br>Player n :cn<br>Center:ct<br><br><br>where c1, c2...cn are the number of chips each player has at the time the simulation ended (either because some player has won or there are no more remaining dice rolls) and ct is the number of chips in the center pile. In addition, if some player has won, you should append the string `(W)&apos; after their chip count; otherwise you should append the string `(*)&apos; after the chip count of the player who is the next to roll. The only blank on any line should come before the game number or the player number. Use a single blank line to separate test cases. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 LR.CCR.L.RLLLCLR.LL..R...CLR. \n5 RL....C.L \n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Game 1: \nPlayer 1:0 \nPlayer 2:0 \nPlayer 3:6(W) \nCenter:3 \n\nGame 2: \nPlayer 1:1 \nPlayer 2:4 \nPlayer 3:1 \nPlayer 4:4(*) \nPlayer 5:4 \nCenter:1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+East+Central+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2008 East Central Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}