{"title":"Party Party Party","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2779","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2779&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2779","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2779"},"statement":[{"title":"Problem Description","content":"Emma has just graduated high school and it is the custom for the new graduates to throw parties for themselves and invite everyone in school to attend. Naturally, Emma wishes to attend as many parties as possible. This is not such a problem on a weekday since usually there are only two or three parties in the evening. But, Saturdays are packed! Typically some parties start at 8 AM (breakfast is served) while others might end at midnight (much to the annoyance of the neighbors). Emma naturally wants to know how many parties she can attend.<br><br>Each party has a starting and stopping time, which are on the hour. These are listed via a 24-hour clock. For example, a party might start at 10 AM (10) and end at 2 PM (14). The earliest a party can start is 8 AM (8) and the latest it can end is midnight (24). In order not to be rude, Emma stays at each party at least one half hour and will consider traveling time between parties to be instantaneous. If there are times during the day when there are no parties to attend, she&apos;ll simply go home and rest. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be multiple test cases. Each test case starts with a line containing an integer p  (&lt;=100)  indicating the number of parties on the given day. (A value of p = 0  indicates end of input.) The following p  lines are each of the form s e , both integers where 8&lt;=s &lt; e&lt;=24 , indicating a party that starts at time s  and ends at time e . Note there may be multiple parties with the same starting and ending time. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each input set output a line of the form<br><br>On day d Emma can attend as many as n parties.<br><br>where you determine the value of n and d is the number of the test case starting at 1. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8 \n12 13 \n13 14 \n12 13 \n9 10 \n9 10 \n12 13 \n12 14 \n9 11 \n3 \n14 15 \n14 15 \n14 15 \n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">On day 1 Emma can attend as many as 7 parties. \nOn day 2 Emma can attend as many as 2 parties.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+East+Central+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2008 East Central Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}