{"title":"Billboard","time_limit":8000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2795","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2795&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2795","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2795"},"statement":[{"title":"Problem Description","content":"At the entrance to the university, there is a huge rectangular billboard of size h*w (h is its height and w is its width). The board is the place where all possible announcements are posted: nearest programming competitions, changes in the dining room menu, and other important information.<br><br>On September 1, the billboard was empty. One by one, the announcements started being put on the billboard.<br><br>Each announcement is a stripe of paper of unit height. More specifically, the i-th announcement is a rectangle of size 1 * wi.<br><br>When someone puts a new announcement on the billboard, she would always choose the topmost possible position for the announcement. Among all possible topmost positions she would always choose the leftmost one.<br><br>If there is no valid location for a new announcement, it is not put on the billboard (that&apos;s why some programming contests have no participants from this university).<br><br>Given the sizes of the billboard and the announcements, your task is to find the numbers of rows in which the announcements are placed.","type":"description","format":"html"},{"title":"Input","content":"There are multiple cases (no more than 40 cases).<br><br>The first line of the input file contains three integer numbers, h, w, and n (1 &lt;= h,w &lt;= 10^9; 1 &lt;= n &lt;= 200,000) - the dimensions of the billboard and the number of announcements.<br><br>Each of the next n lines contains an integer number wi (1 &lt;= wi &lt;= 10^9) - the width of i-th announcement.","type":"input_format","format":"html"},{"title":"Output","content":"For each announcement (in the order they are given in the input file) output one number - the number of the row in which this announcement is placed. Rows are numbered from 1 to h, starting with the top row. If an announcement can&apos;t be put on the billboard, output &quot;-1&quot; for this announcement.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 5 5\n2\n4\n3\n3\n3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\n1\n3\n-1</div></pre>","type":"example","format":"html"},{"title":"Author","content":"hhanger@zju","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ+2009+Summer+Exercise%A3%A85%A3%A9&amp;source=1&amp;searchmode=source\"> HDOJ 2009 Summer Exercise&#xFFFD;&#xFFFD;5&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}