{"title":"Traversal","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2836","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2836&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2836","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2836"},"statement":[{"title":"Problem Description","content":"I arrive at a big lake and I have to cross it. Luckily, I&#x2019;m a very good jumper, but the lake is too big to be crossed in one jump. On the shore, I find N boxes of different heights, set in a certain order. If I throw a box into the lake, it will float and it will have the same height as on the shore. This is good, because I intend to throw some boxes into the lake and get from one shore to the other by jumping from box to box. The only things to consider are:<br>The lake is big, so I must throw at least 2 boxes, which means that in order to cross the lake I have to make at least 3 jumps.<br>Not all the boxes have to be thrown; some of them may be ignored.<br>The boxes can be thrown into the lake only in the order they are found on the shore and I have to jump on them in this order.<br>The height difference between two consecutive boxes I use must be at most H meters, because I can jump a lot in length, but I have some problems with jumping in height.The height of a box doesn&#x2019;t change when I jump on it.<br>I&#x2019;m always able to jump from the shore to a box and from a box to the shore, no matter what the height of the box is.<br><br>Facing so many possibilities that respect the above conditions, I begin counting the number of possibilities that I have, instead of actually crossing the lake. I quickly find the answer and I wonder whether you can also find it as fast as I did.<br><br>Task<br><br>Write a program that determines the number of possibilities to cross the lake in the above conditions. Since the number can be quite big, you only have to output the remainder of this number, when divided by 9901.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases. Each test case contains two integers N and H, separated by a space, representing the number of boxes and the maximum height difference between two consecutive boxes thrown into the lake. The following N lines contain the heights of the boxes, in the order the boxes are set on the shore. The (i+1)th line contains the height of the ith box. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case you should output a single line, containing the number of possibilities modulo 9901.<br><br>Constraints<br><br>1 &lt; N &lt; 100 001<br>0 &lt; H &lt; 100 000 001<br>The height of any box is a strictly positive integer and does not exceed 100 000 000","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2\n1 \n3 \n7 \n5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nExplanation\n\nThere are 4 possibilities:\n1 3\n1 3 5\n3 5\n7 5\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+3+-+Host+by+WHU+&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 3 - Host by WHU  </a> ","type":"source","format":"html","require":["katex"]}]}