{"title":"Top Shooter","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2863","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2863&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2863","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2863"},"statement":[{"title":"Problem Description","content":"Since the Border War in 1962, Both China and India abide by the principle of no-expansion of military power, but India&apos;s recent actions are obviously going against this principle. Indian Prime Minister Singh delivered a speech in Congress, said that &quot;regardless of face of China or other countries, India will, by all means to ensure the territorial integrity, national unity and security.&quot;<br>At the same time, India increases more than sixty thousand troops to the southern Tibetan, including the construction of five airports and advanced landing field. Obviously this behavior undermines the trust between the two countries. Aggressive as a result of India, China announced the establishment of commando in Tibet!<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/problem-2863.JPG\"></center>  <br><br>The commando consists of N snipers. Messages show that Indian will send airborne to our Border. Our Army organizes the commando ambushing in the mountains.<br>A sniper can only hit the target in his field of vision. And will not be able to hit the target outside his field of vision<br>As the captain of the commando, how will you show your talent to win the battle?<br><br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of several test cases. The first line of each case contains two integers N, M (1&lt;=N&lt;=50, 1&lt;=M&lt;=1000), N representing the number of snipers, M representing the number of airborne. The next line contains N numbers (Hi,(1&lt;=i&lt;=N)), representing each sniper&#xFFFD;&#xFFFD;s field of vision.(the field of vision Hi means that the sniper can only see the target higher than or equal to Hi meters), The next M lines contain a pair of integers(Ai,Hi) each, representing the airborne i (1&lt;=i&lt;=M) begin to fall at the moment Ai, and from the height Hi,(1&lt;=Ai&lt;=100,1&lt;=Hi&lt;=500).<br>We assume that each airborne falls one meter per second, a sniper can only hit one target per second.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Output the maximum number of airborne the sniper team can hit.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 5\n1 9\n1 2\n1 2\n1 2\n2 2\n2 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+7+-+Host+by+FZU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 7 - Host by FZU </a> ","type":"source","format":"html"}]}