{"title":"Great World of Goo","time_limit":2000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2878","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2878&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2878","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2878"},"statement":[{"title":"Problem Description","content":"The game is built around the idea of creating large structures using balls of goo. It is based on the prototype game Tower of Goo developed for Kyle Gabler&apos;s rapid game prototyping Experimental Gameplay Project. The game is divided into five chapters, each containing several levels. Each level has its own graphic and musical theme, giving it unique atmosphere, similar in style to Tim Burton&apos;s film designs. There is also a bonus meta-game called World of Goo Corporation, where the objective is to build the highest tower using goo balls which the player collected through the course of the game. Players from all over the world can compete, as the height of the tower and number of goo balls used are being constantly uploaded to the 2D Boy server.<br>--Wikipedia<br>As mentioned above, World of Goo is an excellent independent game. Personally I like playing it rather than Plants vs. Zombies though both of them are great.<br>Let&#x2019;s consider a simplified version of &#x201C;Fisty Bog&#x201D; in Chapter One (Figure 1).<br><br><br>(Figure 1)<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/convip3-1007-1.JPG\"></center> <br>Ignore the part before the red line, as it&#x2019;s given by the system initially. The following goo balls make the bridge using regular triangles, numbered from 1, beginning from left to right. To ensure the bridge formed strictly horizontal, we place a light goo ball every three triangles, and in this problem we don&#x2019;t need to care about those balls.<br><br>From the figure we know that, some triangles are more danger during the construction process. For that case, goo balls want to be placed in different triangles. Risky goo balls want to be placed on the triangle more danger while others want safer ones. Now, my question comes, how many number of solutions exist when all goo balls are used and all wills are satisfied.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line: and integer k (k&lt;=15) indicates the number of test case;<br>For each test case:<br>First line: n and m, 0&lt;m,n&lt;=500 , n represents the number of goo balls, m represents the number of wills;<br>Line 2&#x2026;m+1:<br>Each line is consist of integers K A1 B1 A2 B2 &#x2026; AK BK P C1 D1 C2 D2 &#x2026; CP DP, represents a restriction. That means the goo ball(s) numbered between A1 and B1 (inclusive), or between A2 and B2 (inclusive) or &#x2026; or between Ak and Bk (inclusive) wants to be placed at triangle(s) number between C1 and D1 (inclusive), or between C2 and D2 (inclusive) or &#x2026; or between Ck and Dk (inclusive). Two restrictions may be the same or partly same. Every restriction is legal.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output one line with following rules.<br>Because in the world of goo, they only used 16bit system, which means the max number can be stored in one unit is 2^16-1. So when the number of solutions exceeds 2^16-1, we must output &#x201C;OVERFLOW!&#x201D;, otherwise, output the accurate number of solutions.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n6 1\n1 1 6 1 1 4\n6 1\n1 1 6 1 1 3\n10 1\n1 1 10 1 1 8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">720\n0\nOVERFLOW!</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+8+-+Host+by+BJNU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 8 - Host by BJNU </a> ","type":"source","format":"html","require":["katex"]}]}