{"title":"kebab","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2883","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2883&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2883","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2883"},"statement":[{"title":"Problem Description","content":"Almost everyone likes kebabs nowadays (Here a kebab means pieces of meat grilled on a long thin stick). Have you, however, considered about the hardship of a kebab roaster while enjoying the delicious food? Well, here&apos;s a chance for you to help the poor roaster make sure whether he can deal with the following orders without dissatisfying the customers.<br><br>Now N customers is coming. Customer i will arrive at time si (which means the roaster cannot serve customer i until time si). He/She will order ni kebabs, each one of which requires a total amount of ti unit time to get it well-roasted, and want to get them before time ei(Just at exactly time ei is also OK). The roaster has a big grill which can hold an unlimited amount of kebabs (Unbelievable huh? Trust me, it&#x2019;s real!). But he has so little charcoal that at most M kebabs can be roasted at the same time. He is skillful enough to take no time changing the kebabs being roasted.  Can you help him determine if he can meet all the customers&#x2019; demand?<br><br>Oh, I forgot to say that the roaster needs not to roast a single kebab in a successive period of time. That means he can divide the whole ti unit time into k (1&lt;=k&lt;=ti) parts such that any two adjacent parts don&#x2019;t have to be successive in time. He can also divide a single kebab into k (1&lt;=k&lt;=ti) parts and roast them simultaneously. The time needed to roast one part of the kebab well is linear to the amount of meat it contains. So if a kebab needs 10 unit time to roast well, he can divide it into 10 parts and roast them simultaneously just one unit time. Remember, however, a single unit time is indivisible and the kebab can only be divided into such parts that each needs an integral unit time to roast well.<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. The first line of each case contains two positive integers N and M. N is the number of customers and M is the maximum kebabs the grill can roast at the same time. Then follow N lines each describing one customer, containing four integers: si (arrival time), ni (demand for kebabs), ei (deadline) and ti (time needed for roasting one kebab well). <br><br>There is a blank line after each input block.<br><br>Restriction:<br>1 &lt;= N &lt;= 200, 1 &lt;= M &lt;= 1,000<br>1 &lt;= ni, ti &lt;= 50<br>1 &lt;= si &lt; ei &lt;= 1,000,000<br>","type":"input_format","format":"html"},{"title":"Output","content":"If the roaster can satisfy all the customers, output &#x201C;Yes&#x201D; (without quotes). Otherwise, output &#x201C;No&#x201D;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 10\n1 10 6 3\n2 10 4 2\n\n2 10\n1 10 5 3\n2 10 4 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes\nNo</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+9+-+Host+by+HIT&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 9 - Host by HIT </a> ","type":"source","format":"html"}]}