{"title":"Orefield Design","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2884","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2884&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2884","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2884"},"statement":[{"title":"Problem Description","content":"The XYZ Corporation has found 5 rare minerals, which are located on different regions of several islands along the East Coast of the Pacific. The company believes that it would be a best opportunity to gain profits. However, due to the financial crisis, the company does not have enough manpower or money spending in building orefields on all the islands. Therefore, the Committee has chosen some islands that have relatively higher ore storages, and sent one investigator to each of these islands to make a survey of the ore distribution on the island. The survey results show that each island has many villages which are connected with paths. Because of the time consuming, the investigator does not record all the paths on his map. Instead, according to his map, there is one and only one way to go from one village to another(map is drawn like a tree).<br><br>The company plans to establish a sub-plant on one of the villages in each of the chosen islands. All the 5 rare minerals dug from different locations of that island will be sent to this sub-plant, and after being made into a kind of compound metal. To minimize the cost on building transportation road, the company decides to broaden the original paths rather than constructing new roads. Moreover, the company determines to build the orefields in the villages to make sure they can hire enough workers. (If the sub-plant is located in one village, the orefields can also be built in that village.)<br><br>Since the ore storages in these islands are very high, each kind of rare minerals only needs one orefield. Now given the maps of the chosen islands, you need to find the most appropriate village as the sub-plant on each island, and broaden a shortest length of paths to meet the needs of all the 5 rare minerals.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input contains multiple test cases.<br><br>For each test case:<br><br>- The first line contains a positive integer n (5&lt;=n&lt;=1000), which means the number of villages on the island.<br><br>- The second line contains n positive integer m1, m2, ... mn(0&lt;=mi&lt;=5), which indicates which kind of rare minerals that village has. eg. The i-th input mi means the i-th village has the mi-th rare mineral; 0 for the village that does not have rare mineral. (Every village has at most one kind of rare mineral.)<br><br>- The following n-1 lines (from the 3rd to the n+1-th line)<br><br>Each line contains 3 positive integers x, y, d(1&lt;=x, y&lt;=n, 1&lt;=d&lt;=10000), which means the distance between the x-th village and the y-th village is a path with the length d.<br><br>Value of n = 0 terminate input.<br><br>Note: you can assume that all the given island has all the 5 minerals.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output one line with a positive integer that indicates the shortest length of the paths needed to be broadened.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n1 2 3 4 5 5\n1 2 100\n2 3 82\n3 4 73\n4 5 120\n4 6 108\n6\n1 1 2 3 4 5\n1 2 56\n1 3 100\n1 4 100\n2 5 100\n3 6 100\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">363\n456</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+9+-+Host+by+HIT&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 9 - Host by HIT </a> ","type":"source","format":"html","require":["katex"]}]}