{"title":"Message","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2901","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2901&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2901","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2901"},"statement":[{"title":"Problem Description","content":"When little Sascha grew up, she lost her bad habit of pronouncing words in ways that were most easy for her, but did not always match the correct-pronunciation. However, she never lost the linguistic creativity she used to show as a little girl. When the Earth Allied Forces (EAF) discovered she also had brilliant mathematical insights and a knack for puzzles and secret messages,she was immediately offered the position of Head of the EAF Intelligence Department.<br><br> Sascha&apos;s current task is interpreting intercepted internal messages of the hostile Mars Feder-ation. Although Martian messages always consist of just one word, her task turns out not to be easy, as two factors in uence the content of the intercepted message: <br><br>a) Extraterrestrial environment conditions are so bad that errors can occur in intercepted messages, causing them to be quite obfuscated compared to the originally sent text. If such errors occur, the erroneous characters will be characters from the Martian alphabet, just as the original characters. <br><br>b) Furthermore, linguistic characteristics play an important role. In Martian, there are relations between two subsequent characters: for a given character, some characters are more likely predecessors than others (note that something similar occurs in English: for example, a `h&apos; in a word will more likely have been preceded by a &apos;t&apos; than by a `q&apos;). <br><br>Fortunately, probabilities that a received character y actually was sent as an original Martian character x is known for all alphabet characters, as well as the probabilities that a certain character xi occurs in a clean Martian word if it was preceded by a Martian character x(i-1).<br><br>Given all these probabilities, Sascha wants to  nd the so-called maximum likelihood text for a received message, which is the most likely message the Martians originally sent. As senior pro-grammer in the EAF Intelligence Department, you must write a program for her, achieving this goal for several intercepted messages in several local Martian dialects. <br><br>To give a simple example, consider a local Martian alphabet only consisting of the characters &#xFFFD;&#xFFFD;a&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;b&#xFFFD;&#xFFFD; and let the receiving error probabilities and character succession probabilities be as shown in Table 2. If the intercepted message just consists of an `a&apos;, this can either originally have been an `a&apos; or a `b&apos;. With no previous characters available, only the error probabilities are considered: it then turns out that the maximum likelihood message is an `a&apos; as well, with probability 0.9.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/contest199-b.JPG\"></center><br><center>Table 2: Example Receiving Error Probabilities (left) and Character Succession Probabilities(right).</center><br><br>To extend the example, if the intercepted message was `ab&apos;, we also need the character succession probabilities. The probability that the original message was `aa&apos; is<br><br> <center>p(received `a&apos; indeed was originally sent as `a&apos;) </center><br><center>*p(received &apos;b&apos; was originally sent as `a&apos;) *p(character `a&apos; succeeds previous `a&apos;)</center><br> <center>= 0.9 * 0.1 * 0.8:</center><br><br>Similarly, the probability that the original message was `bb&apos;, `ab&apos; or `ba&apos; are 0.1 * 0.9 * 0.95, 0.9* 0.9 * 0.05 and 0.1 * 0.1 *0.2, respectively. Hence, the maximum likelihood message now is `bb&apos;. In all cases asked for, there will always be a unique maximum likelihood message.<br>","type":"description","format":"html"},{"title":"Input","content":"The _rst line of input consists of the integer number n, the number of test cases;<br><br>Then, for each test case:<br><br>- An integer number a (0 &lt; a &lt; 30), which is the number of characters in the local Martian alphabet; <br><br>- A line containing the a unique characters c1; c2; ..... ; ca of the local Martian alphabet,separated by single spaces. Whitespace characters will not occur in the alphabet;<br>-  a lines, specifying receiving error probabilities for the a alphabet characters in the orderin which they were presented. The ith line corresponds to the error probabilities for the original alphabet character ci and contains:<br><br>*  a floating point numbers ei1; ei2; .....; eia, separated by single spaces. Number eij(0 &lt;=eij &lt;= 1) indicates the probability that an observed character cj originally was sent as the character ci (hence <img style=\"max-width:100%;\" src=\"../../../data/images/contest199-b-1.JPG\">);  <br><br>- a lines, specifying character succession probabilities for the a alphabet characters in theorder in which they were presented. The ith line corresponds to the character succession probabilities for cases where the original alphabet character ci was the immediate predecessor and contains: <br><br>*  a  floating point numbers si1; si2; .... ; sia, separated by single spaces. Number sij indicates the probability that a certain character cj has character ci as immediate predecessor (hence <img style=\"max-width:100%;\" src=\"../../../data/images/contest199-b-2.JPG\">  ); <br><br>- An integer number w (0 &lt; w &lt; 50), indicating the number of intercepted messages in the local Martian alphabet specified; <br><br>- Then, for each intercepted message:<br><br>-  A line containing the intercepted message. These messages are non-empty, case-sensitive and will not exceed 300 characters in length.<br><br>Given _oating point numbers never have more than 10 decimal numbers following the separator  &apos;.&apos;","type":"input_format","format":"html"},{"title":"Output","content":"For each message in each test case, the output will consist of a single line with a single string: the maximum likelihood original Martian message given the intercepted message.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\na b\n0.9 0.1\n0.1 0.9\n0.8 0.05\n0.2 0.95\n2\na\nab</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">a\nbb</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2008&amp;source=1&amp;searchmode=source\"> BAPC 2008 </a> ","type":"source","format":"html"}]}