{"title":"The skatepark's new ramps","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2902","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2902&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2902","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2902"},"statement":[{"title":"Problem Description","content":"The local skating park has been given a  nancial incentive by the city to make the park interesting for skaters of all levels. The park wants to use the incentive to build a series of ramps, somewhat resembling a mountain range. When talking to some of the volunteers in the committee responsible for the project, you  find out they&apos;re having diffculties deciding about the best con guration of the ramps. They know the number of ramps to be built, and for each ramp they agree on the range of the height for that ramp. They are still discussing exactly how high each ramp should be, since they can&apos;t a ord to have them all at their highest, but they do want to spend all of the budget. This is the most important issue in the debate: they can&apos;t agree whether they want the di erences between the ramps to be small, to give the full ride a more consistent feeling, or as big as possible, to create a more diverse set of challenges. <br><br>You also notice they don&apos;t really have a good idea what the possibilities are, leaving them stranded in &apos;what-if&apos; discussions. You decide to help them out by showing them the options they have, both the ones where the di erence between the highest and lowest ramp is kept as small as possible, as well as the one where that di erence is as much as possible. Since the committee is mainly bickering over the allowable di erences, you decide to start out by just presenting them the minimum and maximum di erence-between the highest and lowest ramp. Luckily, the park has a lot of space, so you won&apos;t need to take the placement of the ramps into account. All ramps<br>have the same inclination, which is such that a ramp of height h will have a length 4h (measured at, not over the ramp).<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"  The  rst line of input consists of the integer number n, the number of test cases;<br>  Then, for each test case:<br>   A line with the integer number r (2 &lt;=r&lt;=10000), the number of ramps the park will place;<br>   A line with the integer number m (0 &lt;= m  &lt;=200000000 = 2*10^8), the number of cubic meters of concrete the park has money for; <br>   r lines with two numbers, l and t (0.00 &lt;=l &lt;=t  &lt;= 100.00), separated by one space, the minimum and maximum height in meters of the r-th ramp.<br><br>    You may assume all ramps are made entirely of concrete, and shaped as 1 meter wide prisms, with a triangle with two equal sides as base. A series of ramps within the given constraints and using all concrete is guaranteed to exist.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, the output contains one line with two numbers, separated by one space: the minimum difference between the highest and lowest ramp and the maximum difference between the highest and the lowest ramp. These numbers are rounded to two decimals.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\n36\n1.00 4.00\n1.00 4.00\n1.00 4.00</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.00 3.00\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div> \n<center><img src=\"../../../data/images/contest199-c.JPG\"></center> \nFigure 1: The example ramps with maximum difference.\n</div><i style=\"font-size:1px\"> </i> </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2008&amp;source=1&amp;searchmode=source\"> BAPC 2008 </a> ","type":"source","format":"html","require":["katex"]}]}