{"title":"Blackjack","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2905","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2905&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2905","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2905"},"statement":[{"title":"Problem Description","content":"In the game of blackjack you play against the dealer. Blackjack is played with a regular deck of playing cards containing the cards 2, 3, 4, 5, 6, 7, 8, 9, 10,jack, queen, king and ace of various suits. (However the suits do not infiuence the game in any way.) The cards 2 through 10 have value 2 through 10. The jack, queen, and king cards have value 10. Each individual ace can count as either 1 or 11. We define the low value of a player as the lowest possible sum of the values of all the cards of a player, thus counting all aces as 1. The high value of a hand is the highest possible sum of the values that is still below 22, counting aces as 1 or 11 accordingly.<br><br>          In this problem a basic blackjack variant is considered; there is no splitting, doubling, insurance or &quot;blackjack&quot;. <br><br>         The goal of the game is to maximize your (expected) profit or mimimize your (even more expected) losses. One hand of the game is played as follows:<br>             <br> You place a bet of x euros;<br>            <br>  You get one card, then the dealer gets one card; <br>             <br> You get a second card, and finally the dealer gets a second card;<br>          <br>    As long as your low value is below 22, you have two options:<br>       <br>      &quot;Hit&quot;- take one extra card from the deck;<br>        <br>     &quot;Stand&quot;- take no more cards.<br>       <br>       If your low value is above 21, you lose bet and the hand ends immediately.<br>           <br>   Now the dealer will play his cards;<br>        <br>      As long as the high value of the dealer is below 17, the dealer takes an extra card from the deck;<br>         <br>     If the low value of the cards of the dealer is above 21, you receive 2x euros, making a profitof x euros;<br>        <br>      If the high value of the dealer is greater than than your high value, you lose the bet;<br>          <br>    If the high value of the dealer equals your high value, the bet is returned to you;<br>         <br>    If the high value of the dealer is less than than your high value, you receive 2x euros, making a profit of x euros;<br>         <br>    At the end of the hand, all used cards are placed on a &quot;discard pile&quot; and will not return into play.<br>        <br>    If at any time there are no cards left in the deck and the dealer has to get another card or you choose to get another card then the current hand is disregarded and the bet is returned to you.<br>       <br>     In this problem, the sequence of cards left in the deck is known to you. You have to write a program to help yourself play optimally (ie. maximize profit).<br>","type":"description","format":"html"},{"title":"Input","content":"  The  first line of input consists of the integer number n, the number of test cases;<br>      <br>  Then, for each test case:<br>           <br>   One line with three integers 0 &lt;=c&lt;=10,000 and 0  &lt;= p  &lt;= q&lt;=100: the number of cards left in the deck, the minimum bet and the maximum bet respectively;<br>            <br>  [c/60] lines with a total of c characters (&apos;2&apos;-&apos;9&apos;, &apos;T&apos;, &apos;J&apos;, &apos;Q&apos;, &apos;K&apos;, &apos;A&apos;), representing the sequence of cards in the deck. The  first character on the  first line represents the  first card that will come off  the deck. Only the last line may contain less than 60 characters.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, the output contains one line with one number: the highest possible pro\u001ct.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n4 1 15\nTTA8</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">15</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2008&amp;source=1&amp;searchmode=source\"> BAPC 2008 </a> ","type":"source","format":"html"}]}