{"title":"Traveling Cube","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2913","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2913&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2913","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2913"},"statement":[{"title":"Problem Description","content":"On a small planet named Bandai, a landing party of the starship Tadamigawa discovered colorful cubes traveling on flat areas of the planet surface, which the landing party named beds. A cube appears at a certain position on a bed, travels on the bed for a while, and then disappears. After a longtime observation, a science officer Lt. Alyssa Ogawa of Tadamigawa found the rule how a cube travels on a bed.<br><br>A bed is a rectangular area tiled with squares of the same size.<br><br> One of the squares is colored red,<br><br> one colored green,<br><br> one colored blue,<br><br> one colored cyan,<br><br> one colored magenta,<br><br> one colored yellow,<br><br> one or more colored white, and<br><br> all others, if any, colored black.<br><br>Initially, a cube appears on one of the white squares. The cube&#x2019;s faces are colored as follows.<br> top red<br> <br> bottom cyan<br> <br> north green<br> <br> south magenta<br> <br> east blue<br> <br> west yellow<br><br> The cube can roll around a side of the current square at a step and thus rolls on to an adjacent square. When the cube rolls on to a chromatically colored (red, green, blue, cyan, magenta or yellow) square, the top face of the cube after the roll should be colored the same. When the cube rolls on to a white square, there is no such restriction. The cube should never roll on to a black square.<br><br> <br> Throughout the travel, the cube can visit each of the chromatically colored squares only once, and any of the white squares arbitrarily many times. As already mentioned, the cube can never visit any of the black squares. On visit to the final chromatically colored square, the cube disappears. Somehow the order of visits to the chromatically colored squares is known to us before the travel starts. Your mission is to find the least number of steps for the cube to visit all the chromatically colored squares in the given order.","type":"description","format":"html"},{"title":"Input","content":"The input is a sequence of datasets. A dataset is formatted as follows:<br><br>w d<br><br>c11 &#xB7; &#xB7; &#xB7; cw1<br><br>...<br><br>...<br><br>c1d &#xB7; &#xB7; &#xB7; cwd<br><br>v1v2v3v4v5v6<br><br>The first line is a pair of positive integers w and d separated by a space. The next d lines are w-character-long strings c11 &#xB7; &#xB7; &#xB7; cw1,. . . , c1d &#xB7; &#xB7; &#xB7; cwd with no spaces. Each character cij is one of the letters r, g, b, c, m, y, w and k, which stands for red, green, blue, cyan, magenta, yellow, white and black respectively, or a sign #. Each of r, g, b, c, m, y and # occurs once and only once in a dataset. The last line is a six-character-long string v1v2v3v4v5v6 which is a permutation of &#x201C;rgbcmy&#x201D;.<br><br>The integers w and d denote the width (the length from the east end to the west end) and the depth (the length from the north end to the south end) of a bed. The unit is the length of a side of a square. You can assume that neither w nor d is greater than 30.<br><br>Each character cij shows the color of a square in the bed. The characters c11, cw1, c1d and cwd correspond to the north-west corner, the north-east corner, the south-west corner and the southeast corner of the bed respectively. If cij is a letter, it indicates the color of the corresponding square. If cij is a #, the corresponding square is colored white and is the initial position of the cube. The string v1v2v3v4v5v6 shows the order of colors of squares to visit. The cube should visit the squares colored v1, v2, v3, v4, v5 and v6 in this order.<br><br><br>The end of the input is indicated by a line containing two zeros separated by a space.","type":"input_format","format":"html"},{"title":"Output","content":"For each input dataset, output the least number of steps if there is a solution, or &#x201C;unreachable&#x201D; if there is no solution. In either case, print it in one line for each input dataset.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10 5\nkkkkkwwwww\nw#wwwrwwww\nwwwwbgwwww\nkwwmcwwwkk\nkkwywwwkkk\nrgbcmy\n10 5\nkkkkkkkkkk\nk#kkkkkkkk\nkwkkkkkwwk\nkcmyrgbwwk\nkwwwwwwwwk\ncmyrgb\n10 5\nkkkkkkkkkk\nk#kkkkkkkk\nkwkkkkkwkk\nkcmyrgbwwk\nkwwwwwwwwk\ncmyrgb\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9\n49\nunreachable</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Asia+Regional+Aizu&amp;source=1&amp;searchmode=source\"> 2008 Asia Regional Aizu </a> ","type":"source","format":"html"}]}