{"title":"Tobo or not Tobo","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2918","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2918&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2918","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2918"},"statement":[{"title":"Problem Description","content":"The game of Tobo is played on a plastic board designed into a 3 &#xD7;  3 grid with cells numbered from 1 to 9 as shown in figure (a). The grid has four dials (labeled ``A&quot; to ``D&quot; in the figure.) Each dial can be rotated in 90 degrees increment in either direction. Rotating a dial causes the four cells currently adjacent to it to rotate along. For example, figure (b) shows the Tobo after rotating dial ``A&quot; once in a clockwise direction. Figure (c) shows the Tobo in figure (b) after rotating dial ``D&quot; once in a counterclockwise direction. <br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con208-1001-1.JPG\"></center><br><br><br>Kids love to challenge each other playing the Tobo. Starting with the arrangement shown in figure (a), (which we&apos;ll call the standard arrangement,) one kid would randomly rotate the dials, X  number of times, in order to ``shuffle&quot; the board. Another kid then tries to bring the board back to its standard arrangement, taking no more than X  rotations to do so. The less rotations are needed to restore it, the better. This is where you see a business opportunity. You would like to sell these kids a program to advise them on the minimum number of steps needed to bring a Tobo back to its standard arrangement. ","type":"description","format":"html"},{"title":"Input","content":"Your program will be tested on one or more test cases. Each test case is specified on a line by itself. Each line is made of 10 decimal digits. Let&apos;s call the first digit Y . The remaining 9 digits are non-zeros and describe the current arrangement of the Tobo in a row-major top-down, left-to-right ordering. The first sample case corresponds to figure (c).<br><br>The last line of the input file is a sequence of 10 zeros. ","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the result using the following format:<br><br><br>k . R<br><br><br>where k is the test case number (starting at 1,) is a single space, and R is the minimum number of rotations needed to bring the Tobo back to its standard arrangement. If this can&apos;t be done in Y dials or less, then R = -1. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3413569728\n1165432789\n0000000000</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1. 2\n2. -1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ANARC&amp;source=1&amp;searchmode=source\"> 2008 ANARC </a> ","type":"source","format":"html"}]}