{"title":"Musical Chairs","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2925","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2925&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2925","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2925"},"statement":[{"title":"Problem Description","content":"In the traditional game of Musical Chairs, N + 1  children run around N  chairs (placed in a circle) as long as music is playing. The moment the music stops, children run and try to sit on an available chair. The child still standing leaves the game, a chair is removed, and the game continues with N  children. The last child to sit is the winner.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con208-1008-1.JPG\"></center><br>In an attempt to create a similar game on these days&apos; game consoles, you modify the game in the following manner: N Children are seated on N chairs arranged around a circle. The chairs are numbered from 1 to N . Your program pre-selects a positive number D . The program starts going in circles counting the children starting with the first chair. Once the count reaches D , that child leaves the game, removing his/her chair. The program starts counting again, beginning with the next chair in the circle. The last child remaining in the circle is the winner.<br><br><br>For example, consider the game illustrated in the figure above for N = 5 and D = 3 . In the figure, the dot indicates where counting starts and &#xD7; indicates the child leaving. Starting off, child #3 leaves the game, and counting restarts with child #4. Child #1 is the second child to leave and counting restart with child #2 resulting in child #5 leaving. Child #2 is the last to leave, and child #4 is the winner. Write a program to determine the winning child given both N and D . ","type":"description","format":"html"},{"title":"Input","content":"Your program will be tested on one or more test cases. Each test case specifies two positive integers N  and D  on a single line, separated by one or more spaces, where N, D &lt; 1, 000, 000 .<br><br>The last line of the input file contains two 0&apos;s and is not part of the test cases. ","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, write the winner using the following format:<br><br><br>N D W<br><br><br>Where N and D are as above, is a space character, and W is the winner of that game. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 3\n7 4\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 3 4\n7 4 2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ANARC&amp;source=1&amp;searchmode=source\"> 2008 ANARC </a> ","type":"source","format":"html"}]}