{"title":"Gargoyle","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2934","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2934&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2934","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2934"},"statement":[{"title":"Problem Description","content":"Gargoyles can trace their history back many thousands of years to ancient Egypt, Greece, and Rome. Terra cotta waterspouts were formed in the shapes of animals such as lions and birds to serve the physical function of running the<br>rainwater away from the walls and foundations of buildings, and the spiritual function of protecting from evil forces.<br>Have you ever dreamed of creating your own castle with a lot of beautiful gargoyles on the walls? To your knowledge,<br>the speed of water coming out of each gargoyle should be identical, so an elaborately designed water system is required.<br>The water system consists of a huge reservoir and several interconnecting water pipes. Pipes cannot save water, so the total incoming and outgoing speed of water should be equal at each connection.<br>All the water from gargoyles flows into the reservoir, which is located at the bottom of the castle. Some pipes are connecting the reservoir, but water can only go from the reservoir to pipes, but never from pipes back to the reservoir. A micro-processor is installed inside each pipe, so the speed of water could easily be controlled. However, the microprocessors consume electricity. The exact cost in each pipe is proportional to the speed of water. If the cost constant in the i-th pipe is ci, the electricity cost in that pipe is civi, where vi is the speed of water in that pipe. Write a program to find the optimal configuration of the water system (i.e. the water speed in each pipe) of your dream castle, so that the total cost is minimized. It is always possible to build a water system.","type":"description","format":"html"},{"title":"Input","content":"The input consists of several test cases. The first line of each case contains three integers n, m and k (1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 25, 1 &#xFFFD;&#xFFFD; m &#xFFFD;&#xFFFD; 50, 1 &#xFFFD;&#xFFFD; k &#xFFFD;&#xFFFD; 1000), the number of gargoyles, the number of pipe connections and the number of pipes. The following k lines each contains five integers a, b, l, u, c (0 &#xFFFD;&#xFFFD; a, b &#xFFFD;&#xFFFD; n + m, 0 &#xFFFD;&#xFFFD; l &#xFFFD;&#xFFFD; u &#xFFFD;&#xFFFD; 100, 1 &#xFFFD;&#xFFFD; c &#xFFFD;&#xFFFD; 100), describing each pipe. a and b<br>are the incoming and outgoing vertex number (reservoir is 0, gargoyles are numbered 1 to n, pipe connections are numbered n + 1 to n + m), lower-bound and upper-bound of water speed, and the cost constant. No pipe connects two identical vertices. For every pipe, the incoming vertex will never be a gargoyle, and the outgoing vertex will never be the reservoir. For every pair of vertices, there could be at most one pipe connecting them (if a pipe is going from a to b, no pipes can go from a to b, or from b to a). The last test case is followed by a single zero, which should not be processed.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the case number and minimal cost to two decimal places.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 1 4\n0 4 8 15 5\n4 1 2 5 2\n4 2 1 6 1\n4 3 3 7 2\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 60.00</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Xi-An&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Xi-An </a> ","type":"source","format":"html"}]}