{"title":"Campus Recruit","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2939","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2939&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2939","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2939"},"statement":[{"title":"Problem Description","content":"With the new recruiting season&apos;s coming, lots of famous corporations come on campus to recruit new employees.<br><br>There are m corporations numbered from 1 to m, each of which has certain available positions for hiring students. The total number of the available positions is P. There are n students numbered from 1 to n. It is guaranteed that P &#x2264; n. Each corporation has a different preference for each student, which is denoted by an positive integer; the bigger the better. Each student has a different preference for each corporation, which is denoted by an positive integer; the bigger the better. All the preference numbers are not greater than 10,000.<br><br><br>The task, naturally, is to find a way of assigning each student to at most one corporation. In such a way, all available positions in all corporations are filled. Meanwhile we hope the assignment is stable. We say that the assignment is stable if neither of the following situations arises.<br><br><br>First type of instability: There are two students s and s&apos;, and a corporation c. The assignment is instable if<br><br>- s is assigned to c, and<br><br>- s&apos; is assigned to no corporation, and<br><br>- c prefers s&apos; to s.<br><br>Second type of instability: There are two students s and s&apos;, and two corporations c and c&apos;. The assignment is instable if<br><br>- s is assigned to c, and<br><br>- s&apos; is assigned to c&apos;, and<br><br>- c prefers s&apos; to s, and<br><br>- s&apos; prefers c to c&apos;.<br><br>We would like to find a stable assignment. Can you solve it?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains several cases. The first line of each case contains two integers m (1 &#x2264; m &#x2264; 100) and n (1 &#x2264; n &#x2264; 1000), indicating the number of corporations and students. This is followed by one line, containing m integers, in which the ith number indicates the number of available positions of ith corporation. This is followed by m lines, each containing n integers, in which the jth element of the ith line indicates the preference of the ith corporation to the jth student. This is followed by n lines, each containing m integers, in which the jth element of the ith line indicates the preference of the ith student to the jth corporation. The input ends with m=0 and n=0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output one line, containing n integers separated by exactly one space, in which the ith number indicates the corporation the ith student is assigned to (0 means the ith student is assigned to no corporation). Please output a new blank line after each case. If there are several solutions to one case, you may output any one of them.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3\n1 1\n3 2 1\n2 3 1\n1 2\n2 1\n1 2\n2 3\n1 1\n3 2 1\n2 3 1\n1 2\n2 1\n1 2\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2 0\n\n1 2 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Xi-An+%A3%A8Preliminary%A3%A9&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Xi-An &#xFF08;Preliminary&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}