{"title":"Motif Finding","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2941","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2941&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2941","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2941"},"statement":[{"title":"Problem Description","content":"Cell differentiation and development are fundamentally controlled by gene regulation. Only a subset of genes in the genome is expressed in a cell at a given time under given conditions. Regulatory sites on DNA sequence normally correspond to shared conservative sequence patterns among the regulatory regions of correlated genes. We call these conserved sequence motifs. The actual regulatory DNA sites corresponding to a motif are called the instances of that motif. <br>Identifying motifs and corresponding instances are very important, so biologists can investigate the interactions between DNA and proteins, gene regulation, cell development and cell reaction.<br><br><br>Given two equal-length strings, the Hamming Distance is the number of positions in which the corresponding characters are different. For example, the Hamming Distance between &#x201C;ACTG&#x201D; and &#x201C;ATCG&#x201D; is 2 because they differ at the 2nd and 3rd positions.<br><br>Your task is to find a motif for a few DNA sequences. Every DNA sequence consists of only A, C, G, T. If a substring of DNA sequence S has the same length with motif P and their Hamming Distance is not more than d, we say that S includes an instance of P. Given n DNA sequences with length of l. Among them, m sequences are &#x201C;key sequences&#x201D;. You need to find out the motif P whose length is w, so that every key sequence includes an instance of motif P. What&#x2019;s more, the number of DNA sequences which include an instance of P should be as large as possible.<br><br> For example, n=7, m =7, l=40, w =8, d =2. The sequences are as follows (they are all key sequences):<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con210-1004-1.JPG\"></center> <br>The motif P is ATGCAACT.<br><br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several cases. The first line of each case contains three integers n (1 &#x2264; n &#x2264; 15), m (0 &#x2264; m &#x2264; n) and l (1 &#x2264; l &#x2264; 10,000). The second line contains two integers w (1 &#x2264; w &#x2264; 8) and d (0 &#x2264; d &#x2264; w). The third line contains m unique integers ranging from 0 to n-1, indicating the key sequences. <br><br>Then followed by n lines, in which each line contains one sequence. The input is terminated by three zeros.","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output the motif P in one line. If the solution is not unique, then output the lexicographically smallest one. If there is no answer, you should output &#x201C;No solution&#x201D;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2 4\n3 1\n0 2\nACTT\nCGTG\nCCCC\n3 2 4\n3 0\n0 2\nACTT\nCGTG\nCCCC\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">CCT\nNo solution</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Xi-An+%A3%A8Preliminary%A3%A9&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Xi-An &#xFF08;Preliminary&#xFF09; </a> ","type":"source","format":"html"}]}