{"title":"Box Betting","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2949","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2949&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2949","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2949"},"statement":[{"title":"Problem Description","content":"Theres a new delivery boy at your company, supposed to drive around delivering a specific number of items to difierent locations. He needs to deliver at least X of an item, while the truck can at most take Y of the item.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con211-1004-1.jpg\"></center> <br><br>If there are more, the truck is will to break down due to the weight. If there are less, that means he hasn&apos;t fulfilled the assignment. At the loading station, there&apos;s a row of boxes he can bring along. <br><br>Each box contains a specified number of items. This driver isn&apos;t the sharpest snail on the rock, however. Since he&apos;s also too shy to ask for help, he&apos;s decided to just choose one entirely random starting point in the row of boxes. Then he chooses a random end point among the boxes from the starting point to the end, inclusive. <br><br><br><br>All the boxes between those points (inclusive) are loaded onto the truck. You and the other employees have started betting on whether or not the truck breaks<br>down, he brings to few items along or if he should happen to be lucky enough to fulfil the assignment without any problems. This gets you wondering. What is the actual probability for each of these scenarios to occur? Assume for the sake of this problem that the driver will always be able to fit all the boxes into the truck (after all, he had to have SOME skill, seeing as he was hired).","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input will start with a line containing a single number T, the number of test cases.<br><br>Each test case consists of three lines. The first one contains a single number N, the number of boxes. The second line contains a sequence of N characters (A-Z), B1B2...BN (no whitespace), representing the amount of items in each of the boxes in the same order as they&apos;re located on the loading dock. An A represents an empty box, B a box with 1 item, and so on until Z, which represents a box with 25 items in it. The third line contains the two numbers L and U. L is the number of items the driver is supposed to deliver, while U is the maximum number of items the truck can take before it&apos;ll break down.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output three floating point numbers on a single line. The first number gives the probability that the driver succeeds, the second one that that he brings along too few items, and the third one that the truck breaks down.<br><br><br>Notes and Constraints<br><br> 0 &lt; T &lt;= 100<br><br> 1 &lt; B &lt;= 200000<br> <br>&apos;A&apos; &lt;= Ai &lt;= &apos;Z&apos;<br><br> 0 &lt;= L &lt;= U &lt;= 50000<br><br> Both the starting and ending points of the segment are chosen with a uniform<br>probability distribution.<br><br> Any answer within 10^-6 of the correct one will be accepted.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\nKCHA\n2 9\n3\nBCD\n4 5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.5 0.25 0.25\n0.16666667 0.72222222 0.11111111</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IDI+Open+2009&amp;source=1&amp;searchmode=source\"> IDI Open 2009 </a> ","type":"source","format":"html","require":["katex"]}]}