{"title":"Communication Channels ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2950","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2950&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2950","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2950"},"statement":[{"title":"Problem Description","content":"Classical information theory is based on the concept of a communication channel.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con211-1005-1.jpg\"></center> <br><br>Information theory is generally considered to have been founded in 1948 by Claude Shan-non in his seminal work, \\A Mathemati-cal Theory of Communication.&quot; The cen-tral paradigm of classical information theory is the engineering problem of the transmis-sion of information over a noisy channel. http://en.wikipedia.org/wiki/Information theory<br><br><br>In this problem, we will specifically consider one of the simplest possible noisy channels, namely the binary symmetric channel (BSC). A BSC transmits a sequence of bits, but each transmitted bit has a probability p of being fiipped to the wrong bit. This is called the crossover probability, as can be understood from the figure. We assume independent behaviour on difierent bits, so a communication of l bits has probability (1 - p)^l of being transmitted<br>correctly. Note that one can always assume that p &lt; 1/2, since a channel with p = 1/2 is totally useless, and a channel with p &gt; 1/2 can easily be transformed to a new channel having crossover probability 1 - p by just flipping all bits of the output.<br><br><br>Of course, it is still possible to communicate over a noisy channel. (In fact, you are doing it all the time!) To be able to do this, one has to add extra bits in order for the receiver to detect or even possibly correct errors. Example implementations of such a feature are parity bits, Cyclic Redundancy Checks (CRC) and Golay codes. <br><br>These are not relevant to this problem, however, so they will not be discussed here.<br><br>In this problem you must investigate the behaviour of a binary symmetric channel.","type":"description","format":"html"},{"title":"Input","content":"The first line of the input consists of a single number T, the number of transmissions.<br><br>Then follow T lines with the input and the output of each transmission as binary strings, separated by a single space.","type":"input_format","format":"html"},{"title":"Output","content":"For each transmission, output OK if the communication was transmitted correctly, or ERROR if it was transmitted incorrectly.<br><br>Notes and Constraints<br> <br>0 &lt; T &lt;= 100<br><br> All inputs and outputs has length less than 120.<br><br> T is encoded in decimal.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n10 10\n10 11</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">OK\nERROR</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IDI+Open+2009&amp;source=1&amp;searchmode=source\"> IDI Open 2009 </a> ","type":"source","format":"html"}]}