{"title":"Train Tickets","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2951","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2951&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2951","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2951"},"statement":[{"title":"Problem Description","content":"Tor Gunnar is a huge fan of trains. All his life, he&apos;s been running around at home yelling &quot;Toot Toot&quot;. So when he recently found out about a job opening at a local train company, he immediately applied. Tor Gunnar, having studied really hard to reach such opportunities, got the job. <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con211-1006-1.jpg\"></center> <br>It was the happiest moment of his life! To his great dissappointment, though, he discovered that the contract said nothing about riding trains all day. He is now assigned to the IT department, and is supposed to help write a new ticket management system. The part he is supposed to write, is an algorithm for distributing tickets among the difierent possible travels along a train route.<br><br><br>Tor Gunnar comes from a strange country. In addition to speaking a language even he himself doesn&apos;t understand, the countrys government has pushed through some weird laws that influences how train tickets are sold. This means that the price for travelling from station A to station B is predetermined. Also, everytime you sell tickets for a given trip, you&apos;ll know the exact demand for travelling between each pair of cities. What more, the government is allowed to set aside some tickets for their own usage (these are free of<br>charge).<br><br><br><br>One train trip consists of a series of stations. It is possible to travel from station A to B as long as A precedes B in the station list. Each train has a given capacity, and there can never be more than this amount of passengers in between two adjacent stations.<br><br><br>Tor Gunnar is completely puzzled, and desperately needs your help. Write a program that helps him figure out the best ticket distribution.","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a single number T, the number of test cases to follow.<br> <br><br>Each test case begins with a line containing two numbers, N and P, the number of stations in the case and the capacity of the train, respectively. Then follow N - 1 lines, giving the ticket prices, Cij . The i-th of these N lines contain N - i numbers. The j-th number of the i-th line is the cost of a ticket from station i to station i + j. The next N - 1 lines give the demand for tickets for each pair of stations, Dij , in the same format as the prices.<br><br><br> Another N - 1 lines in the same format follow these, statin the number of tickets set aside for the government officials, Oij .<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single number on a line by itself. The number should equal the maximum possible income from the train trip.<br><br>Notes and Constraints<br> 0 &lt; T &lt;= 100<br> 3 &lt;= N &lt;= 16<br> 0 &lt; P &lt;= 200<br> 0 &lt; Cij &lt;= 1000<br> 0 &lt;= Dij &lt;= 250<br> 0 &lt;= Oij &lt;= 20<br> A train trip goes from station 1 to station N.<br> <br>Keep in mind that the passenger count including the government officials cannot be more than the capacity.<br> You are not allowed to overbook the train. The government will never overbook your train using their &quot;free&quot; tickets.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 1\n3 4\n2\n0 0\n0\n0 0\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IDI+Open+2009&amp;source=1&amp;searchmode=source\"> IDI Open 2009 </a> ","type":"source","format":"html"}]}