{"title":"Rubiks Cube","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2953","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2953&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2953","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2953"},"statement":[{"title":"Problem Description","content":"Following the hype generated by Rubiks Cube Norwegian Open Championship arranged at NTNU this year, each and every student at NTNU has bought such a cube. The professors, however, are dismayed, because the students rather play with their cube instead of listening to the professors lectures.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con211-1008-1.jpg\"></center> <br>One professor suddenly gets the idea that if he gives the students a program to solve their cubes they may lose interest in it, so that it will be possible to start teaching again. Of course, the professor don&apos;t want to do the grunt work of programming, and you are the lucky assignee of this task. <br><br><br>The professor takes away your cube, locks you in a faraway laboratory and says that you won&apos;t get out until you have written a program to solve Rubiks cube.<br><br><br>Luckily, the professor did not specify the size of the cube, so you decide to make the work slightly easier by solving the Rubiks 2 \u0002 2 \u0002 2 cube.","type":"description","format":"html"},{"title":"Input","content":"The first line of the input consists of a single number T, the number of test cases. Each test case consists of six lines describing the initial configuration of a cube, formatted exactly as in the example input. The characters used for colors are G, R, O, B, Y and W.<br><br>Each test case is followed by an empty line.","type":"input_format","format":"html"},{"title":"Output","content":"For each scenario, output a line with the minimum number of moves that is necessecary to solve the cube. A move is turning one face of the cube 90 degrees clockwise or counter-clockwise. (A turn of 180 degrees is considered to be two moves.)<br><br>Notes and Constraints<br> 0 &lt; T &lt;= 100<br> You may assume that all input cubes are scrambled versions of originally solved cubes with six diffierent colors. (Which means there are exactly four occurrences of each color and that it is possible to get the cube to a solved state using moves as described above.)","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nOO\nOO\nRR GG BB WW\nRR GG BB WW\nYY\nYY\nRR\nRR\nYY OO GG BB\nOO GG BB YY\nWW\nWW</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IDI+Open+2009&amp;source=1&amp;searchmode=source\"> IDI Open 2009 </a> ","type":"source","format":"html"}]}