{"title":"Marble Madness","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2954","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2954&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2954","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2954"},"statement":[{"title":"Problem Description","content":"oyvind likes to test his future employees, especially with funny games.<br> <br>This time he has invented a game where you start out with B black marbles and W white ones in a bag.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con211-1009-1.jpg\"></center> <br>You also have endless supplies of both kinds of marbles outside the bag. The game proceeds in rounds. In each round, you take two marbles at random out of the bag, and put one marble back in (possibly another color than any of the two you took out), obeying the following rules:<br><br>1. When you take out two white marbles, you put a black one back in.<br><br>2. When you take out one black and one white, you put a white marble back in.<br><br>3. When you take out two black marbles, you put a black one back in.<br><br>At the end of this game, there will only be one marble in the bag. This marble may be white with a probability and black with a probability given the number of marbles of each colour you start with. Your job is to find these probabilities.","type":"description","format":"html"},{"title":"Input","content":"The input will start with a line giving the number of test cases, T. Each test case will be presented at one line with two integers, B and W, separated by a single space, representing the number of black and white marbles respectively.","type":"input_format","format":"html"},{"title":"Output","content":"There should be one line of output for each test case with two floating point numbers separated by a single space. The first number should represent the probability that the last marble is black, and the second the probability that the last marble is white.<br><br>Notes and Constraints<br> 0 &lt; T &lt;= 100<br> 0 &lt;= B,W &lt;= 50000<br> 0 &lt; B +W<br> Any answer within 10^-6 of the correct one will be accepted.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 1\n3 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.00 1.00\n1.00 0.00</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IDI+Open+2009&amp;source=1&amp;searchmode=source\"> IDI Open 2009 </a> ","type":"source","format":"html"}]}