{"title":"Robot Encryption","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2956","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2956&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2956","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2956"},"statement":[{"title":"Problem Description","content":"Due to suspicion of cheaters, one of the more paranoid problem setters has started encrypting all messages to the rest of the jury before sending them. He didn&apos;t use any standard encryption, however, as he believes those are all part of a giant conspiracy network trying to crush IDI Open from the inside. <br><br>Instead, he based it on the fact that the cheaters are likely to be the worst programmers. The decryption requires some programming skill, and should<br>therefore be safe.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con211-1011-1.jpg\"></center> <br>Along with the encrypted message, he sent explanation of how to decrypt it. The only problem now is that not all jury members are able to implement the decryption. This is where we need your help.<br><br>You need to help us decrypt these messages by writing a program that does the task. Decryption is performed by simulating a robots movement on a grid. The robot is initially placed in the north-west corner of the grid, facing south. The robot is a simple one, and only accepts three dierent commands:<br><br> L turns the robot 90 angle to the left.<br><br> R turns the robot 90 angle to the right.<br><br> F moves the robot one square forward. If moving forward would cause the robot to fall of the grid, the robot instead makes a 180 angle turn without moving.<br><br>Instructions to the robot is given in a series of commandsets. A commandset is a string of commands, with the possible addition of loops. A loop is given on the form &quot;(commandset)number&quot; where number is the number of times the commandset inside the parentheses should be run. Longer sequences of commands can be built up recursively in this fashion. More formally:<br><br>commandset ::= instruction+<br><br>instruction ::= command | loop<br><br>loop ::= &quot;(&quot; commandset &quot;)&quot; number<br><br>command ::= R | L | F<br><br>number ::= 1 |2 | 3 | 4 | 5 | 6 | 7 | 8 | 9<br><br>The decrypted text is the text string obtained by concatenating the characters on the grid positions the robot stands on after executing each commandline.","type":"description","format":"html"},{"title":"Input","content":"The first line of input gives T, the number of test scenarios. Each scenario starts with a line containing W and H, separated by a single space, describing the dimensions of the grid. Then follows H lines, each consisting of W characters, making up the grid. After this comes a line containing N, the number of commandlines, followed by the N lines the robot will be executing.","type":"input_format","format":"html"},{"title":"Output","content":"One line per test scenario, containing the decrypted text.<br><br>Notes and Constraints<br>  0 &lt; T &lt;= 100<br>  0 &lt; W &lt;= 50<br>  0 &lt; H &lt;= 50<br>  0 &lt; N &lt;= 20<br><br> Commandlines will be no longer than 50 characters, and will follow the syntax given in the problem text.<br>  <br>No character with ASCII value lower than 32 or higher than 126 will appear on the robots grid.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n6 7\n012345\n6789AB\nCDEFGH\nIJKLMN\nOPQRST\nUVWXYZ\n_! .,&amp;\n12\nFFL(F)5\n(F)4\n(LF)2\n(L(R)6L)9\nRFRFFF\n(L(F)2)2\nLF\nFLFF\nFFFF\nLF\nFLFF\nL(F)4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">HELLO WORLD!</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IDI+Open+2009&amp;source=1&amp;searchmode=source\"> IDI Open 2009 </a> ","type":"source","format":"html"}]}