{"title":"When","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2963","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2963&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2963","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2963"},"statement":[{"title":"Problem Description","content":"&quot;When&quot; is an event driven language for machine control. It only has three statements: Set, Print, and the compound When clause. The (case insensitive) grammar is as follows<br><br>    PROGRAM := WHEN | PROGRAM WHEN<br>    WHEN := &apos;when &apos; EXPRESSION EOL STATEMENTS &apos;end when&apos; EOL<br>    STATEMENTS := STATEMENT | STATEMENTS STATEMENT<br>    STATEMENT := PRINT | SET<br>    PRINT := &apos;print &apos;  EXPRESSION_LIST EOL<br>    SET := &apos;set &apos; ASSIGNMENT_LIST EOL<br>    EXPRESSION_LIST := EXPRESSION | EXPRESSION_LIST &apos;,&apos; EXPRESSION<br>    ASSIGNMENT_LIST := ASSIGNMENT | ASSIGNMENT_LIST &apos;,&apos; ASSIGNMENT<br>    ASSIGNMENT := VARIABLE &apos;=&apos; EXPRESSION<br>    EXPRESSION := &apos;(&apos; EXPRESSION OP EXPRESSION &apos;)&apos; | VARIABLE | NUMBER <br>    OP :=  &apos;&lt;&apos; | &apos;+&apos; | &apos;-&apos; | &apos;and&apos; | &apos;or&apos; | &apos;xor&apos;<br>    VARIABLE := &apos;$&apos; NOT_DOLLAR_STRING &apos;$&apos;<br>    NUMBER := DIGIT | NUMBER DIGIT<br>    DIGIT := &apos;0&apos; | .. | &apos;9&apos;<br>    NOT_DOLLAR_STRING := any sequence of printing characters (including blanks)<br>                         that does not contain a $ symbol.<br><br>In the above, any string enclosed in single quotes are to be treated literally. EOL is the end of line.<br><br>In words, a program consists of a list of when blocks, which themselves contain set and print statements. Case is ignored for key words and variable names. Spaces are allowed before or after any literal except inside a number. Spaces are allowed in variable names, and each non-empty sequence of spaces is treated as a single underscore, so the following refer to the same variable<br><br>     <br>    $Remote Switch#1$ <br>    $Remote_Switch#1$ <br>    $Remote   switch#1$ <br><br>All variable and literal values are integers between -1000000000 and 1000000000, inclusively. All variables are global and initially zero. The when programs you will be tested on will never have an EXPRESSION that evaluates to a value outside of this range. The logical operators evaluate to 0 for false and 1 for true, and treat any nonzero value as true.<br><br>Running the When program amounts to executing all the active when clauses until none are active. More specifically, the active list of when clauses is initially empty, then the following steps are repeated:<br><br>    * In the order they appear in the program, the conditions of all when clauses that are not currently active are evaluated. If true, the clause is added to the end of the active list, with its first statement marked as &quot;ready&quot;. Each active when clause has one &quot;ready&quot; statement.<br>    * If the active list is empty after this step, the program terminates.<br>    * The &quot;ready&quot; statement from the &quot;current&quot; when clause (initially the first clause in the active list) is executed.<br>    * The statement marked as &quot;ready&quot; is advanced, removing the when clause from the active list if this is the last statement in the &quot;current&quot; when clause.<br>    * The when clause marked as &quot;current&quot; is advanced, cycling to the beginning of the active list if the end is reached.<br><br>In other words, inactive when conditions are evaluated to determine if these clauses are added to the active list. Then one statement (set or print) is executed from the current active when clause. If this is the last statement in that clause, it is removed from the active list. One the next iteration, one statement is executed from the next active when clause, etc.<br><br>A set statement executes all the assignments concurrently, so that<br><br>    set $x$=$y$,$y$=$x$<br><br>swaps the values of $x$ and $y$. The same variable cannot appear twice on the left hand part of the same set statement (so set $x$=1,$x$=2 is illegal).<br><br>A print statement evaluates and prints the given expressions in the output, separated by commas and followed by a new line. So<br><br>    &#xA0;&#xA0;print 1,(2+3)<br><br>results in the line<br><br>    &#xA0;&#xA0;1,5<br><br>in the output. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of several test cases separated by a blank line. Each of them is a single syntactically correct program. You may assume that the program will not execute more than 100000 set statements and 100000 print statements.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, print the output produced by executing the given program. Print a blank line between the output of the cases.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">When ($Mr. Bill$&lt;5)\n   Set $mr._bill$=($mr.  bill$+1),$Y$=($Y$+10)\nEnd When\nWhen ($mr. Bill$&lt;10)\n  Set $MR. BILL$=($mr. bill$+1)\n  Print $mr. bill$,$Y$\nEnd When</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3,20\n6,40\n7,40\n8,40\n9,40\n10,40</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+Rocky+Mountain+Regional&amp;source=1&amp;searchmode=source\"> 2008 Rocky Mountain Regional </a> ","type":"source","format":"html","require":["katex"]}]}