{"title":"Help Little Laura","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2982","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2982&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2982","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2982"},"statement":[{"title":"Problem Description","content":"Laura Luo has just invented a game. Given a beautiful pencil sketch with n points, you&apos;re to colorize it with water pens by painting circuits. Each time you paint a new circuit, starts with one point, follow some line segments and return to the starting point. Every point can be reached more than once, but every segment can be painted at most once. To make the picture look interesting, different segments must be painted different colors. For each segment, Laura has already decided a direction to paint it. The picture below illustrates a possible way to paint the picture (dashed lines are segments that are not painted).<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con216-1008-1.JPG\"></center><br><br>After you finish painting, your score is computed as follows: for each unit length you paint, you earn x points, for each color you use, you lost y points (Laura has prepared enough water pens of different colors).<br><br>Write a program to find the maximal score you can get. ","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. The first line of each case contains three positive integers n, x, y  (1&lt;=n&lt;=100, 1&lt;=x, y&lt;=1000) . The next n  lines each describe a point (points are numbered from 1 to n  in the order they appear in the input). The first two integers (x, y)  specify its coordinates (0&lt;=x, y&lt;=1000) . The rest integers are the points it connects to, ended by a zero. If point v  appears in the list of point u , there is a line segment connecting u  and v  (then there will not a segment connecting u  and v  in the reverse direction). Furthermore, Laura will paint it from u  to v . There will be no duplicated points and no more than 500 segments. The last test case is followed by a single zero, which should not be processed. ","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the case number and the maximal score you can get, to two decimal places. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 5 1 \n0 0 2 3 0 \n1 0 3 4 0 \n1 1 4 0 \n0 1 1 0 \n1 2 1 \n0 0 0 \n10 7 2 \n0 0 2 4 0 \n5 0 3 0 \n5 10 4 10 0 \n2 3 5 0 \n7 5 6 0 \n0 11 1 0 \n8 0 10 5 0 \n18 3 7 0 \n14 5 8 1 0 \n12 9 9 0 \n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 16.00 \nCase 2: 0.00 \nCase 3: 522.18</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2007+Asia+Regional+Beijing+&amp;source=1&amp;searchmode=source\"> 2007 Asia Regional Beijing  </a> ","type":"source","format":"html"}]}