{"title":"Food portion size ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2990","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2990&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2990","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2990"},"statement":[{"title":"Problem Description","content":"The university canteen does not want any student to leave the canteen hungry. Therefore, as long as a student is hungry, he can get another portion of food for free. The canteen uses a fixed food portion size, because it would take too much time to first ask a student how much food he wanted. It can happen that a student doesn&apos;t finish his last portion of food and the remainder has to be thrown away. <br><br>To minimize costs, the manager of the canteen wants to determine a food portion size S such that the amount of food that is wasted is small, but also the number of times the students have to fetch another portion of food is not too big. Note that these two goals can be conflicting: <br><ul><br><li>By choosing a very small food portion size, one does not waste food, but simultaneously the number of times the students have to fetch food is big. </li><li>By choosing a large food portion size, one can make sure each student has to fetch only one portion, but at the same time it may happen that a large quantity of food is wasted. </li><br></ul><br>The manager of the canteen has collected data about how many units of food each student eats. The problem to be solved can now be formulated mathematically as follows: Let x be the amount of food that is wasted, and y the number of times the students go to fetch food. Then, the goal is to minimize a &#xD7; x + b &#xD7; y, where a, b are weights that represent the relative importance of the two opposing goals. Note that x and y depend on the food portion size S and the quantities of food each student eats. We impose the additional constraint that no student should have to go more than 3 times to fetch food. <br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input file contains several test cases. Each test case starts with a line containing an integer n, (1 &#x2264; n &#x2264; 1000), the number of students eating in the canteen. The next line contains the values a and b (1 &#x2264; a, b &#x2264; 10). The third line of each test case consists of n integers y<sub>1</sub>, ..., y<sub>n</sub> (1 &#x2264; y<sub>i</sub> &#x2264; 100), where y<sub>i</sub> is the amount of food student i eats. Input is terminated by n=0. <br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case print one line containing the costs resulting from an optimal choice of the food portion size. Print each value as a reduced fraction. If the result is an integer, do not print the denominator 1. See the sample output for details. <br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n1 1\n3 7 1 9 12\n3\n10 1\n11 13 17\n2\n2 3\n6 3\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">35 / 2\n154 / 3\n9\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first sample input, the optimal food portion size is 4.5. \nNote that a food portion size of 3 would yield a smaller cost of 16, \nthe 5th student, however, would have to fetch food 4 times. \n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009%2F2010+Ulm+Local+Contest++&amp;source=1&amp;searchmode=source\"> 2009/2010 Ulm Local Contest   </a> ","type":"source","format":"html","require":["katex"]}]}