{"title":"Binary Search Tree","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=2998","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=2998&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=2998","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=2998"},"statement":[{"title":"Problem Description","content":"Suppose we&#x2019;ve got a special BST ( Binary Search Tree ), according to the definition, all the nodes in this BST has a bigger value than its left child and, at the same time, smaller than its right child.<br>On the other hand, every node in this special BST has a weight. For every node, its weight is smaller than either of its child.<br>If every value is different and so is the weight, we can get an interesting conclusion, when all weights and values of the nodes are determined, the BST is determined as well. Because such a tree can be seen as a BST inserted in the order of weight and sorted by value.<br>Another common sense, the depth of a node is defined by one plus its distance to the root. So the root&#x2019;s depth is one.<br>Well, it seems that this special BST is not special enough, obviously. I mean it&#x2019;s just a normal BST plus heap&#x2019;s characteristics. So I made it a little bit more difficult, only a little bit, trust me.<br>When dealing with a real-life problem, the access frequency of each node differs, and I&#x2019;ll set it on the node. We call the access cost of a node as its access frequency multiplies the depth of it, and the access cost of an entire special BST as the sum of all access cost of its nodes.<br>Now, I&#x2019;ll give you a data set contains all nodes&#x2019; value, weight and access frequency, and you can modify the weight of some nodes, but every modify operation needs K extra cost. You can modify the weight to any real number, however, after that, every weight must still be different from each other. Your task is pretty simple, tell what the minimum sum of the access cost of this special BST and the extra cost is after the modify operations.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains two positive integers N and K. N is the number of the nodes, and k is the extra cost needed for every modify operation. ( N&lt;=70, 1&lt;=K&lt;=30000000 )<br>Next three lines, each line has N non-negative integers, indicate the value, weight and access frequency of each node separately. And all this integers are below or equal to 400000. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"One number, the minimum sum according to the description.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 10\n1 2 3 4\n1 2 3 4\n1 2 3 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">29</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+19+-+Host+by+BNU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 19 - Host by BNU </a> ","type":"source","format":"html","require":["katex"]}]}