{"title":"Tracing Fairy","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3019","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3019&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3019","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3019"},"statement":[{"title":"Problem Description","content":"Fairy Kate was going to visit man&#xFFFD;&#xFFFD;s world. She informed her friend Conan but she didn&#xFFFD;&#xFFFD;t want him to pick her up, but to find her. She told Conan that she was driving a car in the town, but at a given moment, she would move the car from one place to another with teleporting magic and these two places were quite far away from each other. If Conan could find her, she would play with him. It was rather difficult for Conan. He got a series of photos of every block from uncle Maoli. Each group of photos was taken every centisecond in a very short period, in which, there were a lot of cars. While in some groups, there was a car teleporting in a given time and in other time other cars as well as the Fairy&#xFFFD;&#xFFFD;s all had a uniform motion in a straight line along the X or Y axes. However, Conan really felt puzzled, so he asked you, his friend Heiji Hattori, for help. Can you find in which moment the Fairy&#xFFFD;&#xFFFD;s car was teleporting but not having a uniform motion in a straight line? The truth is one and only! <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/exe3019-1.JPG\"></center>","type":"description","format":"html"},{"title":"Input","content":"Input several groups until you deal with EOF.<br><br>    In the first line of each group of data, there are two integers, n and m, (5 =&lt; n &lt;= 200,1 =&lt; m &lt;= 200) n standing for the number of photos in this group, m for the number of cars in these photos. And then, in n groups, each photo&#xFFFD;&#xFFFD;s data is given according to time sequence (the number of photos is 1 to n) and each group has m lines, each line two numbers which respectively represents a car&#xFFFD;&#xFFFD;s X and Y axes (they are not given according to car&#xFFFD;&#xFFFD;s numbers).","type":"input_format","format":"html"},{"title":"Output","content":"If in a given moment in photos, it is obvious that there is a car teleporting but not having a uniform motion in a straight line, then output: &quot;The fairy use magic at photo x.&quot;(X is the number of photos, 2 =&lt; x &lt;= n) Or else, output: &quot;The fairy did not appear on this group of photo.&quot; ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 2\n1 1\n2 2\n1 2\n3 2\n2 8\n4 2\n2 9\n5 2\n2 10\n6 2\n\n5 2\n1 3\n3 2\n3 3\n1 4\n1 5\n3 4\n3 5\n1 6\n1 7\n3 6</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">The fairy use magic at photo 3.\nThe fairy did not appear on this group of photo.\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\n\nIn the first group, obviously, there is a car teleporting but not having \na uniform motion in a straight line in a given moment in the third photo.\nIn the second one, two cars both have a uniform motion in a straight line \nalong the positive direction of Y axes at a speed of moving a unit in unit time.\n\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+12+-+Host+by+FZU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 12 - Host by FZU </a> ","type":"source","format":"html"}]}