{"title":"Dirt","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3023","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3023&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3023","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3023"},"statement":[{"title":"Problem Description","content":"-- Hello, may I speak to Petrov, please? Hello, my darling... You know, there was a little accident at our home... No, no, don&apos;t worry, your computer was not damaged. It is only a bit dirty there now. Well, I should say it&apos;s very dirty there and I&apos;m at my Mom&apos;s now. Of course, I&apos;ll clean it... When? Well, maybe when I have my vacation. What? Well, when we are back from Turkey... the next vacation then. I&apos;ll stay at Mother&apos;s until then, and you may live here also. No, no, I don&apos;t insist, sure, you may stay at home if you wish so. I prepared boots for you, they are at the door. But please, don&apos;t make it worse, before you step on a clean floor, change your boots, put on your slippers, they are at the door also. Take them with you when you walk through the dirt. And when you walk on a clean floor, take the boots with you. You see, the dirt is in different places. OK, my love? Thank you!<br><br>It is not a great pleasure to change boots each time you get from a clean floor to a dirty floor and vice versa, it&apos;s easier to walk extra several meters. So it is necessary to find a way of getting from one place in the apartment to another with the minimal possible number of boots changes; and among these paths the shortest one must be found.<br><br>To begin with, it is natural to determine an optimal way of passing the Most Important Route: from the computer to the refrigerator. ","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains two integers M and N, which are dimensions of the apartment (in meters), 1 &#x2264; N, M &#x2264; 1000. The two integers in the second line are the coordinates of the computer, and the third line contains the coordinates of the refrigerator. Each of the following M lines contains N symbols; this is the plan of the apartment. On the plan, 1 denotes a clean square, 2 denotes a dirty square, and 0 is either a wall or a square of impassable dirt. It is possible to get from one square to another if they have a common vertex. When you pass from a clean square to a dirty one or vice versa, you must change shoes. The computer and the refrigerator are not on the squares marked with 0.<br><br>The upper left square of the plan has coordinates (1, 1). ","type":"input_format","format":"html"},{"title":"Output","content":"You should output two integers in one line separated with a space. The first integer is the length of the shortest path (the number of squares on this path including the first and the last squares) with the minimal possible number of boots changes. The second number is the number of boots changes. If it is impossible to get from the computer to the refrigerator, you should output 0 0. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 7\n1 1\n3 7\n1200121\n1212020\n1112021</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8 4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+6+-+Host+by+WHU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 6 - Host by WHU </a> ","type":"source","format":"html"}]}