{"title":"To Be Or Not To Be","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3031","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3031&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3031","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3031"},"statement":[{"title":"Problem Description","content":"That&apos;s a question. Now Happy (Xi Yangyang) has been caught by Wolffy (Hui Tailang). As Wolffy is busy preparing the big meal, a good idea comes to Happy. He proposes a game that only Wolffy had won, he can eat Happy. Wolffy always believes he is the cleverest one, so they reach a consensus. And they both agree with Wolnie (Hong Tailang) when the referee. A theater will be beat to die by Wolnie&apos;s pan.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/exe3031-1.JPG\"></center><br><br>The game is defined as follow.<br><br>There are multiple test cases.<br><br>In each case there are R (R &lt; 10) rounds of the game, R is an odd number to guarantee that there must be a winner in the end.<br><br>In each round: There is a pile of n (10 &lt;= n &lt;= 200) Special-cards and m (1 &lt;= m &lt;= 100) piles of Point-card on the table. The Point-card piles are ordered from 1 to m. Wolffy and Happy take turns to get one card from the top of Special-cards pile. Wolffy always takes first in the game. When all the Special-cards have been taken, the round is over and the one with more cards in the hands gains one point. If there is a tie, Wolffy gains one point.(Wolffty and Happy both have 0 point before the game).<br><br>There are 5 kinds of Special-cards besides the Point-card in the game.<br><br>0) Point-card: a card with a point X (1 &lt;= X &lt;= 2000000).<br><br>1) Challenge-card: no matter who takes this card, they both take one card with the maximum point from their own hands. After a comparison, if Happy&apos;s card has a larger point, He takes all the Wolffy&apos;s in-hands cards, vice versa; If there is a tie no more operation.<br><br>2) Loss-card: the one who takes this card, He must throw a card with the maximum point.<br><br>3) Add-card: a card with P point, the one who gets this card will make the card with maximum point P point larger, i.e. if a Point-card with X point is the maximum, its point will change to X + P. An Add-card can only work on one Point-card.<br><br>4) Exchange-card: a card with Q point. The one who gets this card must change one maximum-point card&apos;s point to Q.<br><br>5) Take-card: a card with a integer K, indicates one can get the all the cards of Kth Point-card pile. In one round no two Take-card have the same K.<br><br>You can assume that when one gets the Loss-card, Add-card, Exchange-card, He has at least one card in the hands, when one gets a Challenge-card, they both have at least one card in the hands.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input<br><br>For each test case, the first line of input is an integer R, indicates the number of rounds:<br><br>Line 2: two integers n indicates the number of Special-cards, m indicates the number of Point-card piles.<br><br>Line 3: a line of m integers. The ith number Pi (1 &lt;= Pi &lt;= 10000)indicates the number cards of ith Point-card pile.<br><br>For the next m lines, ith line contains Pi numbers indicate every Point-card&apos;s point of ith Point-card pile.<br><br>The next n lines, in each line, there are five kinds of input, indicate Special-cards by the order of &quot;from top to bottom&quot;.<br><br>1) T K: indicates one gets a Take-card, and He can get Kth Point-card pile(1 &lt;= K &lt;= m).<br><br>2) C: indicates one gets a Challenge card.<br><br>3) L: indicates one gets a Loss card.<br><br>4) A P: indicates one gets an Add card with P point (1 &lt;= P &lt;= 30).<br><br>5) E Q: indicates one gets an Exchange card with Q point (1 &lt;= Q &lt;= 2000000).","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each round you should print A:B in a line. A indicate the number of left cards of Wolffy, B indicates the number of left cards of Happy. At the end of game, if Wolffy gains more points, print &quot;Hahaha...I win!!&quot;, else print &quot;I will be back!!&quot;.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n5 3\n3 3 3\n10 11 2\n7 4 12\n4 2 9\nT 1\nT 2\nA 7\nT 3\nC\n6 3\n2 2 2\n1 4\n5 2\n4 2\nT 2\nT 1\nL\nA 2\nT 3\nC\n5 3\n2 2 2\n1 3\n4 2\n5 2\nT 2\nT 1\nE 3\nA 1\nL</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9:0\n0:5\n1:2\nI will be back!!</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+13+-+Host+by+HIT&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 13 - Host by HIT </a> ","type":"source","format":"html","require":["katex"]}]}