{"title":" Escape","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3036","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3036&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3036","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3036"},"statement":[{"title":"Problem Description","content":"R&apos;s girl friend D is on military training somewhere near Harbin. She feels bad every day and night. She complains about every terrible thing to R. And sometimes she would wail loudly that she had hurt her foot.<br><br>R has a motto, which is &quot;Finding her is my lifetime fate, yet cherishing her is my daily job.&quot; So he made a plan, which called &quot;Prison Break&quot;, as you know, the same with the famouse American play.<br><br>R found out that there were several holes on the wire netting which surrounds the military camp. Or maybe, just R did that. Whatever, R told this to his girl friend D. D gathered the girl comrades, and they decided to escape this night. To help to make the escape safe, R investigated the camp again. And something worse found was soldiers walked guard even in the night. But the good news was they drunk much every night and they were dozing off every night.<br><br>The girls&apos; escape, will not make no sound. Once they take action, the evil commander will send his soldiers(not the drunk ones of course) to stop them. You can assume that the soldiers will get there after T seconds. So if they take more time than T, they will get caught.<br><br>Initially, there is one person on every empty square in the camp and these persons should move to a hole on the wire netting to exit. They can move one square per second to the North, South, East or West. While escaping, multiple persons can be on a single square. The holes are narrow, however, and only one person can leave through a hole per second.<br><br>Now, R and D wants to know whether this action will be successful.If successful, then how much time it will take to get out from the camp.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Multiple cases.<br>Each test case has the following format:<br><br>One line with three integers r, c and T , separated by a single space, satisfying 3 &lt;= r, c &lt;= 12: the size of the camp<br><br>Then r lines with c characters descripes the camp.<br><br>Girls represented by a &apos;.&apos; . Drunk soldiers and the wire netting represented by an &apos;X&apos;, you can assume that the drunk ones will not move even one square. And the hole is &apos;E&apos;, meaning an exit to the girls.<br><br>Input file ends with EOF.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"A single line with the minimal escape time in seconds, if escape is possible, or &quot;impossible&quot;, if it is not.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5 3\nXXEXX\nX...X\nE...X\nX...E\nXXXXX</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+13+-+Host+by+HIT&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 13 - Host by HIT </a> ","type":"source","format":"html","require":["katex"]}]}