{"title":"Bee","time_limit":4000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3041","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3041&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3041","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3041"},"statement":[{"title":"Problem Description","content":"QQ the bear has found a little treasure &#x2013; the bees&#x2019; secret honeypot, which is full of honey! He was happily eating his newfound treasure until suddenly one bee saw him and sounded the bee alarm. He knows that at this very moment hordes of bees will emerge from their hives and start spreading around trying to catch him. He knows he has to leave the honeypot and go home quickly, but the honey is so sweet that QQ doesn&#x2019;t want to leave too soon. Help QQ determine the latest possible moment when he can leave.<br>QQ&#x2019;s forest is represented by a square grid of N by N unit cells, whose sides are parallel to the north-south and east-west directions. Each cell is occupied by a tree, by a patch of grass, by a hive or by QQ&#x2019;s home. Two cells are considered adjacent if one of them is immediately to the north, south, east or west of the other (but not on a diagonal). QQ is a clumsy bear, so every time he makes a step, it has to be to an adjacent cell. QQ can only walk on grass and cannot go through trees or hives, and he can make at most S steps per minute.<br>At the moment when the bee alarm is sounded, QQ is in the grassy cell containing the honeypot, and the bees are in every cell containing a hive (there may be more than one hive in the forest). During each minute from this time onwards, the following events happen in the following order:<br>1.&#xA0;&#xA0;If QQ is still eating honey, he decides whether to keep eating or to leave. If he continues eating, he does not move for the whole minute. Otherwise, he leaves immediately and takes up to S steps through the forest as described above. QQ cannot take any of the honey with him, so once he has moved he cannot eat honey again.<br><br>2.&#xA0;&#xA0;After QQ is done eating or moving for the whole minute, the bees spread one unit further across the grid, moving only into the grassy cells. Specifically, the swarm of bees spreads into every grassy cell that is adjacent to any cell already containing bees. Furthermore, once a cell contains bees it will always contain bees (that is, the swarm does not move, but it grows).<br><br>In other words, the bees spread as follows: When the bee alarm is sounded, the bees only occupy the cells where the hives are located. At the end of the first minute, they occupy all grassy cells adjacent to hives (and still the hives themselves). At the end of the second minute, they additionally occupy all grassy cells adjacent to grassy cells adjacent to hives, and so on.<br>Given enough time, the bees will end up simultaneously occupying all grassy cells in the forest that are within their reach.<br>&#xA0;&#xA0;Neither QQ nor the bees can go outside the forest. Also, note that according to the rules above, QQ will always eat honey for an integer number of minutes.<br>&#xA0;&#xA0;The bees catch QQ if at any point in time QQ finds himself in a cell occupied by bees.<br><br>TASK<br>Write a program that, given a map of the forest, determines the largest number of minutes that QQ can continue eating honey at his initial location, while still being able to get to his home before any of the bees catch him.<br><br>CONSTRAINTS<br>1&lt;=N&lt;=800,  the size (side length) of the map<br>1&lt;=S&lt;=1000, the maximum number of steps QQ can take in each minute<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains the integers N and S, separated by a space.<br>The next N lines represent the map of the forest. Each of these lines contains N characters<br>with each character representing one unit cell of the grid. The possible characters and their<br>associated meanings are as follows:<br>T denotes a tree<br>G denotes a grassy cell<br>M denotes the initial location of QQ and the honeypot, which is also a grassy cell<br>D denotes the location of QQ&#x2019;s home, which QQ can enter, but the bees cannot.<br>H denotes the location of a hive<br>NOTE: It is guaranteed that the map will contain exactly one letter M, exactly one letter D and at least one letter H. It is also guaranteed that there is a sequence of adjacent letters G that connects QQ to his home, as well as a sequence of adjacent letters G that connects at least one hive to the honeypot (i.e., to QQ&#x2019;s initial location). These sequences might be as short as length zero, in case QQ&#x2019;s home or a hive is adjacent to QQ&#x2019;s initial location.<br>Also, note that the bees cannot pass through or fly over QQ&#x2019;s home. To them, it is just like a tree.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"output a single line containing a single integer: the<br>maximum possible number of minutes that QQ can continue eating honey at his initial location, while still being able to get home safely. If QQ cannot possibly reach his home before the bees catch him, the number your program writes to standard output must be -1 instead.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 3\nTTTTTTT\nTGGGGGT\nTGGGGGT\nMGGGGGD\nTGGGGGT\nTGGGGGT\nTHHHHHT\n\n7 3\nTTTTTTT\nTGGGGGT\nTGGGGGT\nMGGGGGD\nTGGGGGT\nTGGGGGT\nTGHHGGT</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nHints&#xFF1A; \nFor the first case, After eating honey for one minute, QQ can take the shortest path directly to\n the right and he will be home in another two minutes, safe from the bees.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+14+-+Host+by+ZJNU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 14 - Host by ZJNU </a> ","type":"source","format":"html","require":["katex"]}]}