{"title":"XX’s puzzle","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3048","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3048&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3048","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3048"},"statement":[{"title":"Problem Description","content":"XX and QQ are good friends. Some few months ago, XX always sat beside QQ and they always talked about some hard programming problems and also sometimes played StarCraft (&#xFFFD;&#xFFFD;_&#xFFFD;&#xFFFD;). XX likes playing Protoss while QQ likes playing Terran, and XX is a perfect player and courage QQ to win the others. But now, XX has gone to ZJU to study master, so QQ always thinks of him. XX is a mischievous boy, and he invariably comes up with lots of hard problems to challenge QQ, but fails at the most time. In the recent days, XX finds a problem which he regards as a very puzzling problem. Being surprised by QQ&#xFFFD;&#xFFFD;s skill, XX is determined to let you solve this problem and tests whether the problem is enough puzzling, the problem is described: <br>It&apos;s not hard to see that every triangulation breaks the polygon into n-2 triangles. The triangulation is called k-isosceles, if there are exactly k isosceles triangles among them. Given integer n and k, compute the number of distinct k-isosceles triangulations of a regular polygon with n vertices. Return the result modulo 9397.<br>","type":"description","format":"html"},{"title":"Input","content":"  There are many test cases.<br>   For every case, there are two nonnegative integer n and k, 3&lt;=n&lt;=50, 0&lt;=k&lt;=n-2;<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For every case, output the result modulo 9397.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2 \n3 0 \n5 3 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0 \n5\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nHint: \nFor the first case, we can have a diagonal between vertices 0 and 2 or between vertices 1 and 3. In both cases, there are 2 isosceles triangles.\nFor the second case, the only triangulation of an equilateral triangle contains no diagonals and 1 isosceles triangle (the polygon itself).\nFor the third case, a regular pentagon has 5 triangulations. \nEach of them is obtained by connecting one selected vertex with the two others that are not its neighbors, so each triangulation is 3-isosceles.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+14+-+Host+by+ZJNU&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 14 - Host by ZJNU </a> ","type":"source","format":"html"}]}