{"title":"Cat Jim","time_limit":1000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3050","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3050&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3050","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3050"},"statement":[{"title":"Problem Description","content":"Long long ago&#xFF0C;there was a very big forest, called Happy Forest. In the forest, there was a very naughty cat, named Jim. One day, when Jim played in the forest, he was attracted by a beautiful butterfly and followed the butterfly, he went into the dire area, the Black Forest<br><br>An evil wizard lived in the Black Forest, he would kill anyone who entered the forest, and had a good meal with their bodies. Obviously, Jim knew what would happen to him. As a clever cat, Jim came up an idea quickly, that is, calling for help.<br><br>Unfortunately, the wizard trapped Jim with a magic called Maze, and then he went home prepered for the delicious cat-meet-dinner. He would come back at time T.<br><br>The magic Maze transmits somebody to a special square. At there, one must solve a riddle to get out, or waiting for powerful wizard to dispel the Maze.<br><br>On the square, there are N rows stone. Each row has M stones. Each stone has its own number, and there are M pieces of stone whose number is k(1&lt;=k&lt;=N). Only all the stone in kth row has the same number k, the person can exit the Maze.<br><br>Certainly, Jim didn&apos;t want to become a cat-meet-dinner, so he asked you for help.<br><br>You can assume Jim would take 1 time from one row to any row (nomatter he took a stone or not), and when start (time 0), he could go to any row he likes.<br><br>Notice: even Jim can get out of magic Maze, he also need at least 1 time to call for help.(After that he would save by SuperCat and Wizard would lost his cat-meet-dinner. Clearly he might be crazy and do something terrible. For exmaple, he might summon some vampire to catch the cat Jim and then destroy the Happy Forest:( After all, he was a dread wizard.)","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains N (the number of row, 1&lt;=N&lt;=10000), M (the number of stone in each row, 1&lt;=M&lt;=100), T(the time mentioned before, T&lt;=2^32), Each of the next N lines contains M numbers in the range from 1 to N. The numbers are separated with a space.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The first line is minimal possible time he needed to get out of magic Maze.If he would become a cat-meet-dinner,you must put another line, &quot;Poor Cat&quot;.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3 10\n1 3 1\n2 3 3\n1 2 2\n4 4 4\n4 3 1\n1 3 1\n2 3 3\n1 2 2\n4 4 4 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n6\nPoor Cat</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+15+-+Host+by+BUAA&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 15 - Host by BUAA </a> ","type":"source","format":"html","require":["katex"]}]}