{"title":"Network","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3078","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3078&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3078","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3078"},"statement":[{"title":"Problem Description","content":"The ALPC company is now working on his own network system, which is connecting all N ALPC department. To economize on spending, the backbone network has only one router for each department, and N-1 optical fiber in total to connect all routers.<br>The usual way to measure connecting speed is lag, or network latency, referring the time taken for a sent packet of data to be received at the other end.<br>Now the network is on trial, and new photonic crystal fibers designed by ALPC42 is trying out, the lag on fibers can be ignored. That means, lag happened when message transport through the router. ALPC42 is trying to change routers to make the network faster, now he want to know that, which router, in any exactly time, between any pair of nodes, the K-th high latency is. He needs your help.<br>","type":"description","format":"html"},{"title":"Input","content":"There are only one test case in input file.<br>Your program is able to get the information of N routers and N-1 fiber connections from input, and Q questions for two condition: 1. For some reason, the latency of one router changed. 2. Querying the K-th longest lag router between two routers.<br>For each data case, two integers N and Q for first line. 0&lt;=N&lt;=80000, 0&lt;=Q&lt;=30000.<br>Then n integers in second line refer to the latency of each router in the very beginning.<br>Then N-1 lines followed, contains two integers x and y for each, telling there is a fiber connect router x and router y.<br>Then q lines followed to describe questions, three numbers k, a, b for each line. If k=0, Telling the latency of router a, Ta changed to b; if k&gt;0, asking the latency of the k-th longest lag router between a and b (include router a and b). 0&lt;=b&lt;100000000.<br>A blank line follows after each case.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each question k&gt;0, print a line to answer the latency time. Once there are less than k routers in the way, print &quot;invalid request!&quot; instead.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5\n5 1 2 3 4\n3 1\n2 1\n4 3\n5 3\n2 4 5\n0 1 2\n2 2 3\n2 1 4\n3 3 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2\n2\ninvalid request!</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Multi-University+Training+Contest+17+-+Host+by+NUDT&amp;source=1&amp;searchmode=source\"> 2009 Multi-University Training Contest 17 - Host by NUDT </a> ","type":"source","format":"html"}]}