{"title":"The Heart of the Country","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3101","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3101&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3101","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3101"},"statement":[{"title":"Problem Description","content":"The nation of Graphia is at war. The neighboring nations have for long watched in jealousy as Graphia erected prosperous cities and connected them with a network of highways. Now they want a piece of the pie.<br><br>Graphia consists of several cities, connected by highways. Graphian terrain is rough, so the only way to move between the cities is along the highways. Each city has a certain number of troops quartered there. Graphia&apos;s military command knows that it will require a certain number of troops, K , to defend any city. They can defend a city with the troops stationed there, supported by the troops in any other city which is directly connected with a highway, with no cities in between. Any troops further away than that simply cannot get there in time. They also know that their enemies will onlyattack one city at a time -- so the troops in a city can be used to defend that city, as well as any of its neighbors. However, if a city can&apos;t be defended, then the military command must assume that the troops quartered in that city will be captured, and cannot aid in the defense of Graphia. In the case below, suppose K = 10 . City C might seem well defended, but it will eventually fall.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/con228-1002-1.JPG\"></center> <br><br>Graphia&apos;s leadership wants to identify the Heart of their country -- the largest possible group of cities that can mutually defend each other, even if all of the other cities fall.<br><br>More formally, a city is defensible if it can draw a total of at least K troops from itself, and from cities directly adjacent to it. A set of cities is defensible if every city in it is defensible, using only troops from itself and adjacent cities in that set. The Heart of the country is the largest possible defensible set of cities - that is, no other defensible set of cities has more cities in it. ","type":"description","format":"html"},{"title":"Input","content":"There will be several data sets. Each set begins with two integers, N and K , where N is the number of cities ( 3&lt;=N&lt;=1000 ), and K is the number of troops required to defend a city. The cities are numbered 0 through N - 1 .<br><br>On the next N lines are descriptions of the cities, starting with city 0. Each of the city description lines begins with an integer T , indicating the number of troops quartered in that city ( 0&lt;=T&lt;=10000 ). This is followed by an integer M , indicating the number of highways going out of that city, and then M integers, indicating the cities those highways go to. No two highways will go from and to the same cities, so every city in each list will be unique. No highway will loop from a city back to the same city. The highways go both ways, so that if city I is in city J &apos;s list, then it&apos;s guaranteed that city J will be in city I &apos;s list in the input. The input will end with a line with two space-separated 0&apos;s. ","type":"input_format","format":"html"},{"title":"Output","content":"For each data set, print two integers on a single line: The number of cities in the heart of the country, and the number of troops in the heart of the country. Print a space between the integers. There should be no blank lines between outputs.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 900\n100 2 1 2\n200 2 0 3\n500 2 0 3\n1000 2 1 2\n4 900\n100 3 1 2 3\n200 3 0 3 2\n500 3 1 3 0\n1000 3 2 1 0\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 1700\n4 1800</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ACM-ICPC+Southeast+USA+Regional+&amp;source=1&amp;searchmode=source\"> 2008 ACM-ICPC Southeast USA Regional  </a> ","type":"source","format":"html"}]}