{"title":"Planet Alignment","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3112","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3112&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3112","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3112"},"statement":[{"title":"Problem Description","content":"The Astrologically Clairvoyant Manufacturers have always used the celestial skies to make more accurate forecasts. Most of their predictions are based on a Star-Planet-Satellite alignment. There are some scientific reasons for this, mostly tidal changes: the gravitational pull of these celestial bodies will pull the water towards them. The greatest tides occur when the Sun, Earth, and Moon are perfectly aligned.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C236-1003-1.JPG\"></center><br><br>Always willing to expand its share of the market, the ACM has decided to generalize its predicitions to other planetary systems. However, on those systems the celestial bodies move at different speeds than in ours, so the predictions which depend on the Star-Planet-Satellite alignment must be recalculated. Can you help them automate some of their computations?<br><br>For some stellar system, at some point of the future denoted as t = 0, the star, a planet and a moon of the planet will be aligned on the galactic x axis. The star will be at position (0, 0), the planet will be at position (p, 0), and its planet will be at position (m, 0). The planet moves around the star in a perfect circle, on the galactic xy plane, and completes a revolution in u Earth days. Similarly, the moon revolves around the planet in v Earth days, in a perfect circle and on the same galactic plane. In other words, at t = u the planet will be back at position (p, 0), and at t = v the moon will once again have the same y coordinate as the planet and will be on the same side of the planet as when t was zero.<br><br>When will the three celestial bodies be aligned again?<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input will contain a non-negative integer n, which represent the number of test cases. For each test case, you will be given one line containing the non-zero integers u and v, all of which could be negative. The distance between the moon and the planet will be strictly smaller than distance between the planet and the star, and the revolution durations won&#x2019;t cause the celestial bodies to be permanently aligned. A positive revolution duration indicates that a celestial body revolves counter-clockwise, and a negative revolution duration indicates clockwise motion.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, find the minimum positive number t such that after that number of Earth days, the three celestial bodies will be perfectly aligned again. Output that number with three decimal places, rounding to the nearest allowed value. <br>The magnitude of the numbers in the input will be at most 1000.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 -1\n2 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.250\n1.000</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IPCP+2005+Northern+Preliminary+for+Northeast+North-America&amp;source=1&amp;searchmode=source\"> IPCP 2005 Northern Preliminary for Northeast North-America </a> ","type":"source","format":"html","require":["katex"]}]}