{"title":"Bus Schedules","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3116","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3116&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3116","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3116"},"statement":[{"title":"Problem Description","content":"The Association of Commuters in Montreal (ACM) wishes to create a website for the city&#x2019;s publictransit commuters, in order to promote public transit. A prominent reason for people to drive to work instead of commuting is the time wasted on the subway and buses. For this reason, the ACM wishes to add a form on their website so that visitors will be able to specify two points on the island, and the website will find the quickest route between those two points using its database of subway and bus schedules.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C236-1007-1.JPG\"></center><br>Seeing how this may help improve the environment and the greenhouse effect, you offer your help.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of each test case will contain a positive integer n, the number of bus and subway schedules which will follow. Each schedule will begin with a line containing a positive integer m, the number of stops along the path. m lines will follow, describing the stops of the day in chronological order. Each stop will begin by a time in the format hh : mm, between 00 : 00 and 23 : 59 inclusively. There will be at least one minute between each stop &#x2014; in other words, all the stop times for a particular bus will be different. A single space will follow, and the rest of the line will contain a name describing the stop.<br><br>The name will not contain spaces nor capital letters, and will be at most 20 characters long. Stops with the same name obviously denote the same physical location, where passengers can wait for other buses or subways to stop. After the day completes, the buses and subways mysteriously disappear and reappear at some point before their first stop. They cannot carry any passengers at that time, so the passengers must spend the night waiting at some stop.Each schedule repeats itself every day.<br><br>After the schedules, a line will contain a time and two locations of at most 20 characters, the start and the goal. Output the minimum number of minutes needed for a passenger at the start location at the given time to reach the goal location. He is able to enter any bus which stops at his start location at the given starting time or later, and he can also switch from a bus to another instantaneously if they happen to stop at the same place at the same time. He can also wait at a stop for an arbitrary amount of time.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"If the destination cannot be reached, output &#x201C;impossible&#x201D;.<br>The last line of the input will contain the integer 0 and should not be processed.<br>All the numbers in the input will be at most 1000.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\n00:01 loc_a\n00:02 loc_b\n00:10 loc_c\n00:20 loc_a\n2\n00:02 loc_b\n00:04 loc_c\n00:00 loc_a loc_c\n1\n3\n00:00 foo\n01:00 bar\n02:00 baz\n01:30 bar foo\n1\n4\n00:00 baz\n01:00 foo\n02:00 bar\n03:00 baz\n02:30 bar foo\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\nimpossible\n2790</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=IPCP+2005+Northern+Preliminary+for+Northeast+North-America&amp;source=1&amp;searchmode=source\"> IPCP 2005 Northern Preliminary for Northeast North-America </a> ","type":"source","format":"html","require":["katex"]}]}