{"title":"Arbiter","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3118","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3118&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3118","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3118"},"statement":[{"title":"Problem Description","content":"Arbiter is a kind of starship in the StarCraft science-fiction series.  The Arbiter-class starship is a Protoss warship specializing in providing psychic support. Arbiters were crewed exclusively by Judicators; unlike other warships that were manned predominantly by Templar. The Judicator used the Arbiter as a base to provide support using space-time manipulation.<br>Arbiters could weaken space-time, tearing rifts in the fabric of space-time, creating a vortex linking another location to the Arbiter&#xFFFD;&#xFFFD;s location. This could be used to move personnel over long distances between stars.<br>In the meantime of widely used Arbiter to transfer, KMXS, the captain of one Arbiter, was warning that some person had got a serious mental disorder after the trip on his Arbiter. By using mice as model animals, he found the sake, it&#xFFFD;&#xFFFD;s because of chirality!<br>Every person has chirality, either left-handed or right-handed. Actually all the persons must live with the food which has the same chirality. When one person took Arbiter from one star to another one, his chirality will be changed (from left-handed to right-handed or from right-handed to left-handed). If a person took a long trip and finally got back to his own star, however, his chirality might be changed to the opposite state other than his original, which would cause fatal mental disorder, or even death. <br>KMXS has the channels map among the starts and he need to prohibit minimum number of channels from traveling so that wherever a person starts his traveling from when he gets his original star he&#xFFFD;&#xFFFD;ll be safe. KMXS turns to your help.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input consists of an integer T, indicating the number of test cases.<br>The first line of each case consists of two integers N and M, indicating the number of stars and the number of channels. Each of the next M lines indicates one channel (u, v) which means there is a bidirectional channel between star u and star v (u is not equal to v).<br>","type":"input_format","format":"html"},{"title":"Output","content":"Output one integer on a single line for each case, indicating the minimum number of channels KMXS must prohibit to avoid mental disorder.<br><br>Constraints<br>0 &lt; T &lt;= 10<br>0 &lt;= N &lt;= 15 0 &lt;= M &lt;= 300<br>0 &lt;= u, v &lt; N and there may be more than one channel between two stars.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 3\n0 1\n1 2\n2 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Wuhan+Regional+Contest+Online&amp;source=1&amp;searchmode=source\"> 2009 Asia Wuhan Regional Contest Online </a> ","type":"source","format":"html"}]}