{"title":"Nova","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3126","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3126&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3126","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3126"},"statement":[{"title":"Problem Description","content":"The Lich is a powerful hero that he can kill a wisp with his skill Frost Nova. The Burning Legion wants to conquer the forest so they sent some liches to kill all the wisps. A lich can kill a wisp once he could see the wisp and the wisp in his attack range. So the lich can attack a wisp when the distance between them is less than or equal to specific R and no trees are on the segment between the lich and wisp. Each lich has a cool down time that once he used Frost Nova he has to wait a few seconds for the next attack. Different liches may have different attack range and cool down time. The Lich King is the leader of the Burning Legion and he wants to arrange the attack order so the liches can wipe out all the wisps as soon as possible.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line consists of an integer T, indicating the number of test cases.<br>The first line of each case consists of three integers N, M, K, indicating the number of lich, the number of wisps and the number of trees. The next N lines, each line consists of four integers x, y, r, t indicating the coordinate of that a lich, the radius of the attack range that lich&#x2019;s Frost Nova can reach and the value of cool down time. The next M lines, each line consists of two integers x, y indicating the coordinate of each wisp. The last K lines, each line consists of three integers x, y, r, indicating the coordinate and radius of a tree. A lich cannot attack a wisp if the segment between them has a common point with the tree. The lich, wisp and trees will not overlap with each other.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output the minimum time lich need to kill all the wisps on a single line, or -1 if lich cannot kill all the wisps.<br><br>Constrains<br>0 &lt; T &lt;= 20<br>0 &lt;= N, M, K &lt;= 200<br>-10000 &lt;= x, y &lt;= 10000<br>0 &lt;= r, t &lt;= 10002<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2 3 1\n-100 0 100 3\n100 0 100 5\n-100 -10\n100 10\n110 11\n5 5 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Wuhan+Regional+Contest+Online&amp;source=1&amp;searchmode=source\"> 2009 Asia Wuhan Regional Contest Online </a> ","type":"source","format":"html","require":["katex"]}]}