{"title":"Allergy Test","time_limit":5000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3141","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3141&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3141","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3141"},"statement":[{"title":"Problem Description","content":"<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3141-1.jpg\"></center><br>A test for allergy is conducted over the course of several days, and consists of exposing you to dierent substances (so called allergens). The goal is to decide exactly which of the allergens you are allergic to. Each allergen has a live duration <i>D</i> measured in whole days, indicating exactly how many days you will suer from an allergic reaction <i>if</i> you are allergic to that particular substance. An allergic reaction starts to show almost immediately after you have been exposed to an allergen which you are allergic to. The test scheme has two action points per day:<br><ul><b>I</b> At 8 o&apos;clock each morning, at most one of the allergens is applied to your body.<br><b>II</b> At 8 o&apos;clock each evening, you are examined for allergic reactions.</ul>Thus an allergen with live duration <i>D</i> will aect exactly <i>D</i> allergic reaction examinations.<br><br>Of course, if you have two or more active allergens in your body at the time of an observed reaction, you cannot tell from that information only, which of the substances you are allergic to.<br><br>You want to find the shortest possible test scheme given the durations of the allergens you want to test. Furthermore, to allow simple large scale application the test scheme must be non-adaptive, i.e. the scheme should be fixed in advance. Thus you may not choose when to apply an allergen based on the outcome of previous allergic reaction examinations.","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains a single integer <i>k</i> (1 &lt;= <i>k</i> &lt;= 20) specifying the number of allergens being tested for. Then follow <i>k</i> lines each containing an integer <i>D</i> (1 &lt;= <i>D</i> &lt;= 7) specifying the live duration of each allergen.","type":"input_format","format":"html"},{"title":"Output","content":"The number of days of the shortest conclusive non-adaptive test scheme.<br><br><i>A scheme ends the morning when you no longer have active allergens in your body, thus a test scheme for a single allergen with live duration D takes D days.</i><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2\n2\n2\n5\n1\n4\n2\n5\n2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NCPC+2009&amp;source=1&amp;searchmode=source\"> NCPC 2009 </a> ","type":"source","format":"html"}]}