{"title":"Flight Planning","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3145","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3145&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3145","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3145"},"statement":[{"title":"Problem Description","content":"<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3145-1.jpg\"></center><br>The airline company NCPC Airways has flights to and from <i>n</i> cities, numbered from 1 to <i>n</i>, around the entire world. However, they only have <i>n</i> - 1 different flights (operating in both directions), so in order to travel between any two cities you might have to take several flights. In fact, since the management has made sure that it&apos;s possible to travel between any pair of cities, there is exactly one set of flights a passenger have to take in order to travel between two cities (assuming you want to use the same airline).<br><br>Recently many of NCPC Airways frequent flyers have complained that they have had to change flights too often to get to their final destination. Since NCPC Airways doesn&apos;t want to loose their customers to other airline companies, but still keep the nice property of their flights, they have decided to cancel one of their current flights and replace it with another flight. Help the company by writing a program which finds the best flight to cancel and the best new flight to add so that the maximum number of flight changes a passenger might have to make when travelling between any pair of cities in which NCPC Airways operates is minimized.<br><br><i>The input will be constructed so that it is always possible to improve the maximum number of flight changes needed.</i>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"<font color=\"red\">Input contains multiple test cases.</font><br>The first line in the input contains the integer <i>n</i> (4 &lt;= <i>n</i> &lt;= 2500), the number of cities NCPC Airways operates in. Then follow <i>n</i> - 1 lines specifying the flights. Each flight is given as a pair of cities <i>a</i> and <i>b</i> (1 &lt;= <i>a</i>, <i>b</i> &lt;= <i>n</i>).","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"<font color=\"red\">For each case,</font> the output should consist of three lines. The first line should contain an integer, the minimum number of flights needed to take when travelling between any pair of cities after changing one of the flights. The second line should contain two integers, specifying the two cities between which the flight should be canceled. The third line should contain two integers, specifying the two cities where a new flight should be added.<br><br>If there are more than one optimal solution, any one of them will be accepted.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n1 2\n2 3\n3 4\n14\n1 2\n1 8\n2 3\n2 4\n8 9\n8 10\n8 11\n4 5\n4 6\n4 7\n10 12\n10 13\n13 14</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 4\n2 4\n5\n1 8\n2 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NCPC+2009&amp;source=1&amp;searchmode=source\"> NCPC 2009 </a> ","type":"source","format":"html","require":["katex"]}]}