{"title":"Beacons","time_limit":30000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3146","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3146&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3146","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3146"},"statement":[{"title":"Problem Description","content":"<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3146-1.jpg\"></center><br>In ancient times, communication was not as swift as it is today. When a kingdom was at war, it could take months to muster all the armed forces. But by using fire-lit beacons at strategic locations, it was still possible to quickly send emergency signals.<br><br>When the first beacon is lit, all other beacons within sight from it are also lit. All beacons within sight of these are then lit, and so on until all beacons are lit - assuming of course that all beacons are within sight of each other, directly or indirectly. If they are not, the dire news must be carried by riders between some beacons.<br><br>Given the location of all beacons in the kingdom as well as the location and size of all mountain peaks, write a program that determines how many messages must be sent by riders in order for all beacons to be lit when an enemy threatens the country.<br><br>For simplicity, we model the country in the following way: a beacon is represented as a point in the xy-plane and a mountain peak is represented as a circle. Two beacons are considered to be within sight of each other if no mountain peak blocks the straight line between the two beacons.<br><br><i>The input will be constructed so that the straight line between any pair of beacons will not touch the circumference of a mountain peak, unless it passes through the interior of another mountain peak. Mountain peaks will not overlap or touch, nor will any beacon be on a mountain peak or on its circumference.</i><br>","type":"description","format":"html"},{"title":"Input","content":"The first line in the input contains two integers <i>n</i> (1 &lt;= <i>n</i> &lt;= 1000) and <i>m</i> (0 &lt;= <i>m</i> &lt;= 1000) the number of beacons and the number of mountain peaks, respectively. Then follow <i>n</i> lines specifying the locations of the beacons. The location of each beacon is given as a pair of integers <i>x</i> and <i>y</i> (0 &lt;= <i>x</i>, <i>y</i> &lt;= 10000). Then follow <i>m</i> lines describing the mountain peaks. Each mountain peak is given as a pair of integers <i>x</i> and <i>y</i> (0 &lt;= <i>x</i>, <i>y</i> &lt;= 10000) specifying the location of the peak and a radius <i>r</i> (1 &lt;= <i>r</i> &lt;= 5000).","type":"input_format","format":"html"},{"title":"Output","content":"The output should be a single integer: the number of messages that must be carried by riders for all beacons to be lit.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 3\n1 8\n5 4\n7 7\n9 2\n16 6\n17 10\n4 7 2\n6 3 1\n12 6 3\n4 4\n0 4\n8 4\n4 0\n4 8\n2 2 1\n6 2 1\n2 6 1\n6 6 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=NCPC+2009&amp;source=1&amp;searchmode=source\"> NCPC 2009 </a> ","type":"source","format":"html"}]}