{"title":"Robot Roll Call – Cambot…Servo…Gypsy…Croooow","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3150","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3150&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3150","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3150"},"statement":[{"title":"Problem Description","content":"<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C239-1002-1.jpg\"></center><br>Mystery Science Theater 3000 is about to start, which means it&apos;s time for &quot;Robot Roll Call&quot;, where the name of each robot is called out, as per the list received from Earth. The expectation is that if a robot is there, it will respond by adding its name to a data stream which is then sent back to Earth. Unfortunately today, once the roll is received, communication with Earth is temporarily lost. In the meantime, the robots that are present for roll call have saved their names to the data stream. However, lots of other things are also being saved to this same stream. To help extract data later, any data placed in the stream is separated by whitespace. Once the communication problems are resolved, the contents of this stream are relayed to Earth.<br><br>Your task is as follows. Given a list of names for roll call, you must scan the accompanying data stream and determine if a given name is there. For each name that is in the roll call, report whether or not that name was in the data stream. For a name to be a match, it must appear <b>EXACTLY</b> as shown in the roll. This means a match is case-sensitive and sub-string matches are not allowed.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first entry in the file will be an integer value <b>t</b> (<b>t</b> &gt; 0) that represents the number of test data sets the file contains. Following this entry, will be <b>t</b> test sets. Each test set will start with an integer <b>n</b> (0 &lt; <b>n</b> &lt; 26) representing the number of names in the roll. On the lines that follow will be <b>n</b> entries, one per line, containing the individual names in the roll. No name will have more than 25 characters. Names will only contain the characters A-Z, a-z, and 0-9. Names will be unique.<br><br>Following the names will be an integer <b>d</b> (0 &lt; <b>d</b> &lt; 100) representing the number of lines in the data stream. On each subsequent line will be the characters that make up the data stream. Each line of the data stream will contain at least one character and at most 100. Furthermore, the data on a given line will be separated by whitespace (space, tab, or combination of the two). Finally, any names from the roll that might occur as part of the data stream will be found on one line (a name will not be split across lines).","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Write the test set number (starting at 1) on a line of its own, followed by the names in the roll and whether or not a given name was found in the data stream. Each of these names should occur on a line of their own. Add a blank line to the end of each test case. Output format must be identical to the sample output shown below.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\nGypsy\nTomServo\nCrowTRobot\nCambot\n2\nManos Torgo Joel 101010 Gypsy tomservo\nFugitive Alien Time of the Apes crowTrobot Cambot\n2\nR2D2\nC3PO\n1\nBoba Fett c3Po R2D22 Jar Jar Binks Luke give in to the dark side</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Test set 1:\nGypsy is present\nTomServo is absent\nCrowTRobot is absent\nCambot is present\nTest set 2:\nR2D2 is absent\nC3PO is absent</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ACM-ICPC+Pacific+Northwest+Region&amp;source=1&amp;searchmode=source\"> 2008 ACM-ICPC Pacific Northwest Region </a> ","type":"source","format":"html","require":["katex"]}]}