{"title":"Symbolic Logic Mechanization","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3155","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3155&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3155","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3155"},"statement":[{"title":"Problem Description","content":"Marvin, the robot with a brain the size of a planet, followed some . . . markedly less successful robots as the product line developed. One such was Monroe, the robot &#xFFFD;&#xFFFD; except, to help him recognize his name, he was referred to as Moe. He is sufficiently mentally challenged that he needs external assistance to handle symbolic logic.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C239-1007-1.jpg\"></center><br>Polish notation is the prefix symbolic logic notation developed by Jan Lukasiewicz (1929). [Hence postfix expressions are referred to as being in Reverse Polish Notation &#xFFFD;&#xFFFD; RPN.] The notation developed by Lukasiewicz (referred to as PN below) uses upper-case letters for the logic operators and lower-case letters for logic variables (which can only be <b>true</b> or <b>false</b>). Since prefix notation is self-grouping, there is no need for precedence, associativity, or parentheses, unlike infix notation. In the following table the PN operator is shown, followed by its operation. Operators not having exactly equivalent C/C++/Java operators are shown in the truth table (using 1 for <b>true</b> and 0 for <b>false</b>). [The operator J is not found in Lukasiewicz&#xFFFD;&#xFFFD; original work but is included from A.N.Prior&#xFFFD;&#xFFFD;s treatment.]<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C239-1007-2.jpg\">&#xA0;&#xA0;&#xA0;&#xA0;<img style=\"max-width:100%;\" src=\"../../../data/images/C239-1007-3.jpg\"></center><br>For every combination of PN operators and variables, an expression is a &quot;well-formed formula&quot; (WFF) if and only if it is a variable or it is a PN operator followed by the requisite number of operands (WFF instances). A combination of symbols will fail to be a &quot;well-formed formula&quot; if it is composed of a WFF followed by extraneous text, it uses an unrecognized character [uppercase character not in the above table or a non-alphabetic character], or it has insufficient operands for its operators. For invalid expressions, report the <b><i>first</i></b> error discovered in a left-toright scan of the expression. For instance, immediately report an error on an invalid character. If a valid WFF is followed by extraneous text, report that as the error, even if the extraneous text has an invalid character.<br><br>In addition, every WFF can be categorized as a tautology (true for all possible variable values), a contradiction (false for all possible variable values), or a contingent expression (true for some variable values, false for other variable values).<br><br>The simplest contingent expression is simply &apos;<i>p</i>&apos;, true when <i>p</i> is true, false when <i>p</i> is false. One very simple contradiction is &quot;<i>KpNp</i>&quot;, both <i>p</i> and <i>not-p</i> are true. Similarly, one very simple tautology is &quot;<i>ApNp</i>&quot;, either <i>p</i> is true or <i>not-p</i> is true. For a more complex tautology, one expression of De Morgan&#xFFFD;&#xFFFD;s Law is &quot;<i>EDpqANpNq</i>&quot;.<br>","type":"description","format":"html"},{"title":"Input","content":"Your program is to accept lines until it receives an empty character string. Each line will contain only alphanumeric characters (no spaces or punctuation) that are to be parsed as potential &quot;WFFs&quot;. Each line will contain fewer than 256 characters and will use at most 10 variables. There will be at most 32 non-blank lines before the terminating blank line.","type":"input_format","format":"html"},{"title":"Output","content":"For each line read in, echo it back, followed by its correctness as a WFF, followed (if a WFF) with its category (tautology, contradiction, or contingent). In processing an input line, immediately terminate and report the line as not a WFF if you encounter an unrecognized operator (even though it may fail to be well-formed in another way as well). If it has extraneous text following the WFF, report it as incorrect. If it has insufficient operands, report that. Use <b><i>exactly</i></b> the format shown in the <b>Sample Output</b> below.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">q\nCp\nCpq\nA01\nCpqr\nANpp\nKNpp\nQad\nCKNppq\nJDpqANpNq\nCDpwANpNq\nEDpqANpNq\nKCDpqANpNqCANpNqDpq</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">q is valid: contingent\nCp is invalid: insufficient operands\nCpq is valid: contingent\nA01 is invalid: invalid character\nCpqr is invalid: extraneous text\nANpp is valid: tautology\nKNpp is valid: contradiction\nQad is invalid: invalid character\nCKNppq is valid: tautology\nJDpqANpNq is valid: contradiction\nCDpwANpNq is valid: contingent\nEDpqANpNq is valid: tautology\nKCDpqANpNqCANpNqDpq is valid: tautology</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ACM-ICPC+Pacific+Northwest+Region&amp;source=1&amp;searchmode=source\"> 2008 ACM-ICPC Pacific Northwest Region </a> ","type":"source","format":"html"}]}