{"title":"Crazy Circuits","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3157","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3157&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3157","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3157"},"statement":[{"title":"Problem Description","content":"You&#xFFFD;&#xFFFD;ve just built a circuit board for your new robot, and now you need to power it. Your robot circuit consists of a number of electrical components that each require a certain amount of current to operate. Every component has a + and a - lead, which are connected on the circuit board at junctions. Current flows through the component from + to - (but note that a component does not &quot;use up&quot; the current: everything that comes in through the + end goes out the - end).<br><br>The junctions on the board are labeled 1, ..., <b>N</b>, except for two special junctions labeled + and - where the power supply terminals are connected. The + terminal only connects + leads, and the - terminal only connects - leads. All current that enters a junction from the - leads of connected components exits through connected + leads, but you are able to control how much current flows to each connected + lead at every junction (though methods for doing so are beyond the scope of this problem<sup>1</sup>). Moreover, you know you have assembled the circuit in such a way that there are no feedback loops (components chained in a manner that allows current to flow in a loop).<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C239-1009-1.jpg\"></center><br><center><b>Figure 1:</b> Examples of two valid circuit diagrams. <br>In (a), all components can be powered along directed paths from the positive terminal to the negative terminal. <br>In (b), components 4 and 6 cannot be powered, since there is no directed path from junction 4 to the negative terminal.</center><br>In the interest of saving power, and also to ensure that your circuit does not overheat, you would like to use as little current as possible to get your robot to work. What is the smallest amount of current that you need to put through the + terminal (which you can imagine all necessarily leaving through the - terminal) so that every component on your robot receives its required supply of current to function?<br><br><div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div><sup>1</sup>&#xA0;For those who are electronics-inclined, imagine that you have the ability to adjust the potential on any componentwithout altering its current requirement, or equivalently that there is an accurate variable potentiometer connected in series with each component that you can adjust. Your power supply will have ample potential for the circuit.<br></div>","type":"description","format":"html"},{"title":"Input","content":"The input file will contain multiple test cases. Each test case begins with a single line containing two integers: <b>N</b> (0 &lt;= <b>N</b> &lt;= 50), the number of junctions not including the positive and negative terminals, and <b>M</b> (1 &lt;= <b>M</b> &lt;= 200), the number of components in the circuit diagram. The next <b>M</b> lines each contain a description of some component in the diagram. The <b>i</b><sup>th</sup> component description contains three fields: <b>p<sub>i</sub></b>, the positive junction to which the component is connected, <b>n<sub>i</sub></b>, the negative junction to which the component is connected, and an integer <b>I<sub>i</sub></b> (1 &lt;= <b>I<sub>i</sub></b> &lt;= 100), the minimum amount of current required for component <b>i</b> to function. The junctions <b>p<sub>i</sub></b> and <b>n<sub>i</sub></b> are specified as either the character &apos;+&apos; indicating the positive terminal, the character &apos;-&apos; indicating the negative terminal, or an integer (between 1 and <b>N</b>) indicating one of the numbered junctions. No two components have the same positive junction and the same negative junction. The end-of-file is denoted by an invalid test case with <b>N</b> = <b>M</b> = 0 and should not be processed.","type":"input_format","format":"html"},{"title":"Output","content":"For each input test case, your program should print out either a single integer indicating the minimum amount of current that must be supplied at the positive terminal in order to ensure that every component is powered, or the message &quot;<b>impossible</b>&quot; if there is no way to direct a sufficient amount of current to each component simultaneously.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 10 \n+ 1 1 \n1 2 1 \n1 3 2 \n2 4 5 \n+ - 1 \n4 3 2 \n3 5 5 \n4 6 2 \n5 - 1 \n6 5 3 \n4 6 \n+ 1 8 \n1 2 4 \n1 3 5 \n2 4 6 \n3 - 1 \n3 4 3 \n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9 \nimpossible</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ACM-ICPC+Pacific+Northwest+Region&amp;source=1&amp;searchmode=source\"> 2008 ACM-ICPC Pacific Northwest Region </a> ","type":"source","format":"html"}]}