{"title":"PropBot","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3158","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3158&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3158","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3158"},"statement":[{"title":"Problem Description","content":"You have been selected to write the navigation module for PropBot. Unfortunately, the mechanical engineers have not provided a lot of flexibility in movement; indeed, the PropBot can only make two distinct movements. It can either move 10 cm forward, or turn towards the right by 45 degrees. Each of these individual movements takes one second of time.","type":"description","format":"html"},{"title":"Input","content":"Your module has two inputs: the Cartesian coordinates of a point on the plane that the PropBot wants to get as close to as possible, and the maximum number of seconds that can be used to do this. At the beginning of the navigation, the robot is located at the origin, pointed in the <b>+x</b> direction.<br><br>The number of seconds will be an integer between 0 and 24, inclusive. Both the x and y coordinates of the desired destination point will be a real number between -100 and 100, inclusive.<br><br>The first entry in the input file will be the number of test cases, <b>t</b> (0 &lt; <b>t</b> &lt;= 100). Following this line will be <b>t</b> lines, with each line containing three entries separated by spaces. The first entry will be the number of seconds PropBot has to get close to the point. The second entry is the <b>x</b>-coordinate of the point, and the third entry is the <b>y</b>-coordinate of the point.","type":"input_format","format":"html"},{"title":"Output","content":"Your program must return the distance between the goal point and the closest point the robot can get to within the given time.<br><br>Your result should include at least one digit to the left of the decimal point, and exactly six digits to the right of the decimal point. To eliminate the chance of round off error affecting the results, we have constructed the test data so the seventh digit to the right of the decimal point of the true result is never a 4 or a 5.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n24 5.0 5.0\n9 7.0 17.0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.502525\n0.100505</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2008+ACM-ICPC+Pacific+Northwest+Region&amp;source=1&amp;searchmode=source\"> 2008 ACM-ICPC Pacific Northwest Region </a> ","type":"source","format":"html"}]}