{"title":"Laurel Creek","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3170","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3170&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3170","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3170"},"statement":[{"title":"Problem Description","content":"Laurel Creek is a perilous river that divides the campus into two halves and contains dangerous inhabitants such as geese and beavers. Your task in this problem is to find a way to cross the river without getting wet. <br>To do so, you will take advantage of several tree stumps in the middle of the river. A tree stump provides a safe place for you to stand as you ponder your next move. To get from one stump to another, you walk along logs that connect the stumps. <br><br>In cases where no log connects to the stump you wish to reach, all is not lost. You may pick up any log adjacent to the stump on which you are standing and put it down somewhere else so that it leads to the stump you wish to reach. In order for a log to be considered adjacent to a stump, it must be oriented in the appropriate direction; for example the log in S-S is adjacent to the two stumps, but the log in S|S is not considered adjacent to the two stumps. <br><br>Each tree stump is located at a point on a square grid. Two stumps are designated as the beginning and end point of the crossing. Any two stumps lying in the same row or column of the grid may be connected by a log. At any point in time, you may perform one of the following legal moves:<br><ul><li>Traverse a log adjacent to the tree stump you are standing on to the tree stump at the opposite end of the log. </li><br><br><li>Pick up a log adjacent to the tree stump you are standing on. You may not hold more than one log at a time. </li><br><br><li>Put down the log that you are holding so that it connects the stump you are standing on to some other stump. The log must be of precisely the right length to reach the other stump. The log must rest in the water: you may not use a log to connect two stumps if there is a third stump directly between them, or if the log would cross some other log already in the water. </li></ul>.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains one integer specifying the number of test cases to follow. Each test case begins with a line containing two integers 1 &lt;= <i>r</i> &lt;= 15 and 1 &lt;= <i>c</i> &lt;= 15 specifying the number of rows and columns in the grid. Each of the next <i>r</i> lines of input contains <i>c</i> characters with the following meaning. The character S denotes a stump. The characters B and E denote the beginning and end stumps of the crossing, respectively. A consecutive sequence of - or | characters in a line denotes a single log whose length is proportional to the number of symbols. The character . denotes an empty grid point containing only water. There will never be more than fifteen stumps in the river. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a line containing a single integer, the minimum number of moves in which the end stump can be reached from the initial configuration. If it is not possible to reach the end stump from the initial configuration, output a line containing the integer 0.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n7 11\n....S......\n....|......\nB---S......\n...........\n...........\n...........\n....S.S...E</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2008.09&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2008.09 </a> ","type":"source","format":"html","require":["katex"]}]}