{"title":"Logo","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3174","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3174&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3174","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3174"},"statement":[{"title":"Problem Description","content":"Logo is a programming language built around a turtle. Commands in the language cause the turtle to move. The turtle has a pen attached to it. As the turtle moves, it draw lines on the page. The turtle can be programmed to draw interesting pictures. <br><br>We are interested in making the turtle draw a picture, then return to the point that it started from. For example, we could give the turtle the following program: <br><br><pre>fd 100 lt 120 fd 100 lt 120 fd 100 </pre><br>The command fd causes the turtle to move forward by the specified number of units. The command lt causes the turtle to turn left by the specified number of degrees. Thus the above commands cause the turtle to draw an equilateral triangle with sides 100 units long. Notice that after executing the commands, the turtle ends up in the same place as it started. The turtle understands two additional commands. The command bk causes the turtle to move backward by the specified number of units. The command rt causes the turtle to turn right by the specified number of degrees.<br><br>After executing many commands, the turtle can get lost, far away from its starting position. Your task is to determine the straight-line distance from the turtle&apos;s position at the end of its journey back to the position that it started from.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains one integer specifying the number of test cases to follow. Each test case starts with a line containing one integer, the number of commands to follow. The commands follow, one on each line. Each test case will contain no more than 1000 commands. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a line containing a single integer, the distance rounded to the nearest unit. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5\nfd 100\nlt 120\nfd 100\nlt 120\nfd 100</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2008.09&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2008.09 </a> ","type":"source","format":"html","require":["katex"]}]}