{"title":"Effective Government Spokesman","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3179","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3179&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3179","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3179"},"statement":[{"title":"Problem Description","content":"Nowaday, supermarket makes our life more convenient. We can buy a lot of things in supermarket. <br>Now in a city, the government has built two supermarkets. And the citizens want to know whether the sum of distance between their house and the supermarket is the smallest. Let&#x2019;s describe the problem more precisely. We define L1 is the distance from this house to supermarket A, L2 is the distance from this house to supermarket B, and D = L1 + L2. If there is no other house which has smaller D than this house, then this house is on the shortest road between supermarket A and supermarket B. Now the government needs your help to answer the citizen&apos;s question: Whether their house is built on the shortest path between supermarket A and supermarket B.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input is a single integer T, indicating the number of test cases. Following that are exactly t cases. In each case, the first line contains two integers: N, the number of houses, and M, the number of roads. Then M lines will follow, each of which contains three integers A B C, indicating there is a road between place A and B, whose length is C. Please note that all roads are undirected. The last line contains two integers A, B (A != B) separated by a space, indicating the location of the two supermarket. The next line contains an integer Q, the number of questions that citizens had asked. Then Q lines follow, each line contain a integer p, indicate the number of the house. There is only one road between any pair of places. There must exists a path between two places.<br><br>1&lt;= T &lt;= 50;<br>5 &lt;= N &lt;= 100;<br>N &#x2013; 1 &lt;= M &lt;= (N * (N - 1)) / 2;<br>1&lt;= A, B, Q, Q&lt;= N;<br>1 &lt;= C &lt; 1000;<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print Q lines, each of which you should print &#x201D;Yes&#x201D; if this house is on the shortest road between supermarket A and supermarket B , or &quot;No&quot; otherwise.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\t\n5 5 \n1 2 1\n2 3 1\n3 5 1\n1 4 1 \n4 5 2\n1 5\n5\n1 \n2 \n3 \n4 \n5\n\n5 5 \n1 2 1\n2 3 1\n3 5 1\n1 4 1 \n4 5 3\n1 5\n5\n1 \n2 \n3 \n4\n5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes\nYes\nYes\nYes\nYes\nYes\nYes\nYes\nNo\nYes</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+2009-10+Programming+Contest&amp;source=1&amp;searchmode=source\"> HDU 2009-10 Programming Contest </a> ","type":"source","format":"html"}]}