{"title":"Door Repairing","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3203","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3203&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3203","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3203"},"statement":[{"title":"Problem Description","content":"Once upon a time, there was a famous university called Famous University. As thousands of students studied and lived in FU, a gigantic residential building was built, which is called &apos;B37&apos;. All students lived in B37 happily.<br><br>After decades, FU is still as famous as it had been in the past; however, the students living in it are now unhappy, because B37 is too old. Although the door of the building looks fine, it can be easily broken when being opened by some careless student too forcefully.<br><br>So, YY, the accommodation officer of B37, is facing an extremely serious problem.<br><br>With some mysterious methods, YY has predicted that exactly N students will enter or exit B37 during the next term. Unfortunately he doesn&apos;t know who the careless ones are, so he assumes that every student opening the door has a probability of P percent to be a careless one. When the door is broken by some careless guy, YY may repair it immediately or after some time, with a cost of A yuan. Unfortunately when a student goes through the door and finds it already broken and not repaired, he will report it to the headmaster, and YY will be subject to a fine of B yuan. The door is in good condition before the term begins, and will be repaired by the university after the term ends, so YY can leave the door unrepaired at the end of the term.<br><br>Being good at mathematics, YY has made a strategy, to decide when to and when not to repair the door, in order to minimize his expense.<br><br>Please write a program to calculate the expectation of his expense.","type":"description","format":"html"},{"title":"Input","content":"The input consists of multiple test cases.<br><br>For each test case, there is one line containing four non-negative integers N, P, A, B described as above, with 0&lt;=N&lt;=100000, 0&lt;=P&lt;=100, 0&lt;=A&lt;=100, 0&lt;=B&lt;=100.<br><br>End of input is indicated by a line consisting of four zeros.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing the expectation of YY&apos;s minimal expense. Your answer should be rounded to 4 digits after the decimal point.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10 100 0 1\n10 100 1 0\n2 50 2 1\n0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.0000\n0.0000\n0.5000\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first sample, the door will be broken every time it is opened, but repairing is free, so just repair it every time.\nIn the second sample, nothing will be fined, so just leave the door unrepaired.\nIn the last sample, if the door is broken by the first student, YY will be fined 1 yuan, otherwise he doesn&#xFFFD;&#xFFFD;t need to pay anything.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Shanghai+Invitation+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Shanghai Invitation Contest Host by DHU </a> ","type":"source","format":"html"}]}