{"title":"Another Door Repairing Problem","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3210","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3210&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3210","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3210"},"statement":[{"title":"Problem Description","content":"Maybe you have already solved the <i>Door Repairing Problem</i> for YY, who is the officer of the accommodation building B37, in a famous university called Famous University. Maybe you have not, but it does not matter because the new term is coming. So here comes the <i>Another Door Repairing Problem</i>!<br><br>As is described in <i>Door Repairing Problem</i>, many students live in B37. The building is old, so sometimes a careless student such as LMY may open the door of the building too vigorously, and break it as a result. However, when a student opens the door and finds it already broken, he will report it to the headmaster, and YY will be punished as a result&#xFFFD;&#xFFFD;<br><br>More precisely, the door is fine at the beginning of the term. The term has a length of T<sub>term</sub>. During the term, the door will be opened many times, which can be regarded as a Poisson process, i.e., in any period of length T, the probability that the door will be opened k times is<img style=\"max-width:100%;\" src=\"../../../data/images/3210-1.jpg\">, <b>where &#xFFFD;&#xFFFD; is a positive real constant.</b> <br><br>Note that for any non-negative real T, <img style=\"max-width:100%;\" src=\"../../../data/images/3210-2.jpg\"><br>When the door is fine and is opened by some student, the probability that he carelessly breaks the door is p. (0&lt;p&lt;=1) When the door is broken, YY can repair it anytime he likes.<br><br>Both repairing the door and being punished cost a lot. YY has thought for many days trying to make a best strategy when to repair the door, so that his expense can be minimized in expectation. He failed, so he is going to try the simplest ways. Given the length of the term T<sub>term</sub>, the constant &#xFFFD;&#xFFFD;, the probability p, and the question type Q, you are to solve the <i>Another Door Repairing Problem</i>:<br><br>When Q=1, tell the expected number of times YY has to repair the door, if he always repairs it immediately after it is broken.<br><br>When Q=2, tell the expected number of times YY will be punished, if he never repairs the door.","type":"description","format":"html"},{"title":"Input","content":"Input contains multiple test cases.<br><br>A test case consists of a single line containing four numbers. The first is an integer Q, where Q=1 or Q=2 holds, indicating the type of the problem that you should solve. Three positive real numbers &#xFFFD;&#xFFFD;, T<sub>term</sub> and p follow. The real numbers may be given in fixed-point or scientific e notations. All real numbers can be store in a double data type of C/C++, with a sufficiently small error rate. See the sample input for details.<br><br>Input ends with a line containing four space-separated 0s.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing your solution to the specified problem. Your solution should be written in scientific notation: first output a real number, the coefficient part of your solution with two digits after the floating point; then output one space; then output an integer, the exponential part of your solution. You may assume that the absolute value of the exponential part is less than 100. See sample output for details.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 1 1 0.5\n1 1 1 1e0\n2 1 1 5.00000e-0001\n0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5.00 -1\n1.00 0\n2.13 -1\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nThe solution to sample input is 0.5, 1.0 and 0.213, respectively. \nDon&#xFFFD;&#xFFFD;t worry about inputting real numbers in scientific e notations. A simple scanf or cin as if it is fixed-point is OK.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Shanghai+Network+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Shanghai Network Contest Host by DHU </a> ","type":"source","format":"html"}]}