{"title":"Baking the Shaobing","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3211","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3211&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3211","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3211"},"statement":[{"title":"Problem Description","content":"After LMY has been married to YY, YY lives in happiness, for LMY does all housework. When YY feels hungry, LMY cooks something for him to eat. When YY felt thirsty, LMY feeds him with water. <br><br>Now YY feels hungry again, so he asks LMY for food. But LMY is not at home. Fortunately, YY finds a piece of shaobing (a Chinese styled cake) in the kitchen.<br><br>This shaobing looks rather tempting. It has a shape of a simple polygon with N vertices, and its mess is evenly distributed. LMY had hung a string from the ceiling to the gravity center of the shaobing, so that the whole shaobing keeps balanced and lies in a horizontal plane although there is only one point hanging.<br><br>When YY starts to enjoy the shaobing, tragedy occurred... It is raw!<br><br>There is only one stove in the kitchen. Its cooking area lies in a horizontal plane and has a shape of a circle. YY has adjusted it to the same plane where the shaobing lies to cook it. The circle is centered at (x0, y0), with radius r. After turning on the stove, the part of the shaobing lying on the cooking area will be cooked.<br><br>However, the stove cannot be moved. So is the hanging point of the shaobing, or it may fall to the ground. The string can be moved, but YY cannot move it, because LMY has some special use with it. After all, YY can only rotate the shaobing by the hanging point.<br><br>YY is so hungry that he cannot wait for the whole shaobing to be cooked. He wants to rotate it to a best angle, cook it and then eat the cooked part, to comfort his stomach in a fastest way.<br><br>What angle should the shaobing be rotated to, so that the cooked part is the biggest?<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. For each test case:<br><br>The first line consists of three integers x0, y0 and r, indicating the position and radius of the stove&#xFFFD;&#xFFFD;s cooking area.<br><br>The second line contains an integer N (3&lt;=N&lt;=15), indicating the number of vertices of the shaobing.<br><br>In the third line there are N pairs of integers (x1, y1), (x2, y2), ..., (xN, yN), indicating the coordinates of the vertices of the shaobing, in counterclockwise order.<br><br>All coordinates are in the range -1000 to 1000, inclusively.<br><br>There is a blank line separating test cases.<br><br>Input ends with a line where x0=y0=r=0, and this line should not be processed.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing only one real number, the biggest area of the cooked part. Your output should be rounded to 4 digits after the decimal point.<br><br>It is guaranteed that the fifth digit after the decimal point of the accurate result will not be 4, 5 or 6. In other words, do not worry about getting a Wrong Answer caused by only rounding error of your final result.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0 0 1\n3\n0 0 1 0 0 1\n\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.5000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Shanghai+Network+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Shanghai Network Contest Host by DHU </a> ","type":"source","format":"html"}]}