{"title":"Dual Processing Task","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3213","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3213&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3213","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3213"},"statement":[{"title":"Problem Description","content":"N items are to be processed with two product lines. YY operates the first line, and LMY operates the second. YY can use X processing modes for the first product<br> line, with his ith mode, processing an item costs Ai units of material while the item&#xFFFD;&#xFFFD;s value increases by Pi units. Similarly LMY can use Y modes for the second <br>product line, with her ith mode processing an item will cost Bi units of material and get Qi units of value increment. All items must be processed in both of the <br>product lines, each with one of their modes, to satisfy both YY and LMY. Note that when processing an item with some mode of a product line, the cost and value<br> increment are totally irrelevant to the mode chosen in the other line. YY and LMY want the value increment of the items to be maximized, but there are only M <br>units of material available. So they have to choose their modes carefully, use no more than M units of material and still make the value increment as large as possible.","type":"description","format":"html"},{"title":"Input","content":"The input file contains several test cases.<br><br>The first line of each test case contains two integers N and M indicating the number of items to be processed and the quantity of material available. The next line <br>contains an integer X, the number of modes YY has. X lines follow, the ith line of which contains two integers Ai and Pi, the material utilized and the value <br>increased by YY&#xFFFD;&#xFFFD;s ith mode of the first product line. The next line contains an integer Y, the number of modes LMY has. Y lines follow, the ith line of which contains<br> two integers Bi and Qi, the material utilized and the value increased by LMY&#xFFFD;&#xFFFD;s ith mode of the second product line.<br><br>All integers except N are less than or equal to 800 and non-negative, while X and Y are always positive. N is a non-negetive integer no more than 100000.<br>A line with N=M=0 indicates the end of input, and should not be processed.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing an integer, the maximum value increment after YY and LMY have processed all the N items with no more than M <br>units of material cost.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 100\n1\n1 1\n1\n2 2\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the sample, both YY and LMY have only one mode to choose, with sufficient materials. Processing 1 item with the only modes of the lines causes an increment\n of 3 units, so the output is 9.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Shanghai+Network+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Shanghai Network Contest Host by DHU </a> ","type":"source","format":"html"}]}