{"title":"Eclipse","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3214","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3214&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3214","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3214"},"statement":[{"title":"Problem Description","content":"As you know, when the moon goes between you and the sun, it may block your sight, and thus you can only see part of the sun, or even cannot see it at all. This is called eclipse.<br>Now the news says that an eclipse will take place in several days. Being interested in astronomy, YY is curious whether he can observe the eclipse in the city he lives in, or he has to go somewhere else. Without loss of generality, YY models the problem as follows:<br>&#xA0;&#xA0;&#xA0;&#xA0;1.There is one and only one light source, called &#x2018;the sun&#x2019;, in a 3-dimensional space. It is sphere shaped, centered at the origin (0, 0, 0), with radius R.<br>&#xA0;&#xA0;&#xA0;&#xA0;2.There is one and only one obstacle, called &#x2018;the moon&#x2019;, in the same 3D space. It is also sphere shaped, center at the point (x0, y0, z0), with radius r. Besides, it is completely opaque.<br>&#xA0;&#xA0;&#xA0;&#xA0;3.There is one and only one observer, called &#x2018;YY&#x2019;, in the same 3D space, too. He is not sphere shaped. Comparing to the moon and the sun, his volume is so small that he can be regarded as a point located at (x1, y1, z1). <br>&#xA0;&#xA0;&#xA0;&#xA0;4.There is nothing and nobody else in the space.<br>&#xA0;&#xA0;&#xA0;&#xA0;5.There is no assumption which of the two spheres is bigger.<br>&#xA0;&#xA0;&#xA0;&#xA0;6.The sun and the moon neither intersect with each other, nor even touch. And for his safety and comfort, YY will not be inside or on the surface of any of the spheres.<br>Four situations may occur:<br>&#xA0;&#xA0;&#xA0;&#xA0;1.Total eclipse: the sun is totally blocked by the moon, so no part of the sun can be seen by YY.<br>&#xA0;&#xA0;&#xA0;&#xA0;2.Partial eclipse: part of the sun is blocked, and part can be seen. To be distinguished from annular eclipse, part of the border of the sun must be blocked in a partial eclipse.<br>&#xA0;&#xA0;&#xA0;&#xA0;3.Annular eclipse: some central part of the sun is blocked and cannot be seen by YY, but the whole border of the sun must be visible.<br>&#xA0;&#xA0;&#xA0;&#xA0;4.No eclipse at all: The whole sun is observable, so YY cannot observe any eclipse at all.<br>","type":"description","format":"html"},{"title":"Input","content":"Input contains multiple test cases.<br><br>For each test case, there is only one single line consisting of 8 integers with absolute value no larger than 1000: R, r, x0, y0, z0, x1, y1, z1, indicating the radii of the sun and the moon, the location of the moon, and the location of YY. R and r are always positive.<br><br>A line with 8 space-separated 0s indicates the end of input.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one single line, containing one of the four strings &#x201C;total eclipse&#x201D;, &#x201C;partial eclipse&#x201D;, &#x201C;annular eclipse&#x201D; or &#x201C;no eclipse at all&#x201D; (Quotes exclusive) , according to which of the four situations occurs in the test case. It is guaranteed that, when the coordinates of the observer change slightly (for example, 10-4), the answer will not change.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 1 5 0 0 10 0 0\n0 0 0 0 0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">annular eclipse</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Shanghai+Network+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Shanghai Network Contest Host by DHU </a> ","type":"source","format":"html"}]}