{"title":"Health","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3217","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3217&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3217","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3217"},"statement":[{"title":"Problem Description","content":"Unfortunately YY gets ill, but he does not want to go to hospital. His girlfriend LMY gives him N kinds of medicine, which may be helpful. It is not a good idea to take all of them, since taking several different kinds of medicine may have side effect. Formally speaking, for each subset S of the N kinds of medicine (excluding the empty set), it has a health value v(S). If YY chooses to take a combination T of the medicines, the final effect to his illness is the sum of health values of all non-empty subsets of T.<br><br>YY wants to be healthy as quickly as possible, so the final effect of the medicines he takes should be as large as possible. Of course, YY may choose taking nothing to have a zero final effect, if he is too unlucky to achieve a positive one&#x2026;<br>","type":"description","format":"html"},{"title":"Input","content":"Input contains multiple test cases.<br><br>For each test case, the first line contains a positive integer N (N&#x2264;16), the number of different kinds of medicine YY received from LMY.<br><br>The second line contains a single integer M (0&#x2264;M&#x2264;2N).<br><br>M lines follow, representing a list of health values.<br><br>Each of the M lines contains 2 integers, s (1&#x2264;s&lt;2N)and v (-10000&#x2264;v&#x2264;10000), indicating a subset of the N kinds of medicine and its health value. Write s in binary representation and add leading zeros if needed to make it exactly N binary digits. If the ith binary digit of s is 1, then the subset it represents includes the ith kind of medicine; otherwise it does not.<br><br>It is guaranteed that no two lines of the list describe the same subset. All non-empty subsets that do not appear in the list have health value 0.<br><br>Input ends with N=0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line with only one integer, the maximum final effect that can be achieved.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n1 10\n2 -1\n3 100\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">109</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Shanghai+Network+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Shanghai Network Contest Host by DHU </a> ","type":"source","format":"html"}]}