{"title":"Compressed String","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3222","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3222&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3222","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3222"},"statement":[{"title":"Problem Description","content":"Dealing with super long character strings is Chris&#x2019;s daily work. Unfortunately, the strings are so long that even the fastest computer in the world cannot work with them.<br><br>Chris does her work in a smart way by compressing the strings into shorter expressions. She does her compression for each string in the following way:<br><br>a) Find a consecutive repeated substring of the original string, e.g. &#x201C;ab&#x201D; in &#x201C;cabababd&#x201D;.<br><br>b) Replace the repeating part with the bracketed repetend, followed by the times the repetend appears in the original string. e.g. Write &#x201C;cabababd&#x201D; as &#x201C;c[ab]3d&#x201D;. Note she can also write it as &#x201C;c[ab]1ababd&#x201D; or &#x201C;ca[ba]2bd&#x201D; and so on, although these string are not compressed as well as the first one is.<br><br>c) Repeat a) and b) several times until the string is short enough.<br><br>Chris does her compression quite well. But as you know, the work is boring and a waste of time. Chris has written a computer program to help her do the boring work. Unfortunately, there is something wrong with the program; it often outputs an incorrect result. To help her debug the program, you are ordered to write a debugger which can compare Chris&#x2019;s standard compressed string against the string compressed by the program.","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases.<br>The first line of the input contains an integer T, meaning the number of the test cases.<br><br>For each test case, there are two lines of character strings which the first one is Chris&#x2019;s standard compressed string and the second one is the program&#x2019;s compressed string. Both string contains only lowercase letters (a-z), square brackets ([]) and numbers (0-9). The brackets must be followed with an integer indicating the times the string in the brackets repeat, note that the repeat time can be zero. The brackets can be nested.<br>You can assume all the compressed strings in the input are no longer than 20.<br>See further details in the input sample.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output case number first. And then if the two uncompressed strings are the same, output &#x201C;YES&#x201D; in a single line; otherwise, output &#x201C;NO&#x201D; followed by the first position where the uncompressed strings differ.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\na[a]12\n[[a]3]4a\n[z]12\nzzzzzzzzz\n[a[ba]2b]12\n[ab]36\n[a]123123123[icpc]2\n[[a]123]1001001inter\naismoreeasierthanc\ngismuchharderthanj</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: YES\nCase #2: NO 10\nCase #3: YES\nCase #4: NO 123123125\nCase #5: NO 1\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nFor sample test case 3, the first string &#x201C;[a[ba]2b]12&#x201D; can be written as &#x201C;[ababab]12&#x201D;, then &#x201C;[[ab]3]12&#x201D;, finally we get &#x201C;[ab]36&#x201D;.\n\nThe numbers in this task may be very large and cannot be stored in a 32 bit integer.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Shanghai+Regional+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Asia Shanghai Regional Contest Host by DHU </a> ","type":"source","format":"html"}]}