{"title":"Flowers Placement","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3225","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3225&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3225","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3225"},"statement":[{"title":"Problem Description","content":"Bytetown has a long tradition in organizing an international flower exhibition. Professor Feuerbach, a true flower lover, visited the exhibition this year. He was pleased by the most beautiful flowers and other plants around the world roses, orchids, magnolias, cactuses. All flowers were nicely placed.<br><br>The flower placement that was the most appealing to him was composed of many kinds of flowers placed in a rectangular grid, such that each row of the grid contained each kind of flowers exactly once and each column of the grid contained each kind of flowers at most once.<br><br>Professor Feuerbach is a good mathematician and soon he realized that the number of columns of the grid has to be the same as the number of different kinds of flowers in the placement. The different kinds of flowers are represented by numbers 1, 2..., N, where N is the number of different kinds of flowers. Soon he encountered a new problem. He would like to add one row of flowers to the placement without violating the rules stated above. (Note that he may not modify the existing rows and therefore he may not use any new kinds of flowers in the new rows.) It&apos;s quite easy, but he wants to know the K-th lexicographically valid placement.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input data set describes about 100 flower placements. In the first line the number of placements is given.<br><br>Each flower placement description begins with three positive integers N (1&#x2264;N&#x2264;200), M (0&#x2264;M&#x2264;N), K (1&#x2264;K&#x2264;200) representing the number of columns and rows of the grid. The following M lines contain N integers each representing the kinds of flowers in one row of the placement.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each flower placement output one line containing N numbers, describing the added row. The numbers in the output file should be separated by exactly one space. If there are less than K valid placements, output -1 instead.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 2 2\n3 2 1\n1 3 2\n4 2 2\n1 4 3 2\n2 1 4 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: -1\nCase #2: 4 3 2 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Shanghai+Regional+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Asia Shanghai Regional Contest Host by DHU </a> ","type":"source","format":"html","require":["katex"]}]}