{"title":"Island Explorer","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3228","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3228&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3228","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3228"},"statement":[{"title":"Problem Description","content":"A group of explorers has found a solitary island. They land on the island and explore it along a straight line. They build a lot of campsites while they advance. So the campsites are laid on the line.<br><br>Coincidently, another group of explorers land on the island at the same time. They also build several campsites along another straight line. Now the explorers meet at the island and they decide to connect all the campsites with telegraph line so that they can communicate with each other wherever they are.<br><br>Simply building segments that connect a campsite to another is quite easy, but the telegraph line is rare. So they decide to connect all the campsites with as less telegraph line as possible. Two campsites are connected if they are directly connected with telegraph line or they are both connected to another campsite.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases.<br>The number of the test cases is in the first line of the input.<br><br>For each test case, first line contains two integers N and M (0&#x2264;N, M&#x2264;10000), which N is the number of the campsites of the first group of explorers and M is the number of the campsites of the second group of explorers. And there exist at least one campsite.<br><br>The next two lines contain eight integers Ax, Ay, Bx, By, Cx, Cy, Dx, Dy. Their absolute values are less than 1000. The integers are the coordinates of four points A, B, C and D. The exploring path of the first group is begin with the first point A and end with the second point B, and the path of the second group is from the third point C to the fourth point D. Every pair of points is distinct.<br><br>The last two lines of the test case contain N and M real numbers; they indicate the positions of the campsites. Suppose the i-th real number in the first line is t. It means the x-coordinate of the i-th campsite is Ax * t + Bx * (1-t), and the y-coordinate is Ay * t + By * (1-t). Equally, the campsite on the second straight line is C * t + D * (1-t). You can assume that there are at most four digits in the decimal part, and the numbers are always between 0 and 1.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output contains only a real number rounded to 0.001.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n4 4\n0 0 10 10\n0 10 10 0\n0.1 0.3 0.6 0.8\n0.1 0.3 0.6 0.8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 19.638\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nThe graph below shows the solution of the sample test.\n<center><img src=\"../../../data/images/3228-1.jpg\"></center>\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Shanghai+Regional+Contest+Host+by+DHU&amp;source=1&amp;searchmode=source\"> 2009 Asia Shanghai Regional Contest Host by DHU </a> ","type":"source","format":"html","require":["katex"]}]}