{"title":"Gift Hunting","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3236","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3236&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3236","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3236"},"statement":[{"title":"Problem Description","content":"After winning two coupons for the largest shopping mart in your city, you can&apos;t wait inviting your girlfriend for gift hunting. Having inspected hundreds of kinds of souvenirs, toys and cosmetics, you finally narrowed down the candidate list to only <i>n</i> gifts, numbered 1 to <i>n</i>. Each gift has a happiness value that measures how happy your girlfriend would be, if you get this gift for her. Some of them are special - you <b>must</b> get it for your girlfriend (note that whether a gift is special has nothing to do with its happiness value).<br><br>Coupon 1 can be used to buy gifts with total price not greater than <i>V</i>1 (RMB). Like most other coupons, you <b>can&#xFFFD;&#xFFFD;t</b> get any money back if the total price is strictly smaller than <i>V</i>1. Coupon 2 is almost the same, except that it&#xFFFD;&#xFFFD;s worth <i>V</i>2. Coupons should be used separately. That means you cannot combine them into a super-coupon that&#xFFFD;&#xFFFD;s worth <i>V</i>1+<i>V</i>2. You have to divide the gifts you choose into two part, one uses coupon 1, the other uses coupon 2.<br><br>It is your girlfriend&apos;s birthday today. According to the rules of the mart, she can take one (only one) gift for FREE! Here comes your challenge: how to make your girlfriend as happy as possible?","type":"description","format":"html"},{"title":"Input","content":"There will be at most 20 test cases. Each case begins with 3 integers <i>V</i>1, <i>V</i>2 and <i>n</i> (1 &lt;= <i>V</i>1 &lt;= 500, 1 &lt;= <i>V</i>2 &lt;= 50, 1 &lt;= <i>n</i> &lt;= 300), the values of coupon 1 and coupon 2 respectively, and the number of candidate gifts. Each of the following <i>n</i> lines describes a gift with 3 integers: <i>P</i>, <i>H</i> and <i>S</i>, where <i>P</i> is the price, <i>H</i> is the happiness (1 &lt;= <i>P,H</i> &lt;= 1000), <i>S</i>=1 if and only if this is a special gift - you must buy it (or get it for free). Otherwise <i>S</i>=0. The last test case is followed by <i>V</i>1 = <i>V</i>2 = <i>n</i> = 0, which should not be processed.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the case number and the maximal total happiness of your girlfriend. If you can&apos;t finish the task, i.e. you are not able to buy all special gifts even with the 1-FREE bonus, the happiness is -1 (negative happiness means she&apos;s unhappy). Print a blank line after the output of each test case.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2 4\n3 10 1\n2 10 0\n5 100 0\n5 80 0\n3 2 4\n3 10 1\n2 10 0\n5 100 0\n5 80 1\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 120\n\nCase 2: 100</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Wuhan+Regional+Contest+Hosted+by+Wuhan+University&amp;source=1&amp;searchmode=source\"> 2009 Asia Wuhan Regional Contest Hosted by Wuhan University </a> ","type":"source","format":"html"}]}