{"title":"Windows","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3243","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3243&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3243","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3243"},"statement":[{"title":"Problem Description","content":"Consider the following scenario. The screen has width 200 and height 100. There are three windows on the screen.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3243-1.jpg\"></center><br><br>The left picture shows the initial configuration. Windows are drawn from bottom to top, according to the ID, so window 1 is at the bottom, and window 3 is at the top. The right picture shows the screen after clicking at (60, 20). Point (60, 20) is in the visible part of window 1, so it is brought to the top (each time a window is clicked, it gets focus, and brought to the top. The relative order of other windows won&#x2019;t change). If you then click at (150, 90), nothing will change, since it is not within the visible part of any window. Then, after clicking at (150, 30), window 2 will get focus. Note that, each window includes all points on its borders: if its top-left corner and bottom-right corner are (x1,y1) and (x2,y2) respectively, it includes exactly the points (x, y) such that x1 &lt;= x &lt;= x2, y2 &lt;= y &lt;= y1.<br>Your task is to determine, for each click, the ID of window which is just clicked on (or 0 if no window is clicked).","type":"description","format":"html"},{"title":"Input","content":"There will be only one case, beginning with two integer numbers C and R (1 &lt;= C, R &lt;= 10000), the number of columns and rows, respectively. The third line contains an integer n (1 &lt;= n &lt;= 50000), the number of windows. On each of the next n lines, there are four integers x1, y1, x2, y2, the top-left and bottom-right coordinates of the window. The window is non-empty (i.e. x1 &lt; x2, y2 &lt; y1).The window IDs are 1, 2, 3, &#x2026;, n, in the order they appear in the input. On the next line, there is an integer m (1 &lt;= m &lt;= 100000), the number of mouse clicks. On each of the next m lines, there will be two integers x and y, the coordinate clicked. In the judge input, all the coordinates (x, y) will be<b> randomly generated</b> within the screen (i.e. 1 &lt;= x &lt;= C, 1 &lt;= y &lt;= R).","type":"input_format","format":"html"},{"title":"Output","content":"For each click, print the window ID being clicked. If there is no window get clicked, print 0. Output a blank line after each test case.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">200 100\n3\n50 50 80 20\n70 60 180 10\n10 90 100 40\n3\n60 20\n150 90\n150 30</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n0\n2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+%A1%B0NIT+Cup%A1%B1+National+Invitational+Contest&amp;source=1&amp;searchmode=source\"> 2009 &#x201C;NIT Cup&#x201D; National Invitational Contest </a> ","type":"source","format":"html"}]}