{"title":"Special Flow","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3246","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3246&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3246","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3246"},"statement":[{"title":"Problem Description","content":"There are n junctions numbered from 1 to n, connected by <b>undirected</b> pipes, in which water can flow through. Junction 1 is the source, junction n is the sink. Pipes have capacities, restricting the maximal velocity that water can move through. There will be no water leak, so for every junction (except the source and sink), the amount of water flowing into the junction is equal to the amount of water flowing out of it.<br>Your task is to find the maximal volume of water that can flow from junction 1 to junction n, during one unit time. Isn&#xFFFD;&#xFFFD;t it the traditional max-flow problem? Well, not exactly. There is an additional restriction in this problem: for an arbitrary pair of junctions u and v, there is a constant S(u,v) such that, in <b>every</b> path from u and v, the <b>sum of water velocity</b> on the arcs along the path is always S(u,v). We calculate the sum in a way such that if the water flows against direction of the path from u to v, its velocity is negated. Note that, for two different pairs (u1,v1) and (u2,v2), S(u,v) may be different from S(u2,v2).<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3246-1.jpg\"></center><br>The picture above shows an example pipe network. Capacities of the pipes are shown in the left, while the actual water velocity and flowing directions are shown in the right. You can examine, for example, S(2,4) = 2.8, S(3,1)=-2, S(1,4)=4.4.","type":"description","format":"html"},{"title":"Input","content":"There will be at most 30 test cases. Each case begins with two integers n and m (2 &lt;= n &lt;= 100, 1 &lt;= m &lt;= 5000), the number of junctions and pipes. The next m lines contain the description of pipes. Each pipe is represented by three integers a, b and c, where a and b are the numbers of two <b>different</b> junctions connected by the pipe, and c is the maximal possible water velocity in that pipe (0 &lt;= c &lt;= 10000). The input ends with n = m = 0. There can be multiple pipes between a given pair of junctions.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the maximum volume as a floating point number (in any format you like). This number should match the exact result with the maximal absolute difference of 0.0001.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 6\n1 3 2\n1 2 3\n1 2 2\n2 4 5\n2 3 2\n3 4 5\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5.2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+%A1%B0NIT+Cup%A1%B1+National+Invitational+Contest&amp;source=1&amp;searchmode=source\"> 2009 &#xFFFD;&#xFFFD;NIT Cup&#xFFFD;&#xFFFD; National Invitational Contest </a> ","type":"source","format":"html"}]}