{"title":"Automatic Tetris Player","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3250","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3250&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3250","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3250"},"statement":[{"title":"Problem Description","content":"A random sequence of tetrominoes (sometimes called &quot;tetrads&quot; in older versions)-shapes composed of four square blocks each-fall down the playing field (a rectangular vertical shaft, called the &quot;well&quot; or &quot;matrix&quot;). The object of the game is to manipulate these tetrominoes, by moving each one sideways and rotating it by 90 degree units, with the aim of creating a horizontal line of blocks without gaps. When such a line is created, it disappears, and any block above the deleted line will fall. As the game progresses, the tetrominoes fall faster, and the game ends when the stack of tetrominoes reaches the top of the playing field and no new tetrominoes are able to enter.<br><br>-- Wikipedia (http://en.wikipedia.org/wiki/Tetris)<br><br><b>Task</b><br>The seven one-sided tetrominoes below are represented by I, J, L, O, S, T, Z from first row to the second, left to right. Look at their shapes, then you&apos;ll realize why they&apos;re called this way.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3250-1.jpg\"></center><br>Your task is to implement an automatic tetris player. You&apos;ll be given a sequence of blocks, and your objective is to minimize the sum of squares of column heights. By &quot;height&quot;, we mean the row number of the topmost non-empty unit block of that column. Rows are numbered 1, 2, 3, ..., in a bottom-up order. Technically, if we denote the height of column i by hi, you should minimize sum{(hi)<sup>2</sup>}.<br><br>For simplicity, assume each block is falling from high enough, and you cannot control the block anymore, once you decide its rotating and horizontal position. Note that you cannot mirror the blocks, only horizontal moving and rotating is permitted.<br><br>The field is always 5 columns wide. When a line of unit blocks are eliminated, the vertical position of everything above the line is decreased by 1. This is the most widely used algorithm. But the resulting board may looks strange, since things can &quot;float up in the sky&quot;, see below.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/3250-2.jpg\"></center><br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer T (T &lt;= 20), the number of test cases. Each case contains a single line of a string, representing the block sequence. There will be no more than 5 blocks, each of them will be one of I, J, L, O, S, T and Z. ","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the case number and the minimal possible score. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\nLLLLO\nIJ\nSTZ</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 0\nCase 2: 3\nCase 3: 15</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Regional+Ningbo+Online&amp;source=1&amp;searchmode=source\"> 2009 Asia Regional Ningbo Online </a> ","type":"source","format":"html"}]}