{"title":"Facer is learning to swim","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3260","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3260&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3260","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3260"},"statement":[{"title":"Problem Description","content":"Facer is addicted to a game called &#x201C;Tidy is learning to swim&#x201D;. But he finds it too easy. So he develops a new game called &#x201C;Facer is learning to swim&#x201D; which is more difficult and more interesting.<br><br>In the new game, a robot named &#x201C;Facer&#x201D; is swimming in a pool. The pool can be considered as a vertical N&#xD7;M grid. The coordinates of the top-left cell is (1,1), and the coordinates of the bottom-right cell is (N,M). Cells in the top rows are called &#x201C;surface cells&#x201D;, and all other cells are called &#x201C;under water cells&#x201D;.  <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/254-1001-1.jpg\"></center><br>Facer starts swimming from the top-left cell (1,1) and must arrive at the top-right cell (1,M). He has a constant horizontal speed of 1 per second, and a vertical speed of v per second. v is always integer and can be changed. If v is positive, it means Facer is moving down; and if v is negative, it means Facer is moving up. So if Facer is at cell (x,y) now , he will arrive at cell (x+v,y+1) after a second. Be careful that if x+v&gt;N, Facer will get to cell (N,y+1) because he cannot move down anymore and of course if x+v&lt;1, Facer will get to cell (1,y+1) because he cannot fly. Please remember that all the &#x201C;under water cells&#x201D; in the right-most column are poisonous. If Facer goes into those cells, he will die. <br><br>The capacity of Facer&#x2019;s oxygen bottle is limited, and when Facer gets into a surface cell, the oxygen bottle is refilled automatically. Facer has to refill his oxygen bottle every K seconds, which means that during the time between two refillings, Facer can only pass at most K-1 under water cells in the horizontal direction.<br><br>In every cell, there is either a &#x201C;speed changing machine&#x201D; or a &#x201C;money box&#x201D; (can&#x2019;t be both). Every speed changing machine has a value T and every money box has a value P.  <br><br>You have got enough number of devices called &#x201C;speedo&#x201D;. Every speedo has a value Q which is 1 or -1. You can put your speedos in any cells, but you can put at most one speedo in a cell. <br><br>When Facer reaches a cell, the speed changing machine of value T in that cell (if there is one) will change his vertical speed by T, and the speedo of value Q in that cell (if there is one) will change his vertical speed by Q. For example, if Facer&#x2019;s vertical speed is v when he arrives at a cell with a speed changing machine of value T and a speedo of value Q, his vertical speed will be changed to v + T + Q immediately. There are three more things you need to know about speed changing:<br>1.&#xA0;&#xA0;All speed changing machines in the surface cells can&#x2019;t work.<br>2.&#xA0;&#xA0;When reaching a surface cell without a speedo, Facer&#x2019;s vertical speed becomes zero immediately; and when reaching a surface cell with a speedo of value Q, Facer&#x2019;s vertical speed becomes Q immediately.<br>3.&#xA0;&#xA0;When reaching a bottom cell, though Facer can&#x2019;t go down any more, his vertical speed will NOT be changed unless there is a speedo or a speed changing machine in that cell. It&#x2019;s maybe sound a little bit weird but Facer really is such a weird guy.<br><br>When arriving at a cell with a money box of value P, Facer gets P dollars (In fact, if P is negative, Facer loses |P| dollars). Facer&#x2019;s total amount of money can be negative --- that means Facer owes some money to the pool&#x2019;s owner.<br>You task is deploying your speedos in a smart way before Facer starts swimming, so Facer can get money as much as possible when he arrives at cell (1,M).  Facer&#x2019;s initial vertical speed is zero and if you put a speedo in the cell (1,1), it will change Facer&#x2019;s initial vertical speed.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Multiple test cases, ended by a line of &#x201C;0 0 0&#x201D;.  For each test case:<br>The first line contains three integers N,M and K (1&lt;=N&lt;=100, 1&lt;=M&lt;=1000, 1&lt;=K&lt;=10), tells the size of the pool and Facer must refill the oxygen bottle every K seconds. <br>Following are N lines describing the cells by top to bottom order. Each line contains M elements, separated by blanks, telling the information about the cells of a row, by left to right order. There are only two kinds of elements: <br>1.&#xA0;&#xA0;a char &#x201C;v&#x201D; followed by an integer T, meaning that there is a &#x201C;speed changing machine&#x201D; of value T (-20&lt;=T&lt;=20) in the correspondent cell.<br>2.&#xA0;&#xA0;a char &#x201C;$&#x201D; followed by an integer P, meaning that there is a &#x201C;money box&#x201D; of value P (-1000000&lt;=P&lt;=1000000)  in the correspondent cell.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output one line containing an integer representing the maximum amount of money Facer can get when he reaches cell (1,M).","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 10 3\n$81 $47 $3 $0 $82 $31 $89 v0 $97 v-1\n$14 $94 v1 v-1 v1 $106 v1 v0 v-1 v0\n$93 $105 v-1 $219 v0 v0 v-1 v1 $225 v1\nv0 $160 v1 v1 $348 $120 $240 $392 $280 $172\n$305 $455 $140 v-1 $455 v0 v-1 v0 v1 $410\n0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">430</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Ningbo+Regional+Contest+Hosted+by+NIT+&amp;source=1&amp;searchmode=source\"> 2009 Asia Ningbo Regional Contest Hosted by NIT  </a> ","type":"source","format":"html","require":["katex"]}]}