{"title":"Zombies VS Plants","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3261","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3261&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3261","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3261"},"statement":[{"title":"Problem Description","content":"Facer was addicted to a popular game called &#xFFFD;&#xFFFD;Plants VS Zombies&#xFFFD;&#xFFFD;. After Facer had completed all missions, he started to play the zombies&#xFFFD;&#xFFFD; role to destroy plants and called the new game &#xFFFD;&#xFFFD;Zombies VS Plants&#xFFFD;&#xFFFD;.<br><br>In the game &#xFFFD;&#xFFFD;Zombies VS Plants&#xFFFD;&#xFFFD;, there are 3 kinds of zombies: Little Zombie, Adult Zombie and Football player. Different zombies have different price and different &#xFFFD;&#xFFFD;attacking value&#xFFFD;&#xFFFD; indicating the capability to attack, as shown in the table below: <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/254-1002-1.jpg\"></center><br>Spiders also can destroy the plants. Every spider costs 125 dollars. <br><br>There are 4 kinds of plants: Sunflower, Bean, Magnet and Lettuce. Every plant has a &#xFFFD;&#xFFFD;defending value&#xFFFD;&#xFFFD; indicating it&#xFFFD;&#xFFFD;s capability of defense. <br><br>Facer&#xFFFD;&#xFFFD;s mission is to destroy ALL the plants in the field. In order to destroy plants, Facer needs to buy zombies or spiders and put them into the field. The plants field can be considered as a 5&#xFFFD;&#xFFFD;5 grid(of course 25 cells), as shown in the figure below: <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/154-1002-2.jpg\"></center><br>There is a plant in every cell. Facer can destroy plants only by two ways:<br><br>1.&#xA0;&#xA0;If Facer puts one or more zombies together into a row of the field, and the sum of those zombies&#xFFFD;&#xFFFD; attacking values is larger than the sum of defending values of the plants in the same row, all plants in that row will be destroyed.<br><br>2.&#xA0;&#xA0;Putting a spider in a cell will destroy the plant in it. But there are some exceptions as shown in the description of plant &#xFFFD;&#xFFFD;Lettuce&#xFFFD;&#xFFFD; in a table below.<br><br>Once a zombie is put into the plants field, it dies immediately after destroying the plants. So does a spider. In other words, Facer can use a zombie or a spider only once.<br><br>This is a table describing the features of different kinds of plants:<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/154-1002-4.jpg\"></center><br><br>Facer can earn P1 dollars after destroying a row of plants, and destroying a sunflower will earn extra P2 dollars for him. Facer has P3 dollars but no zombies and no spiders at the begging. Of course Facer can use the money he earned to buy zombies and spiders.<br><br>Your job is helping Facer to accomplish his mission and keep money as much as possible after the mission. <br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases.<br>The first line in the input is a integer T indicating the number of test cases.( 1&lt; T &lt;= 400 )<br><br>For each test case:<br>First line contains three integers P1, P2 and P3 ( 0 &lt;= P1, P2, P3 &lt;= 10000), meaning that Facer earns P1 dollars after destroying a row of plants and earns P2 dollars after destroying a sunflower, and Facer has P3 dollars at the beginning. <br>Following are 5 lines describing the plants field by top to bottom order. Each line contains 5 integers, telling what&#xFFFD;&#xFFFD;s in the cells of a row, by left to right order. For those 5 integers: <br>&#xFFFD;&#xFFFD;1&#xFFFD;&#xFFFD;  represents a sunflower.<br>&#xFFFD;&#xFFFD;2&#xFFFD;&#xFFFD;  represents a bean.<br>&#xFFFD;&#xFFFD;3&#xFFFD;&#xFFFD;  represents a magnet.<br>&#xFFFD;&#xFFFD;4&#xFFFD;&#xFFFD;  represents a lettuce.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing an integer indicating the maximum amount of dollars Facer can keep after he accomplishes the mission. If Facer can&#xFFFD;&#xFFFD;t destroy all the plants, print -1 instead.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n100 100 10000\n2 2 2 2 2\n2 3 2 2 2\n3 3 4 3 2\n2 3 2 2 2\n2 2 2 2 2\n0 0 0\n2 2 2 2 2\n2 2 2 2 2\n2 2 2 2 2\n2 2 2 2 2\n2 2 2 2 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9025\n-1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Ningbo+Regional+Contest+Hosted+by+NIT+&amp;source=1&amp;searchmode=source\"> 2009 Asia Ningbo Regional Contest Hosted by NIT  </a> ","type":"source","format":"html"}]}