{"title":"Seat taking up is tough","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3262","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3262&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3262","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3262"},"statement":[{"title":"Problem Description","content":"Students often have problems taking up seats. When two students want the same seat, a quarrel will probably begin.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/254-1003-1.jpg\"></center><br>It will have very bad effect when such subjects occur on the BBS.<br>So, we urgently need a seat-taking-up rule. After several days of argument, the rule finally comes out:<br>As shown in the figure below, the seats in a classroom form a n&#xD7;m grid( n rows and m columns), and every cell in the grid represents a seat. The coordinates of the seat in the north-west corner are (1,1) and the coordinates of the seat in the south-east corner seat are (n,m). As you know, some seats make you feel good and some seats don&#x2019;t.  So every seat has a &#x201C;feeling index&#x201D;.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/254-1003-2.jpg\"></center><br>Students can take up seats for himself and his friends. Of course, if a seat is already taken up by a student, it can&#x2019;t be taken up by others. <br>For the convenience of communication between friends, when a student is trying to take up seats, he wants all the seats he needs to be consecutive and in the same row. If he can do that, he takes up all the seats he needs, and save the most western one for himself. For example, if a student wants to take up 3 seats, then taking (2,2),(2,3),(2,4) and saving (2,2) for himself is ok; but taking (2,2),(2,4),(2,5) is invalid because those seats are not consecutive. Under the precondition of accomplishing his seat-taking job, a student always wants the &#x201C;feeling index&#x201D; of his seat to be as large as possible.  <br>However, if a student cannot take up all the seats he needs, he will just try to take up only one seat for himself because he doesn&#x2019;t want to get into the trouble of explaining &#x201C;Why they can get seats but I can&#x2019;t?&#x201D; to some of his friends. Of course he still wants the &#x201C;feeling index&#x201D; of his seat to be as large as possible in that situation.<br>Everyone wants to know where are the seats he can take up .This problem seems a little bit complicated for them. So they want you to write a program to solve the problem.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases and the input ended by a line of &#x201C;0 0 0&#x201D;.<br>For each test case:<br>The first line contains three integers: n , m and k ( 1 &lt;= n,m&lt;=30, 1&lt;=k&lt;=50).  It means that there are n rows of seats in the classroom and there are m seats in every row. k is the number of students who come into the classroom trying to take up seats.<br>Following are n lines describing the seats by north to south order .Each line represents a row of seats and contains m integers, indicating the &#x201C;feeling index&#x201D; of every seat in that row, by west to east order. &#x201C;Feeling index&#x201D; can be fit in a 32-bit integer.<br>Then k lines follow (We call them k &#x201C;student lines&#x201D;). Each line is in the format of &#x201C;hh:mm q&#x201D; ( 0 &lt;= hh &lt; 24, 0 &lt;=mm &lt;= 59, 1&lt;=q&lt;=50 ) meaning that a student comes into the classroom at mm minutes past hh o&#x2019;clock, trying to take up q seats. mm and hh are all two digit integers with possible leading zero, and q is also an integer. Please note that when a student enters the class room, he begins to do his seat taking job immediately and the job takes no time. <br>It is guaranteed that the &#x201C;feeling index&#x201D; of every seat is different and no students come into the classroom at the same time.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"You should output k lines for each test case, in the order that correspondent to the above mentioned k &#x201C;student lines&#x201D; in the input. Each line must contain two integers indicating the coordinates of the seat which is saved by the student for himself. If the student can&#x2019;t take up any seats, just output a &#x201C;-1&#x201D; instead. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5 8\n11 12 15 14 13\n21 22 25 24 23\n16 17 20 19 18\n6 7 10 8 9\n1 2 5 4 3\n09:00 2  \n09:01 5  \n09:02 5  \n09:03 5  \n09:04 5  \n09:05 3  \n09:06 2  \n09:07 3  \n0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3\n3 1\n1 1\n4 1\n5 1\n2 5\n2 1\n-1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Ningbo+Regional+Contest+Hosted+by+NIT+&amp;source=1&amp;searchmode=source\"> 2009 Asia Ningbo Regional Contest Hosted by NIT  </a> ","type":"source","format":"html","require":["katex"]}]}