{"title":"Ancient vending machine","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3263","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3263&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3263","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3263"},"statement":[{"title":"Problem Description","content":"Though the story of Shaolong Xiang, the great time-traveler, is not recorded in the history, some recent discoveries show the possibility that the ancient mystery visitor might really exist. Several months ago, a strange machine was found together with some newly unearthed terra-cotta warriors. That machine looks like a modern machine and even has some electronic parts &#xFFFD;&#xFFFD; that&#xFFFD;&#xFFFD;s why people take Mr. Xiang into consideration when guessing the origin of the strange machine. <br><br>After careful examinations, scientists finally figured out what the machine is -- it actually is a vending machine in Qin dynasty! There is a hole on a panel of the machine, and scientists are pretty sure that Qin people put their coins into the machine through that hole to buy things. As you know, there were too many different types of coins before Qin dynasty and Emperor Qin Shihuang didn&#xFFFD;&#xFFFD;t like that. But scientists found an announcement made by Qin Shihuang carved on the machine, saying that any coins which can go through the hole is still legal to use. Now your task is to determine whether a certain type of coin can be put into the hole&#xFFFD;&#xFFFD;from these results we might find some clues about the mystery time-traveler.<br><br>The hole on the panel is a polygon and all coins also have a shape of polygon. THEY ALL MAYBE CONCAVE. Scientist found out that ancient people use the vending machine this way: The panel with the hole was positioned horizontally, and the customer chose a best position above the hole to hold a coin. Then the customer dropped the coin. During the process of felling down, the coin WOULD NOT ROTATE in any direction. If the coin could go through the hole, the coin is considered &#xFFFD;&#xFFFD;legal&#xFFFD;&#xFFFD;. Otherwise, the coin is judged &#xFFFD;&#xFFFD;illegal&#xFFFD;&#xFFFD;. If the coin just merely touched the edges of the hole but was not blocked, it was considered as legal. For example, as shown in the sample input, a square coin with side length 5 can go through a triangle hole with sides of length 3, 4 and 5 , so it&#xFFFD;&#xFFFD;s legal. <br><center><img style=\"max-width:100%;\" src=\"../../../data/images/254-1004-1.jpg\"></center><br>Please note that coins and the panel are all considered as no thickness. ","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T representing the number of test cases( 0 &lt; T &lt;= 20).<br>For each test case, the first line contains an integer N (3&lt;=N&lt;=20), representing the number of vertexes of the hole-polygon. <br>Next N lines describe the shape of the hole-polygon by listing positions of all vertexes in counterclockwise order. Each line contains two real numbers r1 and r2 ( -100 &lt;= r1,r2 &lt;=100), describing the position of a vertex.<br> <br>The next line contains an integer M (3&lt;=M&lt;=20), representing the number of vertexes of the coin-polygon. <br><br>Next M lines describe the shape of the coin-polygon by listing positions of all vertexes in counterclockwise order. Each line contains two real numbers r1 and r2 ( -100 &lt;= r1,r2 &lt;=100), describing the position of a vertex.<br><br>The positions mentioned above are relative coordinates but not absolute values. <br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing either the word &#xFFFD;&#xFFFD;legal&#xFFFD;&#xFFFD; or the word &#xFFFD;&#xFFFD;illegal&#xFFFD;&#xFFFD;, which represents that the coin can or can&#xFFFD;&#xFFFD;t go through the hole.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\n0 0\n4 0\n4 1\n0 1\n3\n0 4\n1 4\n1 0\n3\n0 0\n4 0\n0 3\n4\n0 0\n5 0\n5 5\n0 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">legal\nlegal</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Ningbo+Regional+Contest+Hosted+by+NIT+&amp;source=1&amp;searchmode=source\"> 2009 Asia Ningbo Regional Contest Hosted by NIT  </a> ","type":"source","format":"html"}]}