{"title":"Hamlet’s gambling","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3266","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3266&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3266","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3266"},"statement":[{"title":"Problem Description","content":"<i>&#x201C;There are a thousand Hamlets in a thousand people&apos;s eyes. &#x201D;<br>&#xA0;&#xA0;&#xA0;&#xA0;----W. William Shakespeare</i><br><br>Lotus is a big fan of Shakespeare. Her favorite tragedy written by Shakespeare is Hamlet, one of the most popular works in English language. However, since Lotus is really a merciful and kindhearted girl, she doesn&#x2019;t like the scene of the final match, in which Hamlet fenced against Laertes. Once she had a dream of Hamlet. In that dream, Hamlet fought with Laertes in another way: flipping coins.<br><br>It sounds like gambling. In order to flip the coin in an absolutely fair way, Hamlet got a monkey to do this job instead of people. Before the monkey started to flip, Hamlet and Laertes respectively wrote down an arbitrary sequence of results (we call it a &#x201C;pattern&#x201D;). For example, Hamlet wrote down &#x201C;Head, Tail, Head&#x201D; while Laertes wrote down &#x201C;Head, Head, Tail, Tail&#x201D;.It was guaranteed that the pattern of Hamlet&#x2019;s did not occur within the pattern of Laertes&#x2019;, nor did the pattern of Laertes&#x2019; occur within the pattern of Hamlet&#x2019;s. Then the monkey began to flip the coin over and over and generated a sequence of results, like &#x201C;Head, Head, Tail, Head, Tail &#x2026;&#x201D; At any time, if the monkey obtained Hamlet&#x2019;s pattern, it stopped flipping and Hamlet won. Otherwise, if the monkey obtained Laertes&#x2019;s pattern, it also stopped flipping and Laertes won. <br><br>One example of the gambling is like following: Hamlet&#x2019;s pattern was &#x201C;HHT&#x201D; (H=Head, T=Tail) and his rival&#x2019;s pattern was &#x201C;HTTT&#x201D;. The monkey flipped the coin and obtained &#x201C;H, T, H, T, T, H, T, T, T&#x201D;. At that time, Laertes&#x2019; pattern appeared at the end of the sequence, so the monkey stopped and the judge declared that Laertes won the game. <br><br>Now your task is to decide that in Lotus&#x2019; gambling, who has the higher probability to win the game. Pay attention that since the monkey has no bias, the probabilities to get head or tail in one flip are always equal.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. The first line of each case contains two positive integers N and M (0&lt;N, M&lt;=100000). N is the length of Hamlet&#x2019;s pattern and M is the length of Laertes&#x2019;. The second line contains a string of length N, representing the pattern of Hamlet&#x2019;s. The third line contains a string of length M, representing the pattern of Laertes&#x2019;. All the strings only contain uppercase letters &#x2018;H&#x2019; and &#x2018;T&#x2019;. The input ends by a line of two zeros.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line to show your answer. If Hamlet has a better chance to win, output the word &#x201C;Hamlet&#x201D;. If Laertes has a better chance, output the word &#x201C;Laertes&#x201D;. If they have the same probability to win the game, output the word &#x201C;Equal&#x201D;. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 1\nH\nT\n1 2\nT\nHH\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Equal\nHamlet\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nFor the first sample case, to end the game, one flip is enough. If it is head, Hamlet wins. Otherwise Laertes wins. As a result, both of them has 1/2 probability to win.\n\nFor the second sample case, if the first flip is tail, Hamlet wins. Otherwise if the second flip is tail, also Hamlet wins. Otherwise Laertes wins. \nSo the probability that Hamlet wins the game is 3/4, while the probability that Laertes wins is 1/4. Hamlet has a better chance.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Ningbo+Regional+Contest+Hosted+by+NIT+&amp;source=1&amp;searchmode=source\"> 2009 Asia Ningbo Regional Contest Hosted by NIT  </a> ","type":"source","format":"html"}]}