{"title":"Columbus’s bargain","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3268","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3268&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3268","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3268"},"statement":[{"title":"Problem Description","content":"On the evening of 3 August 1492, Christopher Columbus departed from Palos de la Frontera with a few ships, starting a serious of voyages of finding a new route to India. As you know, just in those voyages, Columbus discovered the America continent which he thought was India.<br><br>Because the ships are not large enough and there are seldom harbors in his route, Columbus had to buy food and other necessary things from savages. Gold coins were the most popular currency in the world at that time and savages also accept them. Columbus wanted to buy N kinds of goods from savages, and each kind of goods has a price in gold coins. Columbus brought enough glass beads with him, because he knew that for savages, a glass bead is as valuable as a gold coin. Columbus could buy an item he need only in four ways below:<br><br>1.&#xA0;&#xA0;Pay the price all by gold coins.<br>2.&#xA0;&#xA0;Pay by ONE glass bead and some gold coins. In this way, if an item&#x2019;s price is k gold coins, Columbus could just pay k &#x2013; 1 gold coins and one glass bead.<br>3.&#xA0;&#xA0;Pay by an item which has the same price.<br>4.&#xA0;&#xA0;Pay by a cheaper item and some gold coins. <br><br>Columbus found out an interesting thing in the trade rule of savages:  For some kinds of goods, when the buyer wanted to buy an item by paying a cheaper item and some gold coins, he didn&#x2019;t have to pay the price difference, he can pay less. If one could buy an item of kind A by paying a cheaper item of kind B plus some gold coins less than the price difference between B and A, Columbus called that there was a &#x201C;bargain&#x201D; between kind B and kind A.  To get an item, Columbus didn&#x2019;t have to spend gold coins as many as its price because he could use glass beads or took full advantages of &#x201C;bargains&#x201D;. So Columbus wanted to know, for any kind of goods, at least how many gold coins he had to spend in order to get one &#x2013; Columbus called it &#x201C;actual price&#x201D; of that kind of goods. <br><br>Just for curiosity, Columbus also wanted to know, how many kinds of goods are there whose &#x201C;actual price&#x201D; was equal to the sum of &#x201C;actual price&#x201D; of other two kinds.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases. <br>The first line in the input is an integer T indicating the number of test cases ( 0 &lt; T &lt;= 10).<br>For each test case:<br>The first line contains an integer N, meaning there are N kinds of goods ( 0 &lt; N &lt;= 20). These N kinds are numbered from 1 to N.<br><br>Then N lines follow, each contains two integers Q and P, meaning that the price of the goods of kind Q is P.  ( 0 &lt;Q &lt;=N, 0 &lt; P &lt;= 30 )<br>The next line is a integer M( 0 &lt; M &lt;= 20 ), meaning there are M &#x201C;bargains&#x201D;. <br><br>Then M lines follow, each contains three integers N1, N2 and R, meaning that you can get an item of kind N2 by paying an item of kind N1 plus R gold coins.  It&#x2019;s guaranteed that the goods of kind N1 is cheaper than the goods of kind N2 and R is none negative and less than the price difference between the goods of kind N2 and kind N1.  Please note that R could be zero. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case:<br>Please output N lines at first. Each line contains two integers n and p, meaning that the &#x201C;actual price&#x201D; of the goods of kind n is p gold coins. These N lines should be in the ascending order of kind No. . <br><br>Then output a line containing an integer m, indicating that there are m kinds of goods whose &#x201C;actual price&#x201D; is equal to the sum of &#x201C;actual price&#x201D; of other two kinds.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n4\n1 4\n2 9\n3 5\n4 13\n2\n1 2 3\n3 4 6</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 3\n2 6\n3 4\n4 10\n1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Asia+Ningbo+Regional+Contest+Hosted+by+NIT+&amp;source=1&amp;searchmode=source\"> 2009 Asia Ningbo Regional Contest Hosted by NIT  </a> ","type":"source","format":"html","require":["katex"]}]}