{"title":"Lottery","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3273","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3273&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3273","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3273"},"statement":[{"title":"Problem Description","content":"Your living city is holding a big lottery game now! There are M people in this city who want to play this lottery. Everyone of them must pay C dollars to get a lottery ticket. Taking this ticket, he can get a chance to win a prize by randomly selecting one from N indistinguishable boxes and getting the prize if there is a ball in the selected box. The ball in the selected box is also taken by this winner, so if a box with a ball happens to be selected by a player, it will never contain balls from then on, but it will be closed and can be selected by the future players. Every box contains exactly one ball at the beginning, and two or more players cannot select the boxes and the same time. <br><br>Of course, the latter you join this game, the less the chance you win a prize will be. So the lottery holder make such a rule: If you are the n-th player who wins a prize, you will get A*(n-1)+B dollars. That is to say, the first winner will get B dollars, the second winner will get A+B dollars, the income of the third winner is 2*A+B, and so on. <br><br>Being curious about the expected profit, the lottery holder is too lazy to calculate it himself. So he finds you and give you a lot of money to do this work. If you can solve it quickly, you will be a millionaire!","type":"description","format":"html"},{"title":"Input","content":"The first line of input is a integer T, the number of test cases. Each case contains exactly 5 integers M, N, C, A, B in this order, where 1 &lt;= M, N &lt;= 10^6 and 0 &lt;= C, A, B &lt;= 100.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a line contains a single real number which is the expected profit got. You can output the result with any precision you like, but the relative error should less than or equal to 1e-5.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 2 10 5 7\n2 2 10 5 7\n7 5 0 0 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n7\n-3.95142</div></pre>","type":"example","format":"html"},{"title":"Author","content":"wywcgs","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ+Monthly+Contest+%A8C+2010.01.02&amp;source=1&amp;searchmode=source\"> HDOJ Monthly Contest &#xFFFD;C 2010.01.02 </a> ","type":"source","format":"html"}]}