{"title":"Balls","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3281","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3281&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3281","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3281"},"statement":[{"title":"Problem Description","content":"The classic <i>Two Glass Balls</i> brain-teaser is often posed as:<br><br>&quot;Given two identical glass spheres, you would like to determine the lowest floor in a 100-story building from which they will break when dropped. Assume the spheres are undamaged when dropped below this point. What is the strategy that will minimize the worst-case scenario for number of drops?&quot;<br><br>Suppose that we had only one ball. We&apos;d have to drop from each floor from 1 to 100 in sequence, requiring 100 drops in the worst case.<br><br>Now consider the case where we have two balls. Suppose we drop the first ball from floor n. If it breaks we&apos;re in the case where we have one ball remaining and we need to drop from floors 1 to n-1 in sequence, yielding n drops in the worst case (the first ball is dropped once, the second at most n-1 times). However, if it does not break when dropped from floor n, we have reduced the problem to dropping from floors n+1 to 100. In either case we must keep in mind that we&apos;ve already used one drop. So the minimum number of drops, in the worst case, is the minimum over all n.<br><br>You will write a program to determine the minimum number of drops required, in the worst case, given B balls and an M-story building.","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a single integer <b>P</b>, (1 &#xFFFD;&#xFFFD; <b>P</b> &#xFFFD;&#xFFFD; 1000), which is the number of data sets that follow. Each data set consists of a single line containing three (3) decimal integer values: the problem number, followed by a space, followed by the number of balls <b>B</b>, (1 &#xFFFD;&#xFFFD; <b>B</b> &#xFFFD;&#xFFFD; 50), followed by a space and the number of floors in the building <b>M</b>, (1 &#xFFFD;&#xFFFD; <b>M</b> &#xFFFD;&#xFFFD; 1000).","type":"input_format","format":"html"},{"title":"Output","content":"For each data set, generate one line of output with the following values: The data set number as a decimal integer, a space, and the minimum number of drops needed for the corresponding values of <b>B</b> and <b>M</b>.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n1 2 10\n2 2 100\n3 2 300\n4 25 900</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 4\n2 14\n3 24\n4 10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Greater+New+York+Regional&amp;source=1&amp;searchmode=source\"> 2009 Greater New York Regional </a> ","type":"source","format":"html"}]}