{"title":"Magic tree ","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3289","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3289&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3289","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3289"},"statement":[{"title":"Problem Description","content":"Sailormoon girls have a beautiful garden, though there is only a tree in it. The tree is quite magic that it will grow different fruits to fit gilrs&apos; demands (xq likes bananas best, wj prefers to kiwi fruits and lff loves tomatoes).<br>Besides these, the tree has N forks which are connected by branches, girls mark the forks by 1 to N and the root is always marked by 1. Fruits will grow on the forks and every fork will grow several fruits. But the tree is too strange that it has many branches(even between two nodes may have more than one branch). In order to pick fruits more convenient and watch more clearly, Sailormoon girls want to cut extra branches by using minimum cost, after that, they also want to know how many fruits are there in a sub-tree. The trouble is that the tree will grow new fruits and girls will pick up some ones from the tree. Can you help them?","type":"description","format":"html"},{"title":"Input","content":"Input contains multiple cases. Each case contains several lines.<br>The first line contains two integers N, M(N&lt;=100,000, M&lt;=151,000), representing the number of forks and the number of branches in the tree. <br>The following M lines each has three integers u, v and c, which means fork u and fork v are connected by a branch, if you want to cut it, you have to cost c (arbitrary two c will be different, c&lt;=200,000).<br>The next line contains an integer P, representing the operations following.<br>&quot;G x y&quot; which means the fork x will grow y more fruits ;<br>&quot;C x&quot; which means girls will pick all fruits on the fork x;<br>&quot;Q x&quot; which means girls want to know the number of fruits in the sub-tree above the fork x, including the fruits (if exists) on the fork x.<br>Note the tree is empty at the beginning, every number will not exceed the range of integer.","type":"input_format","format":"html"},{"title":"Output","content":"For every &quot;Q x&quot;, output the answer per line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2\n1 2 4\n1 3 5\n7\nG 1 1\nG 2 1\nG 3 1\nQ 1\nC 2\nQ 2\nQ 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n0\n1</div></pre>","type":"example","format":"html"},{"title":"Author","content":"wangjing1111","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+%A1%B0HDU-Sailormoon%A1%B1+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2010 &#x201C;HDU-Sailormoon&#x201D; Programming Contest </a> ","type":"source","format":"html"}]}