{"title":"Acm Team Section","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3296","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3296&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3296","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3296"},"statement":[{"title":"Problem Description","content":"The ACM-ICPC brings together the top student programmers from all over the world, and provides them with opportunities to develop critical skills which will give them a competitive edge when they launch careers in information technology areas. More than 5,600 teams from 84 countries had competed in regional contests last year. An ever larger number of teams - more than 7,000 teams from different countries worldwide - have registered in this year&apos;s regional contests. However, due to the limited capacity of each site, only a small amount of the registered teams can be allowed to participate in the on-site contest. It is really hard for the contest organizers to determine which teams should be allowed to participate. One of the possible solutions is to hold a preliminary internet contest before the on-site competition. The following part describes a simplified version of rules for team selection:<br><br>Up to three teams from each school can participate in the on-site contest, depending on how many following conditions the school in question meets:<br><br>a)<br>    A team from this school has solved at least M problems in the preliminary contest; <br>b)<br>    Some of the teams from this school ranked top 20 in previous World Finals; <br>c)<br>    This school has hosted a provincial contest this year. <br><br>Your task is to write a program to help the contest holders to calculate how many teams are allowed to participate in the on-site final contest. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases in the input file. Each test case starts with three integers S , T  and M  (1&lt;=S&lt;=100, 1&lt;=T&lt;=2000, 0&lt;=M&lt;=10) , representing the number of schools, the number of teams participating in the preliminary contest, and the minimum number of problems which is required to be solved in order to enter the on-site competition, respectively.<br><br>Each of the following S lines consists of three integers Id , P and Q , (1&lt;=Id&lt;=S, 0&lt;=P, Q&lt;=1) , representing the Id of the school, whether this school satisfies condition b), and whether this school satisfies condition c).<br><br>The last part of each test case consists of T lines. There are two integers on each of the T lines, Sid and Tot (1&lt;=Sid&lt;=S, 0&lt;=Tot&lt;=10) , meaning that a team from school Sid had solved Tot problems in the preliminary contest.<br><br>Two consecutive test cases are separated by a blank line. S = 0, T = 0, M = 0 indicates the end of input and should not be processed by your program. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the total number of teams which are allowed to participate in the on-site competition on a separate line in the format as indicated in the sample output. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 8 6 \n5 0 1 \n4 0 0 \n1 0 0 \n3 1 1 \n2 1 1\n2 6 \n3 3 \n2 9 \n5 7 \n4 8 \n3 6 \n2 8 \n1 6 \n\n5 8 6 \n3 0 1 \n5 1 1 \n2 0 1 \n1 1 1 \n4 1 0\n5 7 \n2 5 \n4 5 \n5 5 \n3 3 \n5 6 \n2 0 \n4 7 \n\n0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 10\nCase 2: 9</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Shanghai+&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Shanghai  </a> ","type":"source","format":"html","require":["katex"]}]}