{"title":"Contestants","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3298","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3298&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3298","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3298"},"statement":[{"title":"Problem Description","content":" <br><br>In the new ACM-ICPC Regional Contest, a special monitoring and submitting system will be set up, and students will be able to compete at their own universities. However there&apos;s one problem. Due to the high cost of the new judging system, the organizing committee can only afford to set the system up such that there will be only one way to transfer information from one university to another without passing the same university twice. The contestants will be divided into two connected regions, and the difference between the total numbers of students from two regions should be minimized. Can you help the juries to find the minimum difference? ","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases in the input file. Each test case starts with two integers N  and M , (1&lt;=N&lt;=100000, 1&lt;=M&lt;=1000000) , the number of universities and the number of direct communication line set up by the committee, respectively. Universities are numbered from 1 to N . The next line has N  integers; the Kth  integer is equal to the number of students in university numbered K. The number of students in any university does not exceed 100000000. Each of the following M  lines has two integers s , t , and describes a communication line connecting university s  and university t . All communication lines of this new system are bidirectional.<br><br>N = 0, M = 0 indicates the end of input and should not be processed by your program. ","type":"input_format","format":"html"},{"title":"Output","content":"For every test case, output one integer, the minimum absolute difference of students between two regions in the format as indicated in the sample output. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 6 \n1 1 1 1 1 1 1 \n1 2 \n2 7 \n3 7 \n4 6 \n6 2 \n5 7 \n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Shanghai+&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Shanghai  </a> ","type":"source","format":"html"}]}