{"title":"False Perceptions","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3301","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3301&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3301","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3301"},"statement":[{"title":"Problem Description","content":"    ``There is no denying the clues. They are clearly there; you can&apos;t miss them. But are we interpreting the clues correctly? That is where the author tricks us. There are most definitely more than one way to look at a clue and what it signifies, but the way the author has laid them out, (like a breadcrumb trail) we are inclined to believe they lead us to the end conclusion . . .&quot; <br><br><br>You have been reading Harry Potter series for some time. Since the final book will not be out in the store until 2007, and you are curious about what could happen in the final book of the series, you have decided to do some guessing by yourself. After rereading the series for some days, you have divided every piece of information you currently have into three categories:<br><br>A.<br>    Extracts. Extracts are taken from the previous published books in the series, and you don&apos;t need to check for their validities; <br>B.<br>    Assumptions. Assumptions are based on different interpretations of other assumptions / extracts from the books. An assumption is plausible if and only if some of the assumptions (or extracts from the book) this assumption relies on are interpreted in ways that support this assumption. No assumption requires itself to be plausible, whether directly or indirectly. <br>C.<br>    Theories. Theories are based on extracts and assumptions. If all the extracts and assumptions one theory depends on are believable and interpreted to support this theory, then we say this theory can be argued as believable. <br><br>Note that extracts and assumptions may have many different exclusive explanations leading to other theories and/or assumptions.<br><br>Because of personal preferences, you want to see some scenes in the next book come true much more than the others, thus you have assigned different values to different theories, each being an exponent of 2, less or equal to 2(number of theories-1) . You want to know what the maximal possible value of theories that can be argued as believable at the same time is; furthermore, since the less guesswork you do, the more reliable your theories are, you are interested in the minimum number of explanations you must make to make all those theories acceptable. Can you accomplish this seemingly impossible task? ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of several cases, each followed by a blank line.<br><br>Each test case starts with three integers N , M and K (1&lt;=N&lt;=1000, 1&lt;=M&lt;=5000, 1&lt;=K&lt;=100) , the number of extracts from the book, the number of assumptions and the number of theories, respectively.<br><br>The following part describes extracts and assumptions. Extracts are always described before assumptions. Each description starts with one string S , the name of the extract / assumption, and an integer T in the next line, the number of different explanations you have come up with; T lines follow, on each line there is a string X , the explanation which leads to another assumption / theory.<br><br>The next part of test case consists of K descriptions of theories. Each description starts with one string S , the name of the theory, followed by one integer P , the value which you have assigned to this theory.<br><br>Two successive descriptions are separated by a line with one single character `-&apos;. It is guaranteed that the total numbers of explanations which extracts and assumptions have does not exceed 50000, and you may assume every string&apos;s length is less or equal to 20, and only consists of letters from alphabet and numbers 0...9 .<br><br>N = 0 , M = 0 , K = 0 indicates the end of input file and should not be processed by your program. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case, output the maximum value followed by the minimum number of explanations you have to make in the format as indicated in the sample output. Print all the plausible theories (with the maximum total value) on the following lines. Separate the result of two successive inputs with one blank line.<br><br><br>Explanation for Sample Input / Output<br><br><br>In order to make Theory1 believable, Extract1, Extract2, Assumption1, and Assumption3&apos;s explanations must be Assumption1, Assumption3, Theory1 and Theory1, respectively. Thus the total number of explanations we must make is 4. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3 1 \nExtract1 \n2 \nAssumption1 \nAssumption2 \n-\nExtract2 \n2 \nAssumption2 \nAssumption3 \n-\nAssumption1 \n2 \nAssumption2 \nTheory1 \n-\nAssumption2 \n0 \n-\nAssumption3 \n1 \nTheory1 \n-\nTheory1 \n1 \n\n0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: \n1 \n4 \nTheory1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Shanghai+&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Shanghai  </a> ","type":"source","format":"html","require":["katex"]}]}