{"title":"Harmony Forever","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3303","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3303&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3303","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3303"},"statement":[{"title":"Problem Description","content":"We believe that every inhabitant of this universe eventually will find a way to live together in harmony and peace; that trust, patience, kindness and loyalty will exist between every living being of this earth; people will find a way to appreciate and cooperate with each other instead of continuous bickering, arguing and fighting. Harmony -- the stage of society so many people dream of and yet it seems so far away from now ...<br><br>Fortunately, the method of unlocking the key to true Harmony is just discovered by a group of philosophers. It is recorded on a strange meteorite which has just hit the earth. You need to decipher the true meaning behind those seemingly random symbols ... More precisely, you are to write a program which will support the following two kinds of operation on an initially empty set S :<br><br>1.<br>    B X : Add number X to set S . The Kth command in the form of B X always happens at time K , and number X does not belong to set S before this operation. <br>2.<br>    A Y : Of all the numbers in set S currently, find the one which has the minimum remainder when divided by Y . In case a tie occurs, you should choose the one which appeared latest in the input. Report the time when this element is inserted. <br><br>It is said that if the answer can be given in the minimum possible time, true Harmony can be achieved by human races. You task is to write a program to help us. ","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases in the input file. Each test case starts with one integer T  where 1&lt;=T&lt;=40000 . The following T  lines each describe an operation, either in the form of ``B X &quot; or ``A Y &quot; where 1&lt;=X , Y&lt;=500000 .<br><br>T = 0 indicates the end of input file and should not be processed by your program. ","type":"input_format","format":"html"},{"title":"Output","content":"Print the result of each test case in the format as indicated in the sample output. For every line in the form of ``A Y &quot;, you should output one number, the requested number, on a new line; output -1 if no such number can be found. Separate the results of two successive inputs with one single blank line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 \nB 1 \nA 5 \nB 10 \nA 5 \nA 40 \n2 \nB 1 \nA 2\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: \n1 \n2 \n1 \n\nCase 2: \n1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2006+Asia+Regional+Shanghai+&amp;source=1&amp;searchmode=source\"> 2006 Asia Regional Shanghai  </a> ","type":"source","format":"html"}]}