{"title":"Trouble with Election!","time_limit":2000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3314","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3314&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3314","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3314"},"statement":[{"title":"Problem Description","content":"Taman and his friends are going to arrange an election for their club. The rule of this election is simple. Every member of the club can cast a single vote for one person. Even one can vote for himself too. If A casts his vote for B and B casts his vote for C then it means that C gets both the votes of A and B. It means if a man casts his vote for someone then the votes he got will also be added to the person he votes for. Now there is a problem if A&#x2019;s vote goes for B and B&#x2019;s vote for A. In this case, both of them have the same number of votes and it is a tie! So a tiebreaker will be needed. In this situation, all the votes of A and B and their <b>supporters</b> will be cancelled. If one&#x2019;s vote goes for another then one is considered as the supporter of another.<br>Now you are elected as the election commissioner for the election of the club. It is your duty to publish the result of the election. If you find no possible winner or if two or more members have same number of votes then you should declare the situation as &#x201C;Trouble&#x201D;, print the name of the winner otherwise. Instead of name, a unique number for each member identifies the members of this club and the number should always be non-negative and less than the total number of members of the club.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be multiple test cases. Every test case starts with a single integer N on a line. 0&lt;N&lt;= 100000. N denotes the number of members of the club. N lines following. Each I&#x2019;th line will be consisting of a single integer J; denoting I&#x2019;th member casts his vote for J&#x2019;th member. 0&lt;=I, J&lt;N.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The output for every case consists of a single integer, which denotes that the M&#x2019;th member is the winner or a single word, &#x201C;Trouble&#x201D;, if a unique winner can not be determined. Here quotes are for clarity.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1\n2\n2\n4\n1\n2\n0\n3\n2\n1\n0\n5\n1\n2\n0\n2\n3\n10\n7\n6\n1\n8\n9\n2\n7\n9\n5\n4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\nTrouble\nTrouble\nTrouble</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Muhammed Hedayetul Islam","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ+Monthly+Contest+%A8C+2010.02.06+&amp;source=1&amp;searchmode=source\"> HDOJ Monthly Contest &#x2013; 2010.02.06  </a> ","type":"source","format":"html","require":["katex"]}]}