{"title":"My Brute","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3315","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3315&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3315","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3315"},"statement":[{"title":"Problem Description","content":"Seaco is a beautiful girl and likes play a game called &#x201C;My Brute&#x201D;. Before Valentine&#x2019;s Day, starvae and xingxing ask seaco if she wants to spend the Valentine&#x2019;s Day with them, but seaco only can spend it with one of them. It&#x2019;s hard to choose from the two excellent boys. So there will be a competition between starvae and xingxing. The competition is like the game &#x201C;My Brute&#x201D;.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C252-1001-1.jpg\"></center><br>Now starvae have n brutes named from S1 to Sn and xingxing&#x2019;s brutes are named from X1 to Xn. A competition consists of n games. At the beginning, starvae&apos;s brute Si must versus xingxing&#x2019;s brute Xi. But it&#x2019;s hard for starvae to win the competition, so starvae can change his brutes&#x2019; order to win more games. For the starvae&#x2019;s brute Si, if it wins the game, starvae can get Vi scores, but if it loses the game, starvae will lose Vi scores. Before the competition, starvae&#x2019;s score is 0. Each brute can only play one game. After n games, if starvae&#x2019;s score is larger than 0, we say starvae win the competition, otherwise starvae lose it. <br><br>It&#x2019;s your time to help starvae change the brutes&#x2019; order to make starvae&#x2019;s final score be the largest. If there are multiple orders, you should choose the one whose order changes the least from the original one. The original order is S1, S2, S3 &#x2026; Sn-1, Sn, while the final order is up to you.<br><br>For starvae&#x2019;s brute Si (maybe this brute is not the original brute Si, it is the ith brute after you ordered them) and xingxing&#x2019;s brute Xi, at first Si has Hi HP and Xi has Pi HP, Si&#x2019;s damage is Ai and Xi&#x2019;s is Bi, in other words, if Si attacks, Xi will lose Ai HP and if Xi attacks, Si will lose Bi HP, Si attacks first, then it&#x2019;s Xi&#x2019;s turn, then Si&#x2026; until one of them&#x2019;s HP is less than 0 or equal to 0, that, it lose the game, and the other win the game.<br><br>Come on, starvae&#x2019;s happiness is in your hand!","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"First line is a number n. (1&lt;=n&lt;=90) Then follows a line with n numbers mean V1 to Vn. (0&lt;Vi&lt;1000) Then follows a line with n numbers mean H1 to Hn. (1&lt;=Hi&lt;=100)Then follows a line with n numbers mean P1 to Pn. (1&lt;=Pi&lt;=100) Then follows a line with n numbers mean A1 to An.(1&lt;=Ai&lt;=50) Then follows a line with n numbers mean B1 to Bn. (1&lt;=Bi&lt;=50) A zero signals the end of input and this test case is not to be processed.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, if starvae can win the competition, print the largest score starvae can get, and then follow a real percentage means the similarity between the original order and the final order you had changed, round it to three digits after the decimal point. If starvae can&#x2019;t win the competition after changing the order, please just print &#x201C;Oh, I lose my dear seaco!&#x201D; Maybe the sample can help you get it.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n4 5 6\n6 8 10\n12 14 16\n7 7 6\n7 3 5\n3\n4 5 6\n6 8 10\n12 14 16\n5 5 5\n5 5 5\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 33.333%\nOh, I lose my dear seaco!</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"starvae","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+%A1%B0Valentines+Day%A1%B1+Open+Programming+Contest+2010-02-14+&amp;source=1&amp;searchmode=source\"> HDU &#x201C;Valentines Day&#x201D; Open Programming Contest 2010-02-14  </a> ","type":"source","format":"html","require":["katex"]}]}