{"title":"The Flowers Floating On The YueYa Lake","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3322","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3322&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3322","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3322"},"statement":[{"title":"Problem Description","content":"We all know the YueYa Lake of HDU. It is very beautiful, especially in the evening. However, most of HDU&apos;s ACMers may not know,because they only know where the apartments and the laboratory are and they often get lost when they go to other places even Canteen. <br><br>CR was very excited when he knew Spring Festival is Valentine&apos;s Day this year. Finally, that day is coming. He pulled out the map of HDU and then walked towards the direction of the YueYa Lake.He knew that today there would be a lot of beautiful MMs. Soon, he arrived and he was so lucky that he met a beautiful girl. The girl told him that she would like to have all the flowers floating on the water of YueYa Lake. She also told him if he fulfilled her this wish she was willing to be his girlfriend! How exciting!<br><br>Simply&#xFF0C;we can see each of flowers as a point (Pi(xi, yi), 0&lt;xi,yi, i&#x2260;j,xi&#x2260;xj) in the plane and CR stand at coordinate origin.CR must get all the flowers floating in the water and then go back to coordinate origin.Although our CR knew a little Kungfu of QingKung, it&#x2019;s also a hard work, because it&#x2019;s would cost CR |PiPj| calories of energy when he flew from Pi to Pj. Our small CR want to make it a wonderful thing that he spent the least energy. But there is a rule:<br><br>Before you reach the rightmost point , you can only visit the points those have the bigger x-coordinate value. For example, you are at Pi now, then you can visit Pj only when xj&gt;xi. But when you reach the rightmost point, the rule has changed, you can only visit the points those have the smaller x-coordinate value than the point you are at now.For example, you are at Pi now, then you can visit Pj only when xj&lt;xi.<br><br>Of course CR knew the answer, but what about you, clever ACMers?","type":"description","format":"html"},{"title":"Input","content":"Input consists of multiple test cases. Each case begins with a line containing a positive integer n(0 &lt; n &lt;= 500), means the number of points. Then following n lines each containing two positive integers Pi(xi, yi), indicating the coordinate of the i-th point in the plane.<br>A test case with n = 0 terminates the input and this test case is not to be processed.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, your should output the least energy to finished the girl&#x2019;s wish with the rule mentioned above. The answer should accurate up to 2 decimal places.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 1\n2 3\n3 1\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9.05\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div> The path (0,0) - (3,1) - (2,3) - (1,1) - (0,0) makes the least energy.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Author","content":"&#x897F;&#x98CE;&#x8427;&#x745F;","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDU+%A1%B0Valentines+Day%A1%B1+Open+Programming+Contest+2010-02-14+&amp;source=1&amp;searchmode=source\"> HDU &#x201C;Valentines Day&#x201D; Open Programming Contest 2010-02-14  </a> ","type":"source","format":"html"}]}