{"title":"Decompressing in a GIF","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3327","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3327&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3327","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3327"},"statement":[{"title":"Problem Description","content":"One well known method to compress image files is the Graphics Interchange Format (GIF) encoding, created by CompuServe in 1987. Here&#xFFFD;&#xFFFD;s a simplified version applied to strings of alphabetic characters. Essential for this compression is a dictionary which assigns numeric encodings (we&#xFFFD;&#xFFFD;ll use base 10 numbers for this problem) to different strings of characters. The dictionary is initialized with mappings for characters or substrings which may appear in the string. For example, if we expect to encounter all 26 letters of the alphabet, the dictionary will initially store the encodings (<i>A</i>, 00), (<i>B</i>, 01), (<i>C</i>, 02), . . . , (<i>Z</i>, 25). If we are compressing DNA data, the dictionary will initially store only 4 entries: (<i>A</i>, 0), (<i>T</i>, 1), (<i>G</i>, 2) and (<i>C</i>, 3). Note that the length of each initial encoding is the same for all entries (2 digits in the first example, and 1 digit in the second).<br><br>The compression algorithm proceeds as follows:<br><br>1. Find the longest prefix of the uncompressed portion of the string which is in the dictionary, and replace it with its numeric encoding.<br><br>2. If the end of the string has not been reached, add a new mapping (<i>s, n</i>) to the dictionary, where <i>s</i> = the prefix just compressed plus the next character after it in the string, and <i>n</i> = the smallest number not yet used in the dictionary.<br><br>For example, assume we started with the string ABABBAABB and a dictionary with just two entries, (<i>A</i>, 0) and (<i>B</i>, 1). The table below shows the steps in compressing the string.<br><br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C272-1003-1.JPG\"></center><br>The final compressed string is 01234.<br><br>There is only one other rule: the replacement strings used are always the size of the longest encoding in the dictionary at the time the replacement occurs. Thus, with the dictionary above, if the string to compress is long enough that an entry of the form (<i>s</i>, 10) is added to the dictionary, then from this point on all numerical replacement strings used in the compressed string must be expanded to 2 digits long (i.e., A will now be encoded as 00, B as 01, AB as 02, etc.); if an entry (<i>s&#xFFFD;&#xFFFD;</i>, 100) is added to the dictionary, all replacements from this point forward will increase to 3 digits long, and so on. Thus, the longer string ABABBAABBAABAABAB will be encoded as 01234027301, not 0123402731. Try it!<br><br>OK, now that you are experts at compressing, it&#xFFFD;&#xFFFD;s time to relax and decompress!","type":"description","format":"html"},{"title":"Input","content":"Each test case will consist of two lines. The first line will contain a string of digits to decompress. The second line will contain the initial dictionary used in the compression. This line will start with a positive integer <i>n</i> indicating the number of entries in the dictionary (1 &#xFFFD;&#xFFFD; <i>n</i> &#xFFFD;&#xFFFD; 100), followed by <i>n</i> alphabetic strings. The first of these will be paired with 0 in the dictionary (or 00 if <i>n</i> &gt; 10), the second with 1, and so on. The last test case will be followed by a line containing a single 0.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line containing the case number (using the format shown below) followed by the decompressed string. All input strings will have been legally compressed.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">01234\n2 A B\n01234027301\n2 A B\n02151120182729\n26 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z\n21104\n3 BA A C\n01\n2 JA VA\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: ABABBAABB\nCase 2: ABABBAABBAABAABAB\nCase 3: CPLUSPLUS\nCase 4: CAABAAA\nCase 5: JAVA</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=East+Central+North+America+2009&amp;source=1&amp;searchmode=source\"> East Central North America 2009 </a> ","type":"source","format":"html"}]}