{"title":"Trip the Lights Fantastic","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3331","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3331&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3331","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3331"},"statement":[{"title":"Problem Description","content":"Bob Roberts (father of Little Bobby of problem D) works at the Traffic Commission for a medium size town. Bob is in charge of monitoring the traffic lights in the city and dispatching repair crews when necessary. Needless to say, Bob has a lot of free time, so to while away the hours he tries to figure out the quickest way to take short trips between various points in the city. Bob has at his disposal a lot of information: the layout of streets in the city and the location and cycle times for all of the traffic lights. To simplify the solution process, he makes the following assumptions:<br><br>1. All cars travel at the same top speed, and, if sitting at a red light, take 5 seconds to react and get up to speed. (That is, Bob assumes the car is essentially standing still for 5 seconds, then proceeds at top speed. Bob also assumes the light will not have turned back to red in the 5 seconds it takes to get going.)<br><br>2. Each car approaches a light at full speed and either passes through the light if it is green or yellow, or comes to an immediate stop if it is red. Cars are allowed to pass through a light if they hit it just as it is turning to green. Cars must stop if they reach the light just as it is turning to red.<br><br>3. The time to make turns through a light is ignored. It is possible to travel between any two lights, although perhaps not directly.<br><br>Furthermore, no u-turns are allowed nor will routes revisit an intersection. Even given these assumptions, Bob has difficulty coming up with minimum time paths. Let&#x2019;s see if you can help him.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of each test case will contain four positive integers <i>n</i>, <i>m</i>, <i>s</i>, and <i>e</i>, where <i>n</i> (2 &#x2264; <i>n</i> &#x2264; 100) is the number of traffic lights (numbered 0 through <i>n</i> - 1), <i>m</i> is the number of roads between the traffic lights, and <i>s</i> and <i>e</i> (<i>s</i> &#x2260; <i>e</i>) are the starting and ending lights for the desired trip. There will then follow <i>n</i> lines of the form <i>g y r</i> indicating the number of seconds that each light is green, then yellow, then red. (1 &#x2264; <i>g, y, r</i> &#x2264; 100.) The first of these lines refers to light 0, the second to light 1, and so on. Following these <i>n</i> lines will be <i>m</i> lines, each describing one road. These lines will have the form <i>l1 l2 t</i>, where <i>l1</i> and <i>l2</i> are the two lights being connected by the road and <i>t</i> is the time (in seconds, <i>t</i> &#x2264; 500) to travel the length of the road at full speed &#x2014; you should add 5 to this value to obtain the travel time when driving the road beginning at a standstill. All roads are two way. At time 0, all lights are just starting their green period and your car is considered to be at a standstill at traffic light <i>s</i>. Since it takes 5 seconds to get going, you may assume that <i>g</i> + <i>y</i> is never less than or equal to 5. The last test case is followed by a line containing 0 0 0 0 indicating end-of-input.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a single line containing the minimum time to travel from the start light to the end light. Output your results in the form mm:ss indicating the number of minutes and seconds the trip takes. If the number of seconds is less than 10 then preface it with a 0 (i.e., output 4:05, not 4:5). Likewise, if the number of minutes is less than 10, print just one digit (as in 4:05).","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3 0 2\n3 4 5\n3 3 3\n2 4 4\n0 1 1\n1 2 2\n0 2 12\n3 3 0 2\n3 4 5\n3 4 3\n2 4 4\n0 1 1\n1 2 2\n0 2 12\n0 0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0:16\n0:08</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=East+Central+North+America+2009&amp;source=1&amp;searchmode=source\"> East Central North America 2009 </a> ","type":"source","format":"html","require":["katex"]}]}