{"title":"Windows","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3332","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3332&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3332","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3332"},"statement":[{"title":"Problem Description","content":"Emma is not very tidy with the desktop of her computer. She has the habit of opening windows on the screen and then not closing the application that created them. The result, of course, is a very cluttered desktop with some windows just peeking out from behind others and some completely hidden. Given that Emma doesn&#x2019;t log off for days, this is a formidable mess. Your job is to determine which window (if any) gets selected when Emma clicks on a certain position of the screen.<br><br>Emma&#x2019;s screen has a resolution of 10<sup>6</sup> by 10<sup>6</sup>. When each window opens its position is given by the upper-left-hand corner, its width, and its height. (Assume position (0,0) is the location of the pixel in the upper-left-hand corner of her desktop. So, the lower-right-hand pixel has location (999999, 999999).)","type":"description","format":"html"},{"title":"Input","content":"Input for each test case is a sequence of desktop descriptions. Each description consists of a line containing a positive integer <i>n</i>, the number of windows, followed by <i>n</i> lines, <i>n</i> &#x2264; 100, describing windows in the order in which Emma opened them, followed by a line containing a positive integer <i>m</i>, the number of queries, followed by <i>m</i> lines, each describing a query. Each of the <i>n</i> window description lines contains four integers <i>r, c, w,</i> and <i>h</i>, where (<i>r, c</i>) is the row and column of the upper left pixel of the window, 0 &#x2264; <i>r, c</i> &#x2264; 999999, and <i>w</i> and <i>h</i> are the width and height of the window, in pixels, 1 &#x2264; <i>w, h</i>. All windows will lie entirely on the desktop (i.e., no cropping). Each of the <i>m</i> query description lines contains two integers <i>cr</i> and <i>cc</i>, the row and column number of the location (which will be on the desktop). The last test case is followed by a line containing 0.","type":"input_format","format":"html"},{"title":"Output","content":"Using the format shown in the sample, for each test case, print the desktop number, beginning with 1, followed by <i>m</i> lines, one per query. The <i>i</i>-th line should say either &#x201C;window <i>k</i>&#x201D;, where <i>k</i> is the number of the window clicked on, or &#x201C;background&#x201D; if the query hit none of the windows. We assume that windows are numbered consecutively in the order in which Emma opened them, beginning with 1. Note that querying a window does not bring that window to the foreground on the screen.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 2 3 3\n2 3 2 2\n3 4 2 2\n4\n3 5\n1 2\n4 2\n3 3\n2\n5 10 2 10\n100 100 100 100\n2\n5 13\n100 101\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Desktop 1:\nwindow 3\nwindow 1\nbackground\nwindow 2\nDesktop 2:\nbackground\nwindow 2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=East+Central+North+America+2009&amp;source=1&amp;searchmode=source\"> East Central North America 2009 </a> ","type":"source","format":"html"}]}