{"title":"Hop — Don’t Walk!","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3355","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3355&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3355","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3355"},"statement":[{"title":"Problem Description","content":"KERMIT THE FROG is a classic video game with a simple control and objective but requires a good deal of thinking.<br>You control an animated frog that can walk and hop, in both forward and backward directions. The frog stands in a space between an otherwise a contiguous line of tiles. Each tile is painted black on one side, and white on the other. The frog can walk (forward, or backward) over an adjacent tile (in front or behind him.)<br>When the frog walks over a tile, the tile slides to the space where the frog was standing. For example, in the adjacent figure, the frog has two tiles behind him, and three in front. We&#x2019;ll use the notation BWFBBW to refer to this situation where F refers to the space (where the frog is standing,) B is a tile with its black face showing, while W is a tile with its white face showing. The forward direction is from left to right. If the frog were to walk forward, the resulting situation is BWBFBW. Similar behavior when the frog walks backward, the tile behind the frog slides to where the frog was standing. The frog can also hop over the tiles. The frog can hop over an adjacent tile landing on the tile next to it. For example, if the frog was to hop backward, it would land on the first (left-most) tile, and the tile would jump to the space where the frog was standing. In addition, the tile would flip sides. For example, hopping backward in the figure would result in the situation: FWWBBW. We challenge you to write a program to determine the minimum number of moves (walks or hops) to transform one tile configuration into another.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C277-1005-1.jpg\"></center> ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Your program will be tested on one or more test cases. Each test case is specified on a single line that specifies string S representing the initial tile arrangement. S is a non-empty string and no longer than 100 characters and is made of the letters &#x2019;B&#x2019;, &#x2019;W&#x2019;, and exactly one &#x2019;F&#x2019;. The last line of the input file has one or more &#x2019;-&#x2019; (minus) characters.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the following line:<br>k. M<br>Where k is the test case number (starting at one,) and M is the minimum number of moves needed to transform the given arrangement to an arrangement that has no white tile(s) between any of its black tiles . The frog can be anywhere. M is -1 if the problem cannot be solved in less than 10 moves.<br>Note: There is a blank space before M.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">WWBBFBW\nWWFBWBW\nFWBBWBW\n---</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1. 0\n2. 1\n3. 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+ANARC&amp;source=1&amp;searchmode=source\"> 2009 ANARC </a> ","type":"source","format":"html","require":["katex"]}]}