{"title":"Stock Chase","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3357","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3357&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3357","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3357"},"statement":[{"title":"Problem Description","content":"I have to admit, the solution I proposed last year for solving the bank cash crisis didn&#x2019;t solve the whole economic crisis. As it turns out, companies don&#x2019;t have that much cash in the first place.<br>They have assets which are primarily shares in other companies. It is common, and acceptable, for one company to own shares in another. What complicates the issue is for two companies to own shares in each other at the same time. If you think of it for a moment, this means that each company now (indirectly) controls its own shares.<br>New market regulation is being implemented: No company can control shares in itself, whether directly or indirectly. The Stock Market Authority is looking for a computerized solution that will help it detect any buying activity that will result in a company controlling its own shares. It is obvious why they need a program to do so, just imagine the situation where company A buying shares in B, B buying in C, and then C buying in A. While the first two purchases are acceptable.<br>The third purchase should be rejected since it will lead to the three companies controlling shares in themselves. The program will be given all purchasing transactions in chronological order. The program should reject any transaction that could lead to one company controlling its own shares.<br>All other transactions are accepted.<br>","type":"description","format":"html"},{"title":"Input","content":"Your program will be tested on one or more test cases. Each test case is specified on T + 1 lines. The first line specifies two positive numbers: (0 &lt; N &lt;= 234) is the number of companies and (0 &lt; T &lt;= 100, 000) is the number of transactions. T lines follow, each describing a buying transaction. Each transaction is specified using two numbers A and B where (0 &lt; A,B &lt;= N) indicating that company A wants to buy shares in company B.<br>The last line of the input file has two zeros.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the following line:<br>k. R<br>Where k is the test case number (starting at one,) R is the number of transactions that should be rejected.<br>Note: There is a blank space before R.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 6\n1 2\n1 3\n3 1\n2 1\n1 2\n2 3\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1. 2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+ANARC&amp;source=1&amp;searchmode=source\"> 2009 ANARC </a> ","type":"source","format":"html"}]}