{"title":"Kind of a Blur","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3359","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3359&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3359","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3359"},"statement":[{"title":"Problem Description","content":"Image blurring occurs when the object being captured is out of the camera&apos;s focus. The top two figures on the right are an example of an image and its blurred version. Restoring the original image given only the blurred version is one of the most interesting topics in image processing. This process is called deblurring, which will be your task for this problem.<br>In this problem, all images are in grey-scale (no colours). Images are represented as a 2 dimensional matrix of real numbers, where each cell corresponds to the brightness of the corresponding pixel. Although not mathematically accurate, one way to describe a blurred image is through averaging all the pixels that are within (less than or equal to) a certain Manhattan distance?from each pixel (including the pixel itself ). Here&apos;s an example of how to calculate the blurring of a 3x3 image with a blurring distance of 1:<br><img style=\"max-width:100%;\" src=\"../../data/images/C277-1009-1.jpg\"><br><br>Given the blurred version of an image, we are interested in reconstructing the original version assuming that the image was blurred as explained above.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C277-1009-2.jpg\"><img style=\"max-width:100%;\" src=\"../../data/images/C277-1009-3.jpg\"><img style=\"max-width:100%;\" src=\"../../data/images/C277-1009-4.jpg\"></center> <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input consists of several test cases. Each case is specified on H + 1 lines. The first line specifies three non negative integers specifying the width W, the height H of the blurred image and the blurring distance D respectively where (1&lt;= W,H &lt;= 10) and (D &lt;= min(W/2,H/2)). The remaining H lines specify the gray-level of each pixel in the blurred image. Each line specifies W non-negative real numbers given up to the 2nd decimal place. The value of all the given real numbers will be less than 100.<br>Zero or more lines (made entirely of white spaces) may appear between cases. The last line of the input file consists of three zeros.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print a W * H matrix of real numbers specifying the deblurred version of the image. Each element in the matrix should be approximated to 2 decimal places and right justified in a field of width 8. Separate the output of each two consecutive test cases by an empty line. Do not print an empty line after the last test case. It is guaranteed that there is exactly one unique solution for every test case.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2 1\n1 1\n1 1\n\n3 3 1\n19 14 20\n12 15 18\n13 14 16\n\n4 4 2\n14 15 14 15\n14 15 14 15\n14 15 14 15\n14 15 14 15\n\n0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">    1.00    1.00\n    1.00    1.00\n\n    2.00   30.00   17.00\n   25.00    7.00   13.00\n   14.00    0.00   35.00\n\n    1.00   27.00    2.00   28.00\n   21.00   12.00   17.00    8.00\n   21.00   12.00   17.00    8.00\n    1.00   27.00    2.00   28.00\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nThe Manhattan Distance (sometimes called the Taxicab distance) between\ntwo points is the sum of the (absolute) difference of their coordinates. \nThe grid on the lower right illustrates the Manhattan distances from the grayed cell.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+ANARC&amp;source=1&amp;searchmode=source\"> 2009 ANARC </a> ","type":"source","format":"html","require":["katex"]}]}