{"title":"World Islands","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3405","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3405&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3405","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3405"},"statement":[{"title":"Problem Description","content":"Dubai is a haven for the rich. The government of Dubai finds a good way to make money. They built a lot of artificial islands on the sea and sell them. These islands are shaped into the continents of the world, so they are called &#x201C;world islands&#x201D;. All islands are booked out now. The billionaires who buy these islands wants to make friends with each other, so they want these islands all be connected by bridges. Bill Gates also has booked an island, but he is the only one who doesn&#x2019;t want his island to be connected with other islands, because he prefer to travel on the sea on his old landing craft which is used in the Invasion of Normandy in World War II. Fortunately, Bill doesn&#x2019;t care about which island is saved for him, so Dubai government can still find the best way to build the bridges.  The best way means that the total length of the bridges is minimum. In a word, if there are n islands, what they should do is to build n&#x2013;2 bridges connecting n-1 islands, and give the rest island to Bill Gates. They can give any island to Bill Gates. Now they pay you good money to help them to find out the best way to build the bridges. <br>Please note;<br>1.An island can be considered as a point.<br>2.A bridge can be considered as a line segment connecting two islands.<br>3.A bridge connects with other bridges only at the islands.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line is an integer indicating the number of test cases.<br>For each test case, the first line is an integer n representing the number of islands.(0&lt;n&lt;50)<br>Then n lines follow. Each line contains two integers x and y( -20 &lt;= x, y &lt;= 20 ) , indicating the coordinate of an island. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output the minimum total length of the bridges in a line. The results should be rounded to 2 digits after decimal point, and you must keep 2 digits after the decimal point. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5\n0 0\n1 0\n18 0\n0 1\n1 1\n3\n0 0\n1 0\n0 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3.00\n1.00</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+National+Programming+Invitational+Contest+Host+by+ZSTU+&amp;source=1&amp;searchmode=source\"> 2010 National Programming Invitational Contest Host by ZSTU  </a> ","type":"source","format":"html","require":["katex"]}]}