{"title":"Baseball of Planet Pandora","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3406","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3406&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3406","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3406"},"statement":[{"title":"Problem Description","content":"The baseball game of planet Pandora is similar to the game of the Earth. In the game field, there are four bases which are named &#xFFFD;&#xFFFD;home base&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;first base&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;second base&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;third base&#xFFFD;&#xFFFD;. At the beginning, nobody is on the bases. There are two teams, one is the attacking team, and the other is the defending team.<br><br>One by one, all players of the attacking team goes to the home base and bats the ball thrown by the defending team. <br><br>There are four possible results of a bat: <br>1. &#xFFFD;&#xFFFD;Out&#xFFFD;&#xFFFD;. In this case, the batter misses the ball, so he is disqualified and leaves the game. <br> <br>2.&#xFFFD;&#xFFFD;Bingle&#xFFFD;&#xFFFD;. In this case, the batter hits the ball, but the ball doesn&#xFFFD;&#xFFFD;t fly out of the field. Then the batter can advance to the first base, and other players of the attacking team who are already on a base can advance to next base (The next base of the third base is the home base). If a player returns to the home base, he scores one point for his team.<br><br>3.&#xFFFD;&#xFFFD;Allrun&#xFFFD;&#xFFFD;. In this case, the batter hits the ball out of the field and then all the players on the bases (including the batter) can run to the home base and each scores one point for his team. So in this case, the attacking team can score at least 1 point, and at most 4 points. <br><br>4.&#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD;. In this case, the batter chooses not to bat and leaves the field. According to the rule, in this case, the players still on the bases can advance to next base. So the player advancing to the home base this way scores one point. But if there have already been two batters who get an &#xFFFD;&#xFFFD;Out&#xFFFD;&#xFFFD; or a &#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD; before, &#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD; will end the game immediately and the attacking team can&#xFFFD;&#xFFFD;t score any point in this &#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD;.<br><br>&#xA0;&#xA0;According to the rule, a player must leave the field immediately after he scores one point for his team. The game ends after every player of the attacking team has batted once(A &#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD; is also regarded as a bat), or after there has been 3 batters who get an &#xFFFD;&#xFFFD;Out&#xFFFD;&#xFFFD; or an &#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD;. <br><br>Avatar is the coach of an attacking team. He knows that the same player performs differently when the player takes different turns. For example, if you let Jack to be the first batter, he will definitely get an &#xFFFD;&#xFFFD;Out&#xFFFD;&#xFFFD;, but if you let him play in the third turn, he will get an &#xFFFD;&#xFFFD;Allrun&#xFFFD;&#xFFFD;. Avatar knows his men very well. He asked you to find out the best &#xFFFD;&#xFFFD;batting order&#xFFFD;&#xFFFD; for his team. If the team bats in that order, their score will be maximized.","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases, ended by 0.<br><br>For each test case:<br>The first line contains an integer n&#xFFFD;&#xFFFD;1&lt;=n &lt;=15&#xFFFD;&#xFFFD;, meaning the number of players in Avatar&#xFFFD;&#xFFFD;s team. All players are numbered for 1 to n.<br><br>Then a n&#xFFFD;&#xFFFD;n matrix A follows. Aij describes what result the player i will get if he is the jth batter.( i and j start from 1 )<br><br>Following is the meaning of the value of Aij:<br>0 means the result is &#xFFFD;&#xFFFD;Out&#xFFFD;&#xFFFD;<br>1 means the result is &#xFFFD;&#xFFFD;Sacrifice&#xFFFD;&#xFFFD;<br>2 means the result is &#xFFFD;&#xFFFD;Bingle&#xFFFD;&#xFFFD;<br>3 means the result is &#xFFFD;&#xFFFD;Allrun&#xFFFD;&#xFFFD;","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print one line containing the highest score Avatar&#xFFFD;&#xFFFD;s team can get in the game.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n0 2 0 1 2\n1 0 2 0 2\n0 2 1 2 0\n0 2 2 1 2\n2 1 0 2 0\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+National+Programming+Invitational+Contest+Host+by+ZSTU+&amp;source=1&amp;searchmode=source\"> 2010 National Programming Invitational Contest Host by ZSTU  </a> ","type":"source","format":"html"}]}