{"title":"Elune’s Arrow","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3408","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3408&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3408","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3408"},"statement":[{"title":"Problem Description","content":"In a recent DOTA game, Littlepig picked Priestess of the Moon (also been called as &#x201C;POM&#x201D;) and wanted to practice his skills. As you may know, POM is famous for her second skill &#x201C;Elune&#x2019;s Arrow&#x201D;, which allows POM to fire a fast magic arrow to deal large damage to the enemy unit. In fact, POM&#x2019;s arrow always flies in a straight line and disappear after hitting an enemy unit.<br><br>Littlepig&#x2019;s POM was hiding in the forest and intended to shoot a certain important target on the lane. There were also several other enemy units nearby. POM&#x2019;s arrow might fly in a wrong direction and miss the target, or even if the arrow flew straight to the target, it still could be blocked by other enemy units and couldn&#x2019;t reach the target. So given a flying direction, your job is to determine whether Littlepig&#x2019;s arrow would hit his target.","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases, and each test case is given in the following format:<br>The first line contains an integer n (0 &lt;n&lt;=5), indicating the number of enemy units in the game.<br>The second line are two integers (x0,y0) representing the position where POM stands.<br>The third line gives a vector (dx,dy) describing the flying direction of the arrow.<br>Then n lines follows, each describing an enemy unit. An enemy unit can be considered as a convex polygon and the polygon is given in the following format in a line:<br>&#xA0;&#xA0;&#xA0;&#xA0;m x1 y1 x2 y2&#x2026;xm ym<br>m is the number of vertices(m&lt;=10), and (x1,y1)&#x2026;(xm,ym) are the vertices coordinates of the polygon, given in counter-clockwise order. <br>The first enemy unit is the POM&#x2019;s target.<br><br>The input ends with a zero in a separate line (n=0). All input numbers are integers that do not exceed 105 in magnitude. It is guaranteed that polygons do not contact or overlap, and the point (x0,y0) isn&#x2019;t inside (or on) any polygons.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output &#x201C;HIT&#x201D; if the arrow hits its target and &#x201C;MISS&#x201D; otherwise, in a separate line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n0 0\n0 1\n3 2 0 0 2 0 1\n1\n0 0\n-1 -1\n3 2 0 0 2 0 1\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">HIT\nMISS</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+National+Programming+Invitational+Contest+Host+by+ZSTU+&amp;source=1&amp;searchmode=source\"> 2010 National Programming Invitational Contest Host by ZSTU  </a> ","type":"source","format":"html"}]}