{"title":"Snail Alice","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3411","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3411&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3411","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3411"},"statement":[{"title":"Problem Description","content":"Snail Alice is a snail indulged in math. One day, when she was walking on the grass, suddenly an accident happened. Snail Alice fell into a bottomless hole, which was deep enough that she kept falling for a very long time. In the end, she caught the lateral wall of the hole and stop falling down. She named the place where she stopped &#xFFFD;&#xFFFD;lucky place&#xFFFD;&#xFFFD; immediately. <br><br>Snail Alice decided to climb up along the wall from the &#xFFFD;&#xFFFD;lucky place&#xFFFD;&#xFFFD;. The first day she climbed up q0 (q is a positive constant integer) metres, but at night when she fell asleep, she fell down q1 metres. She was shocked when she woke up, and she decided to make an extra effort. The second day she finally climbed up q2 metres. To her surprise, she fell down faster because of the tiredness. She fell down q3 metres at night. The longer she climbed up the longer she fell down. But finally, she still climbed out of the hole and slept on the ground. <br><br>Lying on the grass safe, she was curious about a question. How many metres was the &#xFFFD;&#xFFFD;lucky place&#xFFFD;&#xFFFD; down under the ground? She remembered that the sum of the times of her climbing up and falling down is n(of course, n is odd), so the distance between the ground and the &#xFFFD;&#xFFFD;lucky place&#xFFFD;&#xFFFD; must be 1-q+q2-q3+...+(-1)n-1qn-1. Snail Alice simplified that long formula and get a beautiful result: (qn+1)/(q+1). But as a math professor, she wouldn&#xFFFD;&#xFFFD;t stop. She came up with a good problem to test her students. Here is the problem:<br><br>A function f(n), n is a positive integer, and <br> <center><img style=\"max-width:100%;\" src=\"../../../data/images/3411-1.png\"></center><br>Given q and n, please calculate the value of f(n).Please note that q and n could be huge.","type":"description","format":"html"},{"title":"Input","content":"Input consists of multiple test cases, and ends with a line of &#xFFFD;&#xFFFD;-1 -1 -1&#xFFFD;&#xFFFD;.<br>For each test case: <br>The first line contains three integers x1, y1 and z1, representing q.  q=x1^y1+z1.<br>The second line contains two integers: y2 and z2, representing n. n=2^y2+z2.<br>The third line contains a single integer P, meaning that what you really should output is the formula&#xFFFD;&#xFFFD;s value mod P. <br>Note: 0&lt;=x1,y1,z1,y2,z2&lt;=50000, z1&gt;0, 0&lt;P&lt;100000000","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print one line containing an integer which equals to the formula&#xFFFD;&#xFFFD;s value mod P.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1 3\n0 0\n32551\n3 0 5\n0 2\t\n70546\n-1 -1 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n31</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+National+Programming+Invitational+Contest+Host+by+ZSTU+&amp;source=1&amp;searchmode=source\"> 2010 National Programming Invitational Contest Host by ZSTU  </a> ","type":"source","format":"html"}]}