{"title":"Tour Route","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3414","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3414&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3414","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3414"},"statement":[{"title":"Problem Description","content":"The city is so crowded that the mayor can&apos;t bear any longer. He issued an order to change all the roads into one-way street. The news is terrible for Jack, who is the director of a tourism company, because he has to change the travel route. All tourists want to set out from one scenic spot, then go to every scenic spots once and only once and finally return to the starting spot. They don&#xFFFD;&#xFFFD;t care about which spot to start from, but they won&#xFFFD;&#xFFFD;t go back to the starting spot before they have visited all other spots. Fortunately, the roads in the city have been perfectly built and any two scenic spots have been connected by ONE road directly. Jack gives the map of the city to you, and your task is to arrange a new travel route around the city which can satisfy the tourists.","type":"description","format":"html"},{"title":"Input","content":"Input consists of multiple test cases and ends with a line of &#xFFFD;&#xFFFD;0&#xFFFD;&#xFFFD;.<br>For each test case:<br>The first line contains a single integer n (0&lt;n&lt;=1000), representing the number of city scenic spots. Scenic spots are numbered form 1 to n.<br>Then n lines follows, and each line consists of n integers. These n lines make a matrix. If the element in the ith row and the jth column is 1(i&#xFFFD;&#xFFFD;j), it means that the direction of the road between spot i and spot j is from spot i to spot j. If that element is 0, it means that the road&#xFFFD;&#xFFFD;s direction is from spot j to spot i.  The numbers in the main diagonal of the matrix are all 0. (i and j start from 1)","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print all the spots No. according to the traveling order of the route in one line. If multiple routes exist, just print one of them. If no such route exists, print a &#xFFFD;&#xFFFD;-1&#xFFFD;&#xFFFD; instead. Because the starting spot is the same as the ending spot, so you don&#xFFFD;&#xFFFD;t need to print the ending spot.<br><br>This problem needs special judge.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n0 0 1 1 1 \n1 0 1 1 0 \n0 0 0 1 0 \n0 0 0 0 1 \n0 1 1 0 0\n2\n0 1\n0 0\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 3 4 5 2\n-1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+National+Programming+Invitational+Contest+Host+by+ZSTU+&amp;source=1&amp;searchmode=source\"> 2010 National Programming Invitational Contest Host by ZSTU  </a> ","type":"source","format":"html"}]}