{"title":"Bus Fair","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3420","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3420&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3420","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3420"},"statement":[{"title":"Problem Description","content":"You are now in Foolish Land. Once moving in Foolish Land you found that there is a strange Bus fair system. The fair of moving one kilometer by bus in that country is one coin. If you want to go to X km and your friend wants to go to Y km then you can buy a ticket of X+Y coins (you are also allowed to buy two or more tickets for you two).<br>&#xA0;&#xA0;<br>Now as a programmer, you want to show your creativity in buying tickets! Suppose, your friend wants to go 1 km and you want to go 2 km. Then it&#xFFFD;&#xFFFD;s enough for you to buy a 2coin ticket! Because both of you are valid passengers before crossing the first km. and when your bus cross the first km your friend gets down from the bus. So you have the ticket of 2km! And you can safely reach to your destination, 2km using that ticket.<br>&#xA0;&#xA0;<br>Now, you have a large group of friends and they want to reach to different distance. You think that you are smart enough that you can buy tickets that should manage all to reach their destination spending the minimum amount of coins. Then tell us how much we should at least pay to reach our destination.","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. Each case start with a integer n, the total number of people in that group. 0&lt;=n&lt;=1000. Then comes n integers, each of them stands for a distance one of the men of the group wants to go to. You can assume that the distance a man wants to go is always less than 10000.","type":"input_format","format":"html"},{"title":"Output","content":"Your program should print a single integer for a single case, the minimum amount of coins the group should spend to reach to the destination of all the members of that group.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n2\n2\n2\n3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4</div></pre>","type":"example","format":"html"},{"title":"Author","content":"Muhammed Hedayet","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ+Monthly+Contest+%A8C+2010.06.05&amp;source=1&amp;searchmode=source\"> HDOJ Monthly Contest &#xFFFD;C 2010.06.05 </a> ","type":"source","format":"html"}]}