{"title":"Range","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3424","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3424&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3424","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3424"},"statement":[{"title":"Problem Description","content":"Some automobiles display the estimated driving range, that is, the distance you can expect to drive it (without adding fuel) before running out of fuel. Here is how it works: periodically, the vehicle&apos;s computer records the odometer reading and the weight of fuel in the fuel tank. From this data, the fuel consumption over a certain distance can be computed.<br>From the fuel consumption and the most recent measurement of fuel tank contents (which we assume is current for all practical purposes), the range can be calculated. Intervals over which the quantity of fuel increased (fuel was added to the tank) will not be used in the computations. For example, in the first problem instance of the sample input, the interval where the fuel weight increased from 29.9 kilograms to 34.2 kilograms will not be used. In this example, 16.3 kilograms of fuel were consumed over a distance of 228.6<br>kilometers. Therefore, the most recently measured fuel contents of 31.2 kilograms will enable you to drive another 438 kilometers (rounded to the nearest integer). The input will always contain at least one interval (two consecutive lines of input) where no fuel was added to the tank.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains data for a number of problem instances. Each problem instance consists of three or more (odometer reading, fuel weight) pairs, one pair per line. Distances are measured in kilometers and fuel weight in kilograms. All input numbers will be given to one decimal place. The end of each problem instance will be signaled by a (0.0, 0.0) pair. The last problem instance will be followed by a (-1.0, -1.0) pair.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each problem instance, print the range, rounded to the nearest integer.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">18400.5 43.2\n18440.4 40.4\n18482.7 37.0\n18540.2 33.1\n18585.3 29.9\n18620.8 34.2\n18664.6 31.2\n0.0 0.0\n18400.5 43.2\n18440.4 40.4\n18482.7 37.0\n18540.2 33.1\n18585.3 29.9\n0.0 0.0\n-1.0 -1.0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">438\n415</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Rocky+Mountain+Regional+Contest+2009&amp;source=1&amp;searchmode=source\"> Rocky Mountain Regional Contest 2009 </a> ","type":"source","format":"html","require":["katex"]}]}