{"title":"Clickomania","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3427","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3427&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3427","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3427"},"statement":[{"title":"Problem Description","content":"Clickomania is a puzzle in which one starts with a rectangular grid of cells of different colours. In each step, a player selects (&quot;clicks&quot;) a cell. All connected cells of the same colour as the selected cell (including itself) are removed if the selected cell is connected to at least one other cell of the same colour. The resulting &quot;hole&quot; is filled in by adjacent cells based on some rule, and the object of the game is to remove all cells in the grid. In this problem, we are interested in the one-dimensional version of the problem. The starting point of the puzzle is a string of colours (each represented by an uppercase letter).<br>At any point, one may select (click) a letter provided that the same letter occurs before or after the one selected. The substring of the same letter containing the selected letter is removed, and the string is shortened to remove the hole created. To solve the puzzle, the player has to remove all letters and obtain the empty string. If the player obtains a non-empty string in which no letter can be selected, then the player loses. For example, if one starts with the string &quot;ABBAABBAAB&quot;, selecting the first &quot;B&quot; gives &quot;AAABBAAB&quot;. Next, selecting the last &quot;A&quot; gives &quot;AAABBB&quot;. Selecting an &quot;A&quot; followed by a &quot;B&quot; gives the empty string. On the other hand, if one selects the third &quot;B&quot; first, the string &quot;ABBAAAAB&quot; is obtained. One may verify that regardless of the next selections, we obtain either the string &quot;A&quot; or the string &quot;B&quot; in which no letter can be selected. Thus, one must be careful in the sequence of selections chosen in order to solve a puzzle. Furthermore,<br>there are some puzzles that cannot be solved regardless of the choice of selections. For example, &quot;ABBAAAAB&quot; is not a solvable puzzle. Some facts are known about solvable puzzles: The empty string is solvable. If x and y are solvable puzzles, so are xy, AxA, and AxAyA for any uppercase letter<br>A. All other puzzles not covered by the rules above are unsolvable.<br>Given a puzzle, your task is to determine whether it can be solved or not.","type":"description","format":"html"},{"title":"Input","content":"Each case of input is specified by a single line. Each line contains a string of uppercase letters. Each string has at least one but no more than 150 characters. The input is terminated by the end of file.","type":"input_format","format":"html"},{"title":"Output","content":"For each input case, print solvable on a single line if there is a sequence of selections that solves the puzzle. Otherwise, print unsolvable on a line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">ABBAABBAAB\nABBAAAAB</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">solvable\nunsolvable</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Rocky+Mountain+Regional+Contest+2009&amp;source=1&amp;searchmode=source\"> Rocky Mountain Regional Contest 2009 </a> ","type":"source","format":"html"}]}