{"title":"Papa","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3431","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3431&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3431","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3431"},"statement":[{"title":"Problem Description","content":"While cleaning your parents&apos; attic, you discovered a box containing many documents describing the relationships among your ancestors. Given these documents, you are interested in answering a number of questions about the relationships implied by the document. Fortunately, all your ancestors have unique names so it is possible to make many inferences without any confusion.<br><br>It is assumed that all relationships (implied or given) satisfy the following:<br><br>    *A person can be either male, female, or have an unknown (undetermined by the data set) sex;<br>    *a person can have at most one spouse (of the opposite sex), and X is Y&apos;s wife if and only if Y is X&apos;s husband;<br>    *a person can have at most one mother and at most one father that can be inferred from the given data;<br>    *if a person has a mother and father, then the mother and father are married;<br>    *the children of a person&apos;s spouse are that person&apos;s children as well;<br>    *the spouse of a son (or daughter) is not considered to be a daughter (or son). In other words, &quot;sons&quot; and &quot;daughters&quot; refer to biological sons and daughters.<br><br>The information provided will be consistent, and you may assume there are no hidden relationships that are not explicitly stated or implied by the above rules of consistency.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first part of the input consists of a number of lines describing the known relationships. Each relationship is listed on one line in the form:<br><br>NAME is NAME&apos;s RELATIONSHIP.<br><br>where NAME is a lowercase alphabetic word (never &apos;is&apos;), and RELATIONSHIP is one of<br><br>    *wife<br>    *husband<br>    *daughter<br>    *son<br>    *mother<br>    *father<br><br>This first part is terminated by a blank line. You may assume that there is at least one known relationship given, and there are at most 100 distinct names mentioned in the known relationships.<br><br>This is followed by a list of questions (one per line) of the form:<br>is NAME NAME&apos;s RELATIONSHIP?<br>where NAME is as before, but RELATIONSHIP is one of<br><br>    *wife<br>    *husband<br>    *daughter<br>    *son<br>    *mother<br>    *father<br>    *niece: X is a niece of Y if there are W and Z such that X is a daughter of  W, and W and Y are distinct children of Z.<br>    *nephew: X is a nephew of Y if there are W and Z such that X is a son of W, and W and Y are distinct children of Z.<br>    *grandfather: X is a grandfather of Y if there is Z such that X is a father of Z, and Z is the father or mother of Y.<br>    *grandmother: X is a grandmother of Y if there is Z such that X is a mother of Z, and Z is the father or mother of Y.<br>    *grandson: X is a grandson of Y if there is Z such that X is a son of Z, and Z is a child of Y.<br>    *granddaughter: X is a granddaughter of Y if there is Z such that X is a daughter of Z, and Z is a child of Y.<br><br>All names appearing in the questions will be mentioned in the list of known relationships. The list of questions is terminated by the end of file.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each question, print on a line yes or no if the answer of the question can be determined, or unknown if the answer may be yes or no because the sex of the relevant person(s) in the question cannot be determined from the known relationships.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">john is mary&apos;s husband.\njohn is tom&apos;s father.\nmary is jane&apos;s mother.\njane is anna&apos;s mother.\n\nis mary john&apos;s wife?\nis jane mary&apos;s daughter?\nis tom mary&apos;s husband?\nis anna jane&apos;s daughter?</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">yes\nyes\nno\nunknown</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Rocky+Mountain+Regional+Contest+2009&amp;source=1&amp;searchmode=source\"> Rocky Mountain Regional Contest 2009 </a> ","type":"source","format":"html","require":["katex"]}]}