{"title":"Beat drop","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3451","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3451&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3451","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3451"},"statement":[{"title":"Problem Description","content":"John recently found an interesting flash game on BBS. The game is mainly about making the best of the present waterdrops and use as little waterdrops as possible to eliminate all the <center><img style=\"max-width:100%;\" src=\"../../data/images/3451-1.jpg\"></center>waterdrops on board.Now let&#x2019;s briefly introduce the operations: The game board is a 6*6 square. At the beginning, there are waterdrops in some squares (in different sizes), gamers can obtain a larger waterdrop by adding little waterdrops to the square. When the number of little waterdrops in the square meets 4, the big waterdrop in the square breaks, producing 4 little waterdrops, in whatever circumstances, the broken waterdrop can only produce 4 little waterdrops, which then fly up, down left, right, four directions. When a little whatdrop meets a square that contains a waterdrop, it will be absorbed, and the one in the square will become larger, just the same as when you manually add one to the square. When multiple waterdrops arrive at &#xFF08;a square that contains a waterdrop&#xFF09; simultaneously, they will be absorbed by the square. If the waterdrop touch the edge of board, it disappears. Gamers hope to use the least waterdrops to eliminate the waterdrops on board, so they can make through more levels. For further details, please visit &#x201C;flashempire&#x201D;. John and other byr players are obsessed with the game, but he is just not good at it. It&#x2019;s mainly because after he comes up with an order to add the waterdrop, he can&#x2019;t imagine the layout. Now John needs your help. So you will be given a game board and how the waterdrops are distributed, and John will tell you how he is going to add the waterdrop, he hopes that you can tell him if it can make it through the level, if not, tell him what the board will be like at the end. We use a n*m square to represent the game board, and L to represent the up limit of the number of waterdrops each square can contain, the number of waterdrops in each square exceeds L, the drop breaks. And the broken water drop produces 4 little waterdrops that will fly in four directions in the same speed.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line will contain an integer T indicating the number of test cases For each test case, it starts with three integers n, m, L, where n is the number of the rows, m is the number of the columns, L is the up limit of the number each square can contain. 1&lt;= n, m &lt;= 100&#xFF0C;5 &lt;= L&lt;=10. Then follows a n*m matrix indicating the initial state of the game board, you are assured that every element is non-negative and no larger than L. After the matrix, there will be a number q, indicating how John is going to add the waterdrop at the qth step. John only adds waterdrop when it is stabel after putting last waterdrop. So q line follows, each contains two integers x,y indicating the location John adds waterdrop. 1&lt;=x&lt;=n,1&lt;=y&lt;=m.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case, output &#x201C;YES&#x201D; or &#x201C;NO&#x201D; first, indicating if John can make it the end of this stage, if it is &#x201C;NO&#x201D;, it is required to output a n*m matrix indicating the final state of the game board.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 2 2\n2 0\n0 0\n1\n1 1\n2 2 2\n2 0\n0 0 \n1\n1 2\n6 6 4\n4 3 2 0 0 0\n3 3 0 1 2 2\n1 3 2 4 2 0\n3 4 1 4 4 1\n3 2 2 2 3 0\n3 0 3 2 1 2\n6\n4 3\n4 3\n3 2\n2 2\n2 6\n4 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">YES\nNO\n2 1\n0 0\nNO\n0 0 0 0 0 0 \n0 0 0 0 0 0 \n0 0 0 0 0 0 \n0 0 0 0 0 0 \n0 0 0 0 0 0 \n0 0 0 0 4 4 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A82%A3%A9%A1%AA%A1%AAHost+by+BUPT+&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;2&#xFF09;&#x2014;&#x2014;Host by BUPT  </a> ","type":"source","format":"html","require":["katex"]}]}