{"title":"Number Game","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3454","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3454&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3454","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3454"},"statement":[{"title":"Problem Description","content":"Carl and Ellie are in the midst of another adventure; this time, it is a road trip through Canada! They&apos;ve just arrived in Saskatchewan [insert rectangular shape here], right in the middle of the Canadian prairies,and, to their horror, have discovered that all the rumours about it being dreadfully at are true. Suddenly,the warnings their Canadian friends gave them prior to the trip spring back to mind, such as:It&apos;s so flat, a boy can watch his dog run away! Or: It&apos;s so flat, it&apos;s impossible to jump to your death! As the driver, Carl is worried about falling asleep at the wheel and has decided to come up with a game to relieve the boredom. As a conscientious driver, he doesn&apos;t want the game to be too distracting--the roads here are unerringly straight, so it&apos;s easy to lose track of motion--so the rules are simple:<br>&#x25CF; Carl picks a number, N, between 1 and 1, 000, 000, 000.<br>&#x25CF; Carl and Ellie take turns subtracting an integer (between 1 and 20) from N. Carl plays fi\frst, and the winner is the one who subtracts off\u000b a number to get 0.<br>For example, suppose Carl picks the number 50. He subtracts off\u000b the number 5, leaving 45. Ellie subtracts off\u000b 17, leaving 28. Carl subtracts off\u000b 8, leaving 20. Finally, Ellie subtracts off\u000b 20, leaving 0, and wins!Frankly, Ellie would rather sleep than play this game, so she has reprogrammed the GPS (which isn&apos;t<br>necessary in this region, anyway) to play for her instead. Her method of choosing a number is straightforward:<br>&#x25CF; If on a given turn, the number remaining is 20 or less, then she picks that number and wins.<br>&#x25CF; Otherwise, her choice of number is completely determined by the number Carl just picked, as follows.Before the game starts, Ellie chooses 20 random numbers, 1 &lt;= a<sub>1</sub>, a<sub>2</sub>, a<sub>3</sub>, &#x2026; , a<sub>20</sub> &lt;= 20. Then whenever Carl subtracts off\u000b the number k, Ellie responds by subtracting off\u000b the number a<sub>k</sub> (unless she can win).Carl needs your help! To help stay motivated playing this game, he would like to know if there exists a winning strategy for him, given the numbers N and a<sub>1</sub>, a<sub>2</sub>, a<sub>3</sub>, &#x2026; , a<sub>20</sub> .","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Each input case begins with the number N on a line by itself; the next line contains the numbers a<sub>1</sub>, a<sub>2</sub>, &#x2026; , a<sub>20</sub> ,separated by spaces. Input terminates with a line containing 0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print &quot;Carl can win&quot; or &quot;Carl can&apos;t win&quot;.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">42\n20 19 18 17 16 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Carl can&apos;t win\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In this example, since Carl chooses N to be 42, it turns out that he has no winning strategy. (Indeed,whichever number he initially subtracts off, Ellie will subtract \noff a number leaving 21 for Carl. Then whatever number Carl subtracts off next, Ellie will be left with a number between 1 and 20, and she wins!)</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Stanford+Local+ACM+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2009 Stanford Local ACM Programming Contest </a> ","type":"source","format":"html","require":["katex"]}]}