{"title":"Universal Oracle","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3456","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3456&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3456","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3456"},"statement":[{"title":"Problem Description","content":"In computer science, an oracle is something that gives you the answer to a particular question. For this problem, you need to write an oracle that gives the answer to everything. But it&apos;s not as bad as it sounds; you know that 42 is the answer to life, the universe, and everything.","type":"description","format":"html"},{"title":"Input","content":"The input consists of a single line of text with at most 1000 characters. This text will contain only well-formed English sentences. The only characters that will be found in the text are uppercase and lowercase letters, spaces, hyphens, apostrophes, commas, semicolons, periods, and question marks. Furthermore, each sentence begins with a single uppercase letter and ends with either a period or a question mark. Besides these locations, no other uppercase letters, periods, or question marks will appear in the sentence. Finally, every question (that is, a sentence that ends with a question mark) will begin with the phrase &quot;What is...&quot;","type":"input_format","format":"html"},{"title":"Output","content":"For each question, print the answer, which replaces the &quot;What&quot; at the beginning with &quot;Forty-two&quot; and the question mark at the end with a period. Each answer should reside on its own line. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Let me ask you two questions. What is the answer to life? What is the answer to the universe?</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Forty-two is the answer to life.\nForty-two is the answer to the universe.</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+Stanford+Local+ACM+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2009 Stanford Local ACM Programming Contest </a> ","type":"source","format":"html"}]}