{"title":"Interviewe","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3486","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3486&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3486","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3486"},"statement":[{"title":"Problem Description","content":"YaoYao has a company and he wants to employ m people recently. Since his company is so famous, there are n people coming for the interview. However, YaoYao is so busy that he has no time to interview them by himself. So he decides to select exact m interviewers for this task.<br>YaoYao decides to make the interview as follows. First he queues the interviewees according to their coming order. Then he cuts the queue into m segments. The length of each segment is<img style=\"max-width:100%;\" src=\"../../data/images/C295-1009-1.jpg\">  , which means he ignores the rest interviewees (poor guys because they comes late). Then, each segment is assigned to an interviewer and the interviewer chooses the best one from them as the employee.<br>YaoYao&#x2019;s idea seems to be wonderful, but he meets another problem. He values the ability of the ith arrived interviewee as a number   from 0 to 1000. Of course, the better one is, the higher ability value one has. He wants his employees good enough, so the sum of the ability values of his employees must exceed his target k (exceed means strictly large than). On the other hand, he wants to employ as less people as possible because of the high salary nowadays. Could you help him to find the smallest m?<br>","type":"description","format":"html"},{"title":"Input","content":"The input consists of multiple cases.<br>In the first line of each case, there are two numbers n and k, indicating the number of the original people and the sum of the ability values of employees YaoYao wants to hire (n&#x2264;200000, k&#x2264;1000000000). In the second line, there are n numbers v1, v2, &#x2026;, vn (each number is between 0 and 1000), indicating the ability value of each arrived interviewee respectively.<br>The input ends up with two negative numbers, which should not be processed as a case.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print only one number indicating the smallest m you can find. If you can&#x2019;t find any, output -1 instead.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">11 300\n7 100 7 101 100 100 9 100 100 110 110\n-1 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>We need 3 interviewers to help YaoYao. The first one interviews people from 1 to 3, the second interviews people from 4 to 6, \nand the third interviews people from 7 to 9. And the people left will be ignored. And the total value you can get is 100+101+100=301&gt;300.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A85%A3%A9%A1%AA%A1%AAHost+by+BJTU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;5&#xFF09;&#x2014;&#x2014;Host by BJTU </a> ","type":"source","format":"html"}]}