{"title":"Manhattan Distance","time_limit":3000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3490","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3490&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3490","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3490"},"statement":[{"title":"Problem Description","content":"The kingdom of Henryy is the most civilized country in the world. Meanwhile, the capital city H is as well the most beautiful city on the earth. Currently, the city is to build up database to maintain the statistics of the buildings in the city.<br>You are a little P in the company that takes this project. Your task is to calculate the maximum distance between two buildings in the city.<br>The Manhattan Distance is defined as: for two points P1(x1, y1) and P2(x2, y2) on a two dimension Cartesian plane, the Manhattan Distance D(P1, P2) = |x1-x2|+|y1-y2|.<br>Your database should support this query: after updating a data that a building has built or demolished, it should return the maximum distance between existed buildings:<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C280-1003-1.jpg\"></center> <br><br>N is the current number of buildings, and Pi is the coordinates of the ith building.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T (T&lt;=10), indicating the number of the test cases.<br>For each test case, the first line contains an integer M (M&lt;=100000), the number of records of the changes of buildings.<br>Then M lines followed, each line starting with a positive integer: 1 for building that has built, and 2 for demolished. A string with less than 9 characters follows, indicating the name of the building. If this building is just built, two integers of the coordinates of this building are given afterwards.<br>Notice that no two buildings share the same name, even when one of these buildings has been demolished, but might share the same coordinates. It is also guaranteed that the building exists when a demolishing record is given.<br>A blank line is followed after each test case.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each record, output an integer in a single line, indicating the maximum Manhattan Distance among existing buildings.<br>Print a blank line after each test case.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n8\n1 mgj -2 1\n2 mgj\n1 kmoaktmr 4 -4\n1 mauxizu 3 -2\n2 kmoaktmr\n1 md -1 4\n2 md\n1 umos -5 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n-1\n0\n3\n0\n10\n0\n10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A86%A3%A9%A1%AA%A1%AAHost+by+BIT&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFFFD;&#xFFFD;6&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Host by BIT </a> ","type":"source","format":"html"}]}