{"title":"Dangerous Situation","time_limit":1000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3494","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3494&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3494","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3494"},"statement":[{"title":"Problem Description","content":"Long long time ago, there was one island with several village. People living on the island choose one leader as the CHIEF per four years. This time, a leader was picked to continue in office for another term but not all the people support him, especially the owner of the supermarkets and supplier in villages because he has promised to build roads between each village but no roads seemed to be under constructed.<br>To get the support of the owners, the chief was thinking about building roads. But the situation was more dangerous because the chief was so mean that he decide to build roads only with the most reasonable price and he want to build as less roads as possible even if no roads can be built between two villages . Engineer Ei come up with different plan of road construction with different price Pi and capability Ci. Only the the road with the highest Ci/Pi rate will be picked as the final plan.<br>On the exciting day, the chief will gather all the plan the engineers come up with and decide whether each of them is packed or not. The chief will check the list on which the plans are listed with the order based on the time when the plan was submitted to the chief. A road building plan was changed only if there is a better Ci/Pi connecting the same points.<br>However, not all the one will satisfy. If the one of the supermarkets can&#x2019;t get enough goods from the supplier, or the suppliers cannot sell his goods to any of the supermarket, the rich owners will gather their wealth and impeach the chief, and the chief will surely step down the office as his enemy was so powerful. Your job is to find out whether the chief can survive this dangerous situation.<br>","type":"description","format":"html"},{"title":"Input","content":"The input will have several test cases. First line is t (t&lt;=10) integer t indicating the number of test cases. Then comes two integers n (n&lt;=200) and m which indicate the number of villages and the number of supermarket (the number of supplier is n-m). Next m line is 2 number in line i where Si and Di (Di&lt;=1000) indicate the supermarket located in the ith village have a demand of Di (the else ones are suppliers). The next line has a number p (p&lt;=5000) indicating the number of road plans. Then p lines followed with four integers per line, s, e, c (c&lt;=1000), v (v&lt;=1000) indicating the start, the end, the capability, the price of the road engineer come up with.","type":"input_format","format":"html"},{"title":"Output","content":"The output will contain one line with &#x201C;Yes&#x201D; or &#x201C;No&#x201D; indicating whether the chief can survive the dangerous situation.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n4 2\n1 100\n2 100\n3\n1 2 200 40\n1 3 200 40\n2 4 200 30</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A86%A3%A9%A1%AA%A1%AAHost+by+BIT&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;6&#xFF09;&#x2014;&#x2014;Host by BIT </a> ","type":"source","format":"html"}]}