{"title":"King’s Case","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3513","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3513&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3513","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3513"},"statement":[{"title":"Problem Description","content":"As you maybe know, <strong>Chess</strong> is a board game played between two players. It is played on a chessboard, which is a square-checkered board with 64 squares arranged in an eight-by-eight grid. At the start, each player controls sixteen pieces: one king, one queen, two rooks, two knights, two bishops, and eight pawns. The object of the game is to checkmate the opponent&apos;s king, whereby the king is under immediate attack (in &quot;check&quot;) and there is no way to remove or defend it from attack on the next move. <center><img style=\"max-width:100%;\" src=\"../../data/images/C281-1006-1.jpg\"></center><br>The board has eight rows (called ranks and denoted with numbers 1 to 8) and eight columns (called files and denoted with letters a to h).<br>White always moves first. After the initial move, the players alternately move one piece at a time (with the exception of castling, when two pieces are moved). Pieces are moved to either an unoccupied square, or one occupied by an opponent&apos;s piece, capturing it and removing it from play. With the sole exception of en passant, all pieces capture opponent&apos;s pieces by moving to the square that the opponent&apos;s piece occupies. (In this problem, there will not be &#x2018;en passant&#x2019;, &#x2018;Castling&#x2019; or &#x2018;Promotion&#x2019;. This simplifies the problem a little.)<br><br>Each chess piece has its own style of moving.<br><br>&#x25CF;&#xA0;&#xA0;The king moves one square in any direction. The king has also a special move which is called castling and also involves a rook, but <strong>not</strong> in this problem!<br>&#x25CF;&#xA0;&#xA0;The rook can move any number of squares along any rank or file, but may not leap over other pieces. Along with the king, the rook is also involved during the king&apos;s castling move, but <strong>not</strong> in this problem!<br>&#x25CF;&#xA0;&#xA0;The bishop can move any number of squares diagonally, but may not leap over other pieces.<br>&#x25CF;&#xA0;&#xA0;The queen combines the power of the rook and bishop and can move any number of squares along rank, file, or diagonal, but it may not leap over other pieces.<br>&#x25CF;&#xA0;&#xA0;The knight moves to any of the closest squares which are not on the same rank, file or diagonal, thus the move forms an &quot;L&quot;-shape two squares long and one square wide. The knight is the only piece which can leap over other pieces.<br>&#x25CF;&#xA0;&#xA0;The pawn may move forward to the unoccupied square immediately in front of it on the same file, or on its first move it may advance two squares along the same file provided both squares are unoccupied, or it may move to a square occupied by an opponent&#x2019;s piece, which is diagonally in front of it on an adjacent file, capturing that piece. The pawn has two special moves, the en passant capture, and pawn promotion, but <strong>not</strong> in this problem! Just as you see, the white pawn move upward and the black pawn move downward.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C281-1006-2.jpg\"></center><br>A player may not make any move which allows the <strong>King</strong> to be captured. If such a move is not possible, the game ends. The result will be a checkmate, if king is under immediate attack or stalemate, if it is not.                                                                     -----Wikipedia.<br>The question your program should answer is when a player makes a move, determine the result of the move. The result can be one of these,<br><br>Checkmate! -----------------This move result a win.<br>Draw -------------------------This move result a stalemate<br>Check! -----------------------The game has not finished yet, but this move is a check<br>Just a normal move --------The game has not finished yet, and this move is not a check<br>This is not a legal move --This is happened when move a piece not belongs to it, want to eat a piece belongs to it, want to move a piece not under the style of that kind of piece, when you under check that move is not a right response or after that move you king will be capture.<br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input will consist of one or more test cases. <br>The first line of the input will be a single integer T, indicates the number of the cases.<br>Each test case adheres to the following format: <br>&#x25CF; On the first line there will be &#x201C;White makes a move&#x201D; or &#x201C;Black makes a move&#x201D;.<br>&#x25CF;  On the second line have two positions indicate the move from and to. The position is such is &#x201C;e4&#x201D;, in a lowercase character &#x2018;a&#x2019; to &#x2018;h&#x2019; and a number from 1 to 8. So the positions are always in the board.<br>&#x25CF;  On the next 8 lines will represent the board before the move.<br>&#x25CF;  The Black pieces will be represented by uppercase characters. K for King, Q for Queen, R for Rook, B for Bishop, N for Knight, P for Pawn. The White pieces will be represented by lowercase characters, just like the Blacks. You may assume the board before move is legal and the game have not finished yet. Squares has no piece in is represented by &#x2018;.&#x2019;.<br>There is not white line between cases.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output &#x201C;Checkmate!&#x201D;, &#x201C;Draw&#x201D;, &#x201C;Check!&#x201D;, &#x201C;Just a normal move&#x201D; or &#x201C;This is not a legal move&#x201D; in a line.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nWhite makes a move\ne2 e4\nRNBQKBNR\nPPPPPPPP\n........\n........\n........\n........\npppppppp\nrnbqkbnr\nBlack makes a move\nb8 b1\n.R....K.\n.....PPP\n........\n......r.\n........\n........\n.....ppp\n......k.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Just a normal move\nCheckmate!</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A88%A3%A9%A1%AA%A1%AAHost+by+ECNU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;8&#xFF09;&#x2014;&#x2014;Host by ECNU </a> ","type":"source","format":"html","require":["katex"]}]}