{"title":"Adopt or not","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3517","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3517&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3517","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3517"},"statement":[{"title":"Problem Description","content":"A two-party system is a form of party system where two major political parties dominate voting in nearly all elections, at every level. As a result, all, or nearly all, elected offices end up being held by candidates endorsed by one of the two major parties.Under a two-party system, one of the two parties typically holds a plurality in the legislature , and is referred to as the majority party. The smaller party is referred to as the minority party. Two-party systems are most common in polities with plurality vote counting system to prevent the problem of two similar candidates &quot;splitting&quot; the same voters.<br>There is a small country under a two-party system, the two parties are party A and party B. Every time when parliament convened, members of both parties will submit Their proposals. Some of the proposals will be raised by some members of the same party, but each person can submit only one. Of course, some people may object to certain proposals of the other party. If a member&apos;s proposal is adopted and all his objection cases are not adopted, then he will be pleased. As the country&apos;s president, you can arrange these proposals is adopted or not. You want to know , to make the numnber of people pleased with your decision maximum, which proposals must be adopted ?<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"On the first line one positive number: the number of testcases. After that per testcase:One line with three integers a, b, n (0&lt;=a,b&lt;=100 and 0&lt;=n&lt;=200): the number of proposals by party A, by party B, and number of members of the parliament. The proposals are numbered from 1 to a+b, the first a are party A&apos;s, the latter b are party B&apos;s.<br> n lines follow, each line represents a member of the parliament, begin with two integers ri,mi(1&lt;=ri&lt;=a+b, 0&lt;=mi&lt;a+b): the proposal submit by him, the number of proposals he object to. And then follows mi integers indicate the proposal he object to.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, you should output 2 lines. The first line will contains one integer, the maxium number of people pleased. The second line begins with an integer x, indicates there are x proposals must be adopted. Then output the x proposals in ascending order of their id. There is a space between each two proposals.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 1 3\n1 0\n1 0\n3 0\n2 1 3\n1 0\n2 1 3\n3 0\n2 1 4\n1 0\n1 1 3\n2 0\n3 2 1 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 1 3\n2 \n1 1\n3 \n2 1 2 \n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In case 2,the first people is happy only if proposal 1 is adopted;the second people is happy if proposal 2 is adopted and proposal 3 isn&apos;t;\nthe third people is happy only if proposal 3 is adopted;The maxium number is 2, there are 2 ways to get 2 people happy. Adopt proposal 1 and 2, or 1 and 3. \nSo,we can see that only proposal 1 must be adopted.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A89%A3%A9%A1%AA%A1%AAHost+by+HNU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;9&#xFF09;&#x2014;&#x2014;Host by HNU </a> ","type":"source","format":"html","require":["katex"]}]}