{"title":"SPY","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3527","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3527&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3527","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3527"},"statement":[{"title":"Problem Description","content":"The National Intelligence Council of X Nation receives a piece of credible information that Nation Y will send spies to steal Nation X&#xFFFD;&#xFFFD;s confidential paper. So the commander of The National Intelligence Council take measures immediately, he will investigate people who will come into NationX. At the same time, there are two List in the Commander&#xFFFD;&#xFFFD;s hand, one is full of spies that Nation Y will send to Nation X, and the other one is full of spies that Nation X has sent to Nation Y before. There may be some overlaps of the two list. Because the spy may act two roles at the same time, which means that he may be the one that is sent from Nation X to Nation Y, we just call this type a &#xFFFD;&#xFFFD;dual-spy&#xFFFD;&#xFFFD;. So Nation Y may send &#xFFFD;&#xFFFD;dual_spy&#xFFFD;&#xFFFD; back to Nation X, and it is obvious now that it is good for Nation X, because &#xFFFD;&#xFFFD;dual_spy&#xFFFD;&#xFFFD; may bring back NationY&#xFFFD;&#xFFFD;s confidential paper without worrying to be detention by NationY&#xFFFD;&#xFFFD;s frontier So the commander decides to seize those that are sent by NationY, and let the ordinary people and the &#xFFFD;&#xFFFD;dual_spy&#xFFFD;&#xFFFD; in at the same time .So can you decide a list that should be caught by the Commander?<br>A:the list contains that will come to the NationX&#xFFFD;&#xFFFD;s frontier.<br>B:the list contains spies that will be sent by Nation Y.<br>C:the list contains spies that were sent to NationY before.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases.<br>Each test case contains four parts, the first part contains 3 positive integers A, B, C, and A is the number which will come into the frontier. B is the number that will be sent by Nation Y, and C is the number that NationX has sent to NationY before. <br>The second part contains A strings, the name list of that will come into the frontier.<br>The second part contains B strings, the name list of that are sent by NationY.<br>The second part contains C strings, the name list of the &#xFFFD;&#xFFFD;dual_spy&#xFFFD;&#xFFFD;.<br>There will be a blank line after each test case.<br>There won&#xFFFD;&#xFFFD;t be any repetitive names in a single list, if repetitive names appear in two lists, they mean the same people.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Output the list that the commander should caught (in the appearance order of the lists B).if no one should be caught, then , you should output &#xFFFD;&#xFFFD;No enemy spy&#xFFFD;&#xFFFD;","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8 4 3\nZhao Qian Sun Li Zhou Wu Zheng Wang\nZhao Qian Sun Li\nZhao Zhou Zheng\n2 2 2\nZhao Qian\nZhao Qian\nZhao Qian</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Qian Sun Li\nNo enemy spy</div></pre>","type":"example","format":"html"},{"title":"Author","content":"lx_c","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A810%A3%A9%A1%AA%A1%AAHost+by+HEU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFFFD;&#xFFFD;10&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Host by HEU </a> ","type":"source","format":"html"}]}