{"title":"Bomberman - Just Search!","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3529","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3529&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3529","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3529"},"statement":[{"title":"Problem Description","content":"Bomberman has been a very popular game ever since it was released. As you can see above, the game is played in an N*M rectangular room. Bomberman can go around the room and place bombs. Bombs explode in 4 directions with radius r. To finish a stage, bomberman has to defeat all the foes with his bombs and find an exit behind one of the walls.<br>Since time is limited, bomberman has to do this job quite efficiently. Now he has successfully defeated all the foes, and is searching for the exit. It&apos;s really troublesome to destroy the walls one by one, so he&apos;s asking for your help to calculate the minimal number of bombs he has to place in order to destroy all the walls, thus he can surely find the exit.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/3529-1.jpg\"></center>","type":"description","format":"html"},{"title":"Input","content":"The input contains several cases. Each case begins with two integers: N and M(4 &lt;= N, M &lt;= 15). N lines follow, each contains M characters, describing the room. A &apos;*&apos; means a concrete wall which can never be destroyed, a &apos;#&apos; is an ordinary wall that can be destroyed by a single bomb, a &apos;.&apos; is an empty space where bombs can only be placed. There&apos;re at most 30 ordinary walls. The borders of the room is always surrounded by concrete walls, as you can see from the samples. You may assume that the explosion radius r is infinite, so that an explosion can reach as far as possible until it meets a wall and destroys it if it&apos;s an ordinary one. Proceed until the end of file.","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output the minimal number of bombs that should be placed to destroy all the ordinary walls. Note that two bombs can&apos;t be placed at the same position and all bombs explode simultaneously, which makes the result for the second sample to be 3 instead of 2. You may assume that there&apos;s always a solution.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9 11\n***********\n*#.#...#.#*\n*.*.*.*.*.*\n*.........*\n*.*.*.*.*.*\n*....#....*\n*.*.*.*.*.*\n*....#....*\n***********\n3 13\n*************\n*..##...##..*\n*************</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A810%A3%A9%A1%AA%A1%AAHost+by+HEU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;10&#xFF09;&#x2014;&#x2014;Host by HEU </a> ","type":"source","format":"html"}]}