{"title":"Escape","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3533","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3533&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3533","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3533"},"statement":[{"title":"Problem Description","content":"The students of the HEU are maneuvering for their military training.<br>The red army and the blue army are at war today. The blue army finds that Little A is the spy of the red army, so Little A has to escape from the headquarters of the blue army to that of the red army. The battle field is a rectangle of size m*n, and the headquarters of the blue army and the red army are placed at (0, 0) and (m, n), respectively, which means that Little A will go from (0, 0) to (m, n). The picture below denotes the shape of the battle field and the notation of directions that we will use later.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/3533-1.jpg\"></center> <br><br>The blue army is eager to revenge, so it tries its best to kill Little A during his escape. The blue army places many castles, which will shoot to a fixed direction periodically. It costs Little A one unit of energy per second, whether he moves or not. If he uses up all his energy or gets shot at sometime, then he fails. Little A can move north, south, east or west, one unit per second. Note he may stay at times in order not to be shot.<br>To simplify the problem, let&#x2019;s assume that Little A cannot stop in the middle of a second. He will neither get shot nor block the bullet during his move, which means that a bullet can only kill Little A at positions with integer coordinates. Consider the example below. The bullet moves from (0, 3) to (0, 0) at the speed of 3 units per second, and Little A moves from (0, 0) to (0, 1) at the speed of 1 unit per second. Then Little A is not killed. But if the bullet moves 2 units per second in the above example, Little A will be killed at (0, 1).<br>Now, please tell Little A whether he can escape.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"For every test case, the first line has four integers, m, n, k and d (2&lt;=m, n&lt;=100, 0&lt;=k&lt;=100, m+ n&lt;=d&lt;=1000). m and n are the size of the battle ground, k is the number of castles and d is the units of energy Little A initially has. The next k lines describe the castles each. Each line contains a character c and four integers, t, v, x and y. Here c is &#x2018;N&#x2019;, &#x2018;S&#x2019;, &#x2018;E&#x2019; or &#x2018;W&#x2019; giving the direction to which the castle shoots, t is the period, v is the velocity of the bullets shot (i.e. units passed per second), and (x, y) is the location of the castle. Here we suppose that if a castle is shot by other castles, it will block others&#x2019; shots but will NOT be destroyed. And two bullets will pass each other without affecting their directions and velocities.<br>All castles begin to shoot when Little A starts to escape.<br>Proceed to the end of file.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"If Little A can escape, print the minimum time required in seconds on a single line. Otherwise print &#x201C;Bad luck!&#x201D; without quotes.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 4 3 10\nN 1 1 1 1\nW 1 1 3 2\nW 2 1 2 4\n4 4 3 10\nN 1 1 1 1\nW 1 1 3 2\nW 1 1 2 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9\nBad luck!</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A810%A3%A9%A1%AA%A1%AAHost+by+HEU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;10&#xFF09;&#x2014;&#x2014;Host by HEU </a> ","type":"source","format":"html","require":["katex"]}]}