{"title":"Interesting Tour","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3562","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3562&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3562","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3562"},"statement":[{"title":"Problem Description","content":"Wuhan University is one of the most beautiful universities in China, and there are many charming scenic spots in the campus. After observing for several years, iSea find an interesting phenomenon of those spots: many old spots were built organically and not according to some architecture plan, but, strangely, their growth exhibits a similar pattern: the cities started from three points of spots, with each pair being connected by a bidirectional street; then, gradually, new points of spots were added. Any new point of spot was connected by two new bidirectional streets to two different previous points of spots which were already directly connected by a street. <br><br>A tourist visiting our university would like to do a tour visiting as many points of spots as possible. The tour can start at any point of spot and must end at the same point of spot. The tour may visit each street at most once and each point of spot at most once except the first point of spot. <br><br>Searing in the library, iSea have known how the scenic spots grew. Now he want to find the largest number of different points of spots a single tour can visit.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases in the input.<br><br>The first line of each case contains three integers N (3 &lt; N &lt;= 1000), indicating the total number of spots. <br>The next N-3 lines each contain a pair of space-separated integers A, B, indicating that the corresponding point of interest was connected by streets to points A and B. And you can assume both A and B had already connected.<br><br>The input terminates by end of file marker.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one integer, indicating the largest number of different points of spots a single tour can visit.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n1 2\n5\n1 2\n1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n4</div></pre>","type":"example","format":"html"},{"title":"Author","content":"iSea@WHU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A812%A3%A9%A1%AA%A1%AAHost+by+WHU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;12&#xFF09;&#x2014;&#x2014;Host by WHU </a> ","type":"source","format":"html"}]}