{"title":"A Puzzle Game","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3582","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3582&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3582","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3582"},"statement":[{"title":"Problem Description","content":"Tower of the Sorcerer is a cross between a puzzle game and an RPG. <br>The story is saving the princess who was locked in the magic tower; it is the such story as you have heard the other day. But the fact is that this story isn&apos;t related to this game at all. Why? You will know the reason when you play this game. As the content of this is RPG, there is the side like a puzzle. Please play this without hurry combining with training of brain.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C302-1001-1.jpg\"></center><br>To save the princess you must go up the floors. You fight the bad guys and get keys to open doors. You have a health meter and you can gold coins and experience to increase defensive power, offensive power, and health. The levels are not randomly generated so the game will be the same every time you play.<br>Is it a complex game? Let&#x2019;s take it easy. Imagining that you have met the princess and gone back to ground floor, your mission is going to the destination position of the maze on ground floor. This is a two-dimensional maze composed of square cells which may or may not be filled with rock. You can move north, south, east or west one cell at a step. You can move north, south, east or west one cell at a step. There are some locked doors (the number of them not more than 10). Maybe you could open some of them to go to the destination place. Luckily, many keys are hidden in the maze. These keys can open any doors, but each of them can be only used once.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains a single positive integer. This is the number of mazes that follow. Each maze description starts with a line containing one integer r (r &lt;= 10) representing the number of rows of the maze. The number of columns equals the number of rows of the maze<br>Following this are r lines each containing r characters. Each character describes one cell of the maze. A cell full of rock is indicated by a &apos;*&apos; and an empty cell is represented by a &apos;.&apos;. Your starting position is symbolized by &apos;S&apos;, the destination position by &apos;E&apos;, the position where is hidden a key by &apos;K&apos; and the position of the locked door by &apos;L&apos;.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each maze in the input, first print the number of the maze, as shown in the sample output. Then, if it is possible to go to the destination position, print &quot;Yes&quot;. Otherwise, output &quot;No&quot;","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2\n*E\n*S\n2\n*E\nS* \n3\nE..\n**L\nSK.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: Yes\nCase 2: No\nCase 3: Yes</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"shackler  (Special Thanks: Louty)","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A814%A3%A9%A1%AA%A1%AAHost+by+BJTU&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;14&#xFF09;&#x2014;&#x2014;Host by BJTU </a> ","type":"source","format":"html","require":["katex"]}]}