{"title":"Age of the Great Voyages","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3612","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3612&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3612","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3612"},"statement":[{"title":"Problem Description","content":"<i>&quot;Age of the Great Voyages&quot;, which is also called &quot;Uncharted Waters&quot;, is an old PC-game telling an interesting story in the period between the 15-th century and the 17-th century, when European explorers sailed the seas to open new alternative ways to Asia when the Ottoman Empire blocked the land routes. <br><br>The story evolves on the search of the seven &quot;Proof of the Conqueror&quot;, which are seven ancient artifacts, in seven areas around the world (Northern Europe, Mediterranean, Africa, New World, Indian Ocean, South Asia and East Asia). It is said that having these proofs proves that the sailor is the champion of all sailors. Four sailors unwittingly involved in the struggle of the quest of the search of the Proof of the Conqueror. <br><br>- from wikipedia<br></i><br>Li Huamei, an Admiral of Ming Dynasty, is one of the four protagonists in the story. She trys to find the &quot;Proof of the Conqueror&quot; for the revitalization of the motherland. One person&apos;s power is limited, so she searches for like-minded people to help her. <br><br>When Li&apos;s fleet voyages to the New World, she meets an intelligent man - Fernandes and invite him to become a member of the fleet as a staff officer. While Fernandes is a strange man, he requires that he will join only if Li can win in the following game: <br><br>At the beginning, there are N piles of coins on the desk, the i-th pile has P<sub>i</sub> coins. Then Fernandes and Li take turns to take coins from those piles on the desk according to the following rule: when it is someone&apos;s turn to take coins, at first, he/she has to select no more than K (and no less than 1) piles that still have coins arbitrarily, then take arbitrary number (at least 1) of coins from each piles he/she selects. The game is over until all coins are taken, and the winer is the person who takes the last coin. <br><br>Fernandes is very familiar with this game, and Li is also very clever. So you can assume that both of them know the best strategy to win the game. Now we know the situation at the beginning, and that Fernandes takes coins first. The question is who will win the game? <br><br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input is a single integer T, representing the number of test cases. Then the description of these T test cases follows. <br><br>The first line of each test cases has two integers: N and K, and in the second line there are N positive integers P<sub>1</sub>, P<sub>2</sub>, ..., P<sub>N</sub> givin the number of coins in each pile at the beginning. <br><br>1 &#x2264; N &#x2264; 10000 <br>0 &#x2264; P<sub>i</sub> &#x2264; 2147483647 <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, if Fernandes can win the game, output &quot;Fernandes wins&quot;; otherwise output &quot;Li wins&quot; in a single line. <br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n15 4\n1 1 1 1 1 1 1 1 1 1 1 1 1 1 1\n3 1\n4 12 8\n3 2\n23 12 8</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Li wins\nLi wins\nFernandes wins</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+ACM-ICPC+Multi-University+Training+Contest%A3%A818%A3%A9%A1%AA%A1%AAHost+by+TJU+&amp;source=1&amp;searchmode=source\"> 2010 ACM-ICPC Multi-University Training Contest&#xFF08;18&#xFF09;&#x2014;&#x2014;Host by TJU  </a> ","type":"source","format":"html"}]}