{"title":"Area K","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3621","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3621&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3621","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3621"},"statement":[{"title":"Problem Description","content":"You, and a group of other scientists, have recently discovered strange gravity anomalies on the planet Alderaan. Further analysis shows that the gravity anomalies are caused by some asteroids floating in orbit. The strange positioning of the asteroids notwithstanding, all scientists except you had decided that this is not a matter worthy of attention and departed to continue research on other places. On the other hand, you believe with pure heart that this is not merely a random event, and landed on the surface of Alderaan to continue your study.<br>After doing some scanning, you have recorded the positions of all asteroids on your navigation computer as points in a three-dimensional Cartesian system. Interestingly, the data shown by your scanning system indicates that there is some sort of force field around each asteroid &#xFFFD;C more precisely, the shape of every asteroid&#xFFFD;&#xFFFD;s force field is a regular hexahedron whose every face is perpendicular to one of the axis of the coordinate system, which further confirmed your belief that there is something serious going on here. To find out the source of all these, you have decided to do a series of research on the planet. <br>The first research you have decided to conduct is to get the area of surface on the ground covered by exactly K asteroids&#xFFFD;&#xFFFD; force field. For simplicity, you can view the surface of Alderaan as the plane Z = 0.<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases in the input file. Each test case starts with one integer N (1 &lt;= N &lt;= 10<sup>4</sup>), the number of asteroids in orbit. Each of the next N lines consists of four integers X, Y, Z and L (-106&lt;= X, Y &lt;= 10<sup>6</sup>, 0 &lt; Z, L &lt;= 10<sup>6</sup>), describing the position of an asteroid and its edge length of the force field. The asteroid is just at the center of the hexahedron. The last part of each test case consists of one integer K (1 &lt;= K &lt;= N) followed by a blank line, meaning that you need to get the sum of areas on the ground affected by exactly K asteroids&#xFFFD;&#xFFFD; force fields.<br>There is a blank line between two successive test cases. A single line with N = 0 indicates the end of input file.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one real number on one separate line, the total area of surface covered by exactly K asteroids, in the format as indicated in the sample output. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 0 1 2\n0 1 1 2\n1\n\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 6.000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Regional+Tianjin+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Regional Tianjin Site &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; Online Contest </a> ","type":"source","format":"html"}]}