{"title":"HeavenHelix","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3628","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3628&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3628","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3628"},"statement":[{"title":"Problem Description","content":"It&apos;s said that MJ was invited to perform for the God. Unfortunately, God was intoxicated in the excellent voice and the moonwalk of MJ. The second day, God said, &quot;Let there be MJ and there was MJ.&quot; So MJ stayed, leaving his poor fans&apos; hearts broken ... (Sounds unrealistic.)<br>However, when the third day passed, MJ missed his Neverland so much. His soulful songs conveyed the sorrow to the God. So God built a new Neverland in the Heaven on the forth day. It is said that there is a Roller Coaster called HeavenHelix in the new Neverland. It is so huge that the train seemed to be just a point. The train does uniform circular motion on horizontal plane&#xFF08;The radius is r&#xFF0C;and the angular speed is &#x3C9; rad/s&#xFF09;&#xFF0C;while it does uniform liner motion in vertical direction&#xFF08;The speed is v m/s&#xFF09;from the top to the bottom. To monitor the train, there is a camera installed on the bottom, where the center of the circle is located. The amount of energy the camera consumes is up to the distance between the train and itself: Assuming the distance is D meters, and in the very moment it travels ds meters, the camera should consume X*D*ds kJ energy from the God. When the Neverland was built, God distributed E kJ energy to the camera initially. God had calculated accurately to make sure that the train will be exactly on the bottom, as soon as the energy is used up. MJ wanted to know how long he can enjoy himself riding the HeavenHelix the sky. Can you help him?","type":"description","format":"html"},{"title":"Input","content":"There are multiple cases. In each case, there will be only one line, containing five integers, r,&#x3C9;, v, X and E (r&#x2265;0, &#x3C9;&#x2265;0, v &gt; 0, X &gt; 0, E&#x2265;0), which have the same meaning mentioned above. All the numbers are smaller than 2<sup>31</sup>. The input will be terminated by five zero, which were not need to be proceeded. There is a correct answer for each case.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output the total time of the train ran before its stop in a single line. Present the answer in seconds, and accurate to 4 decimal places. You may assume that MJ can ride the HeavenHelix for at most 30 days.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 1 2 2 2\n0 0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.4062</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Regional+Tianjin+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Regional Tianjin Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html"}]}