{"title":"Code Management System","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3645","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3645&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3645","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3645"},"statement":[{"title":"Problem Description","content":"Jack&#x2019;s company has a very long program to modify. Each programmer edits some lines of that program and cannot add or delete any lines. A programmer can do three kinds of operations as below: <br><br>- SYNC: At the beginning, every programmer must do this to download the whole program from the code center to their local machine. This operation only executes once for each programmer.<br><br>-  MODIFY: Modify a line of the code. The modification work will be temporarily done on the local computer. <br><br>-  SUBMIT: Submit one&#x2019;s whole local code to the code center. The code center will handle all possible changes and then send the whole newest program back to the submitter. We assume that the time duration of handling changes and sending back can be omitted. <br><br>The code center records the time and the performer of every operation. <br>As you see, a programmer can get the program from the code center only when he performs a SYNC or a SUBMIT operation. We call the version in the code center &#x201C;standard version.&#x201D; The code center keeps only ONE standard version.<br><br>Imagining there are two programmers who download the same version of the program and they both modify the ith line. Then they both submit their programs. Now what will the ith line be in the standard version? Jack figures out a rule. He gives each programmer a unique priority. When a programmer (Let&#x2019;s name him Tom) modifies the ith line and then submit his program, the code center will handle the content of the ith line following the rules below:<br><br><br>1.  If there was no accepted modification on the ith line before, Tom&#x2019;s modification will be accepted. That means, the ith line in the standard version becomes the same as the ith line in the program submitted by Tom, and so Tom becomes the author of this line.<br>2.  Otherwise, if the time of the last accepted modification on the ith line, is earlier than the time when Tom got the program from code center last time (Tom can get the program by SYNC or SUBMIT operation), Tom&#x2019;s modification will be accepted. This situation means that there was no newly accepted modification on the ith line during the time from the ith line&#x2019;s last accepted modification to Tom&#x2019;s submission.<br>3.  Otherwise, if Tom&#x2019;s priority is higher than the priority of the last author of the ith line, Tom&#x2019;s modification will be accepted.<br>4.  In other cases, Tom&#x2019;s modification on the ith line this time will be ignored and never be processed again.<br>5.  If Tom&#x2019;s modification was accepted, the code center would record the modification time of the ith line as the time when Tom&#x2019;s SUBMIT operation happened. <br><br>Please note that a programmer can modify multiple lines before he submits, and his modification on some lines may be accepted, but on the other lines may be ignored.<br><br>For example, Alice and Bob are two programmers. Alice&#x2019;s priority is 1 and Bob&#x2019;s is 2(2 is higher than 1). In following case A and B, Bob&#x2019;s modification on the first line will be accepted. However, Alice&#x2019;s modification will be ignored in Case C but will be accepted in Case D.<br><br><br>Case A<br>[2010/07/18 12:00:00] Alice SYNC<br>[2010/07/18 12:00:01] Bob SYNC<br>Alice and Bob are editing the first line.<br>[2010/07/18 12:05:00] Alice SUBMIT<br>[2010/07/18 12:06:00] Bob SUBMIT<br><br><br>Case B<br>[2010/07/18 12:00:00] Alice SYNC<br>Alice is editing the first line.<br>[2010/07/18 12:05:00] Alice SUBMIT<br>[2010/07/18 12:05:01] Bob SYNC<br>Bob is editing the first line<br>[2010/07/18 12:06:00] Bob SUBMIT<br><br>Case C<br>[2010/07/18 12:00:00] Alice SYNC<br>[2010/07/18 12:00:02]Bob SYNC<br>Alice and Bob are editing the first line.<br>[2010/07/18 12:05:00]Bob SUBMIT<br>[2010/07/1812:06:00]Alice SUBMIT<br><br>Case D<br>[2010/07/18 12:00:00] Bob SYNC<br>Bob is editing the first line.<br>[2010/07/18 12:05:00]Bob SUBMIT<br>[2010/07/18 12:05:01]Alice SYNC<br>Alice is editing the first line<br>[2010/07/18 12:06:00]Alice SUBMIT<br><br><br>You need to help Jack to figure out who is the last author of every code line in the final standard version of the program.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains several test cases.<br>For each test case, the first line contains an integer n (0&lt;n&lt;=10000), representing the number of programmers. The following lines contain their working details. <br><br>For each programmer, the first line contains a string and two integers pi and qi. The string represents his/her name, which only contains letters. The length of each name is less than 30. pi is his/her priority number and qi is the number of operations his/her has done. Each of the following qi lines contains a single operation. The format is as following:<br><br>&#x201C;[yyyy/mm/dd hh:mm:ss] OPERATION&#x201D;<br><br>There is a blank between day(dd) and hour(hh), as well as the right square bracket and OPERATION. The OPERATION has three formats: &#x201C;SYNC&#x201D;, &#x201C;MODIFY line_id&#x201D; and &#x201C;SUBMIT&#x201D;. The line_id was an integer representing the certain line number on which this modification happens. There is a blank between MODIFY and line_id. There is no extra blank.<br><br>The line numbers and priority numbers are integers from 0 to 231-1. The sum of all the qi is less than or equal to 50000. You can assume that all operations happen in different time.<br><br>The input file ends by a single 0 in a line.<br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, details of each modified line should show in a line. The format is as follows:<br><br>&#x201C;line_id [yyyy/mm/dd hh:mm:ss] BY name&#x201D;<br><br>The line_id is the certain line which has been modified. The date shows the time of its last accepted modification and name shows the author. There&#x2019;s a single white blank between line_id and the left bracket, as well as the day(dd) and hour(hh), the right bracket and &#x201C;BY&#x201D;, &#x201C;BY&#x201D; and name. Beside these, there&#x2019;s no spare white blank. <br><br>The lines are sorted increasingly by line_id. At the end of each test case, there is a single line contains a word &#x201C;END&#x201D;. <br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nAlice 1 3\n[2010/07/18 12:00:00] SYNC\n[2010/07/18 12:01:00] MODIFY 1\n[2010/07/18 12:05:00] SUBMIT\nBob 2 3\n[2010/07/18 12:00:01] SYNC\n[2010/07/18 12:01:30] MODIFY 1\n[2010/07/18 12:06:00] SUBMIT\n2\nAlice 1 3\n[2010/07/18 12:05:01] SYNC\n[2010/07/18 12:05:30] MODIFY 1\n[2010/07/18 12:06:00] SUBMIT\nBob 2 3\n[2010/07/18 12:00:01] SYNC\n[2010/07/18 12:01:30] MODIFY 1\n[2010/07/18 12:05:00] SUBMIT\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 [2010/07/18 12:06:00] BY Bob\nEND\n1 [2010/07/18 12:06:00] BY Alice\nEND\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nThe sample cases correspond to pervious Case A and Case D.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Regional+Hangzhou+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Regional Hangzhou Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html","require":["katex"]}]}