{"title":"Fate Stay Night","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3646","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3646&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3646","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3646"},"statement":[{"title":"Problem Description","content":"Jack was addicted to a fighting game recently. The game is similar to a famous anime &#x201C;Fate Stay Night&#x201D;. In the game, you should control your &#x201C;servant&#x201D; Saber to fight another &#x201C;servant&#x201D; Berserker. <br><br>Berserker is a famous hero who has a lot of lives. In every life, he has some &#x201C;blood points&#x201D;. For example, he may have 100 blood points in his first life and 200 blood points in his second life. When Berserker loss all blood points in a life, he is killed. But he will become alive immediately with next life. When there is no next life left, Berserker is really dead and you win.<br>Saber can attack Berserker for N times. During each attack, Saber releases a fire bird to fight Berserker. Each fire bird has some &#x201C;power points&#x201D;.<br>A fire bird can make Berserker loss blood points. But if Berserker loss one blood point, the fire bird also will loss one power point. When the power points of a fire bird become zero, the fire bird dies.<br>A living fire bird may be in two statuses:&#x201C;young&#x201D;or &#x201C;old&#x201D;.<br>When a fire bird is just released, it is &#x201C;young&#x201D;. After it kills Berserker once or more, it becomes&#x201C;old&#x201D;.<br>Let&#x2019;s suppose a fire bird with remaining n power points fighting Berserker with remaining m blood points in his current life:<br>If n&gt; m: Berserker will be killed and becomes alive immediately with his next life(if he has), and then the fire bird will be&#x201C;old&#x201D;and fight Berserker again with remaining n-m power points.<br><br>If n = m: Berserker will be killed and becomes alive with his next life (if he has), and the fire bird dies.<br><br>If n &lt; m: In this situation, if the fire bird is &#x201C;young&#x201D;, it will die after making Berserker loss n blood points. But if the fire bird is &#x201C;old&#x201D;, it just dies without doing any harm to Berserker.<br><br>As the &#x201C;Master&#x201D; of Saber, you can use &#x201C;Command Mantra&#x201D; M times. You can use &#x201C;Command Mantra&#x201D;to double a fire bird&#x2019;s power points, but you can&#x2019;t use &#x201C;Command Mantra&#x201D;more than once on a same fire bird. Now there is the question: How many times can you kill Berserker at most? <br><br>","type":"description","format":"html"},{"title":"Input","content":"There are several data cases, ended with &#x201C;0 0 0&#x201D;<br>For each test case:<br>The first line contains three integers N,M,K, meaning the number of attacks of Saber, the times of Command Mantra you can use and the number of lives of Berserker.<br>The second line contains N integers, indicating the power points of N fire birds, in the order of attacking. You can&#x2019;t change the attacking order.<br><br>The third line contains K integers, meaning the blood points of all Berserker&#x2019;s lives. The first integer is for his first life, the second integer is for his second life, etc. <br>Please note: 1&lt;=N&lt;=10000, 0&lt;=M&lt;=100, 0&lt;=K&lt;=100000. All power points and blood points are no more than 10000 and none negative. <br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing the maximum times that you can kill Berserker. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10 0 20\n8 9 8 7 5 7 5 5 0 2 \n3 0 2 1 7 1 5 5 7 0 6 1 5 6 7 3 1 0 5 8 \n10 1 0\n6 0 0 7 7 7 1 7 6 7\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">12\n0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Regional+Hangzhou+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Regional Hangzhou Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html"}]}