{"title":"Celestial Being","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3653","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3653&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3653","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3653"},"statement":[{"title":"Problem Description","content":"Celestial Being(CB) is a private military organization which is aimed to rid the wars and con icts in the world, using the advanced mobile suit gundam. But due to high cost of manufacture a gundam, only four gundams were produced, named Exia, Dynames, Kyrios and Virtue. Gundams use a kind of mysterious particles known as GN particle to communicate with each other, and GN particle always transport messages parallel to coordinate axises. Thus when in battle, four gundams always form a rectangle whose sides are parallel to x-axis or y-axis, and the coordinates of all gundams are integers. Have known celestial being is going to attack their military base, colonel of the enemy, Sergei Smirnov ordered to release some detectors to detect the positions of gundams when they arrive. The military base is a rectangle feld of with with corners (0, 0), (w, 0), (0, h) and (w, h). Each detector has a parameter d<br>and is either horizontal detector or vertical detector. A horizontal detector with parameter d can detect all positions on the lines y = h, where h is a multiple of d, while a vertical detector with parameter d can detect all positions on the lines x = v, where v is a multiple of d. If a position can be detected by k(k &gt; 0) or more detectors, a gundam on that position will be discovered by the enemy. Got the parameters of all detectors from spy, the tactical forecaster of celestial being, Sumeragi Lee wants too know how many conservative battle positions are there. Can you help her? A<br>conservative battle position is a combination of four distinct points with integer coordinates, each stands for a position of one gundam such that no gundam can be detected by k or more detectors, and the four points form a rectangle whose sides parallel to x-axis or y-axis. Note that change the positions of two gundams will result in a new battle positon.","type":"description","format":"html"},{"title":"Input","content":"Each test case begins with five integers w(1 &lt;= w &lt;= 10<sup>8</sup>), h(1 &lt;= h &lt;= 10<sup>8</sup>), m(0 &lt;= m &lt;= 20), n(0 &lt;= n &lt;= 20)<br>and k(k &gt;= 1) on the first line, m is the number of horizontal detectors and n is the number of vertical<br>detectors. Then m + n lines follows, the first m line are the parameters of horizontal detectors, and the<br>rest n lines are the parameters of vertical detectors. All parameters are positive integers.","type":"input_format","format":"html"},{"title":"Output","content":"Output one line for each test case, the number of conservative battle positions.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 1 0 0 1\n1 1 1 0 2\n2\n1 1 1 1 2\n2\n2\n5 3 1 1 1\n2\n2\n5 3 1 1 2\n2\n2\n5 3 1 1 3\n2\n2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">24\n24\n0\n72\n720\n2160</div></pre>","type":"example","format":"html"},{"title":"Author","content":"Cauchy (Special thanks WJH)","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Regional+Chengdu+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Regional Chengdu Site &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; Online Contest </a> ","type":"source","format":"html"}]}