{"title":"Ensure No Absence","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3655","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3655&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3655","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3655"},"statement":[{"title":"Problem Description","content":"In the year 2022, the scu acmers decide to hold a party, and most of the old scu acmers have recieved the invitation, including onmylove, tanlinghang, and zsasuke (the original members of the scu isap team).<br>As they graduated from scu ten years ago, they live in di\u000berent cities currently. They are all very arrogant, and each believes himself to be the best runner among all the scu acmers. To prove this, they all decide to spend days running to the destination (the city where the party is to be held), and to save energy, they each will choose the shortest route for himself(there may exist more than one shortest routes, in such cases, they would choose one of them at random). But this lead to a series of problems: they may stop to rest occasionally, and once they meet each other on one same road, they will stop running and begin to argue for days who is the best runner, entirely forgetting the party.<br>The scu leaders are all very considerate, they don&apos;t want the absence of anyone, so they will select a suitable city to hold the party to guarantee that the isap team members will not meet each other on their way to the party. But they are all very busy, so the task is assigned to you, brilliant icpcer!","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Process till EOF.<br>Each case contains two positive integers n,m(3 &#x2264; n &#x2264; 3000; 1 &#x2264; m &#x2264; 200000) in the \ffirst line. Indicating the number of cities to choose from, and the number of the edges (onmylove lives in city 1, tanlinghang lives in city 2, and zsasuke, city 3), then m lines follow, each line contains 3 positive integers a, b, c (1 &#x2264; a, b &#x2264; n; 1 &#x2264; c &#x2264; 10; b &#x2260;a, there is at most one edege between two distinct cities) indicating that it takes each of them(onmylove, tanlinghang, or zasuke) c days to get to city b from city a, or c days to get to city a from city b if running at full speed(from this, you know they all run at the same speed, so there is no point in arguing at all,but they are all very unreasonable!)","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, if there are no cities satisfying the conditions above, you should puts &quot;impossible&quot; in a single line,otherwise, you should print a number n(the number of cities satisfying the conditions) in a line, the second line contains n integers, meaning the ids of the cities satisfying the conditions, and besides,sort them in increasing order.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2\n1 2 1\n2 3 1\n4 3\n1 4 2\n2 4 1\n3 4 3\n5 5\n1 5 2\n4 5 2\n5 2 3\n2 4 5\n3 4 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\n1\n4\n1\n5\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In the \ffirst case, we could not choose city 3 to hold the party, since tanlinghang may rest on the road between 2 and 3, so onmylove may meet tanlinghang on the same road \nand fall into arguing. so we choose city 2 to hold the party.In the third case, we could not choose city 4 for the same reason. suppose we choose city 4, the shortest route for\nonmylove is 1-5-4, and the shortest route for tanlinghang is 2-5-4 or 2-4, if tanlinghang choose the route 2-5-4, he may meet onmylove on the road between 5 and 4, \nand arguing is inevitable.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"zsasuke","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Regional+Chengdu+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Regional Chengdu Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html","require":["katex"]}]}