{"title":"Naughty fairies","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3680","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3680&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3680","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3680"},"statement":[{"title":"Problem Description","content":"Once upon a time, there lived a kind of fairy in the world. Those fairies could hear the voice of fruit trees, and helped people with a harvest. But people didn&#x2019;t know that fruits are also those fairies&#x2019; favorite food. After the fairies ate people&#x2019;s fruits, they always did something to cover it up.<br><br>One day a little fairy named Lily flew into an orchard and found a large peach tree. Hungry as Lily was, she started eating without thinking until her stomach was full. In the fairy world, when a fairy ate the fruits in a fruit tree, sometimes the fruit tree would feel honored and bore more fruits immediately. That&#x2019;s why sometimes the number of fruits in a tree got increased after a fairy ate fruits of that tree.<br><br>But the fairies didn&#x2019;t want people to find out weird things such as fruits become more or less suddenly. Lily decided to use a magic spell so that the orchard owner couldn&#x2019;t find the change of the number of peaches.<br><br>Suppose there were N peaches on a tree originally and there were M peaches left after Lily was full. M may be greater than, less than or equal to N. All M peaches were visible at first, and Lily wanted to make an illusion so that exactly N peaches are visible.<br><br>Lily can do 3 kinds of spell to change the total visible number of peaches:<br><br>1) &#x201C;PAPADOLA&#x201D;&#xFF1A;This spell would increase the number of visible peaches by one.<br>2) &#x201C;EXPETO POTRONUM&#x201D;&#xFF1A;This spell would double the number of visible peaches.<br>3) &#x201C;SAVIDA LOHA&#x201D;:This spell would decrease the number of visible peaches by one.<br><br>Each spell would take one minute and Lily wanted to finish as fast as possible. Now please tell Lily the least time she needs to change the number of visible peaches to N.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases, ended by &#x201C;0 0&#x201D;.<br>For each test case, there are only one line containing two numbers separated by a blank, N and M, the original numbers of peaches and the numbers of peaches left(0&lt;N,M&lt;10<sup>500</sup>).There is no leading zero.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, you should output just a number K indicating the minimum time (in minutes) Lily needed to finish her illusion magic.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 2\n1 99\n86 32\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n98\n12</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2010 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}