{"title":"Searchlights","time_limit":2000,"memory_limit":320,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3688","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3688&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3688","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3688"},"statement":[{"title":"Problem Description","content":"There is a piece of grids land of size n&#xD7;m. Chandler and his team take responsibility to guard it. There are some searchlights on some pieces and each of them has a capability to lighten a distance towards four directions: north, south, east and west. Different searchlight has different lightening capability shown in levels. Searchlight with level k means that it can lighten k grids (including the gird that the searchlight stands in) along any of the four directions. Shown in following figure, there is a searchlight of level 3 and the shadow grids are ones that can be lightened by it. Particularly, searchlight of level 1 means that it can only lighten the grid in which the searchlight stands.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/3688-1.gif\"></center> <br>Each searchlight has a maximum level. You can decrease a searchlight&#x2019;s level to save the energy. A searchlight whose maximum level is k can be turned to level k, k-1, k-2, &#x2026;, 1 and 0. Level 0 means turning off the searchlight. <br><br>A grid is well-guarded if and only if <b>at least</b> one of the following two conditions is satisfied:<br>1.There is a searchlight in this grid, and it is not switched to level 0 (the light is on).<br>2.The grid is lightened by <b>at least</b> two searchlights. One lightens it in horizontal direction (east or west), and another lightens it in vertical direction (north or south).<br><br>Chandler asks you to help finding a solution that he can turn on some of the searchlights so that:<br>1.All the grids are well-guarded.<br>2.All the searchlights turned on are in a same level.<br>3.That same level mentioned above is as small as possible.<br>More specifically, if you choose a same level Q, then all the searchlights whose maximum level are less than Q have to be turned off. Please help him to find a solution with the minimum same level.<br>","type":"description","format":"html"},{"title":"Input","content":"The input file contains several test cases. <br><br>For each test case, the first line is two integers n and m, representing a grids land of size n&#xD7;m. (0&lt;n&lt;=100, 0&lt;m&lt;=10000). Following n lines describe an n&#xD7;m matrix in which a<sub>i,j</sub> means the maximum level of the searchlight in grid (i, j). a<sub>i,j</sub> can be zero, which means there is no searchlight on that grid. For all the cases, a<sub>i, j</sub>&lt;=10000.<br><br>The input file ends with a line containing two zeros.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line with an integer, representing the minimum level you have found. If there is no such a solution, output &#x201C;NO ANSWER!&#x201D;","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2\n0 2\n3 0\n2 2\n0 2\n1 0\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nNO ANSWER!</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2010 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html"}]}