{"title":"Infinite monkey theorem","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3689","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3689&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3689","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3689"},"statement":[{"title":"Problem Description","content":"Could you imaging a monkey writing computer programs? Surely monkeys are smart among animals. But their limited intelligence is no match for our human beings. However, there is a theorem about monkeys, and it states that monkeys can write everything if given enough time.<br>The theorem is called &#x201C;Infinite monkey theorem&#x201D;. It states that a monkey hitting keys at random on a typewriter keyboard for an infinite amount of time will almost surely type any given text, which of course includes the programs you are about to write (All computer programs can be represented as text, right?).<br>It&#x2019;s very easy to prove this theorem. A little calculation will show you that if the monkey types for an infinite length of time the probability that the output contains a given text will approach 100%.<br>However, the time used is too long to be physically reasonable. The monkey will not be able to produce any useful programs even if it types until the death of the universe. To verify this and ensure that our human beings are not replaceable by monkeys, you are to calculate the probability that a monkey will get things right.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be several test cases.<br>Each test case begins with a line containing two integers n and m separated by a whitespace (2&lt;=n&lt;=26, 1&lt;=m&lt;=1000). n is the number of keys on the typewriter and the monkey will hit these keys m times. Thus the typewriter will finally produce an output of m characters.<br>The following n lines describe keys on the typewriter. Each line has a lower case letter and a real number separated by a whitespace. The letter indicates what the typewriter will produce if the monkey hits that key and the real number indicates the probability that the monkey will hit this key. Two hits of the monkey are independent of each other (Two different hits have the same probability for a same key), and sum of all the probabilities for each key is ensured to be 1.<br>The last line of the test case contains a word composed of lower case letters. The length of the word will be less than or equal to 10.<br>The input will end with a line of two zeros separated by a whitespace. This line should not be processed.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output one line containing the probability that the given word will appear in the typewriter&#x2019;s output. The output should be in percentage format and numbers should be rounded to two digits after the decimal point.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 10\nw 0.25\no 0.25\nr 0.25\nd 0.25\nword\n2 10\na 1.0\nb 0.0\nabc\n2 100\na 0.312345\nb 0.687655\nabab\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.73%\n0.00%\n98.54%</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2010 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}