{"title":"Nubulsa Expo","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3691","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3691&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3691","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3691"},"statement":[{"title":"Problem Description","content":"You may not hear about Nubulsa, an island country on the Pacific Ocean. Nubulsa is an undeveloped country and it is threatened by the rising of sea level. Scientists predict that Nubulsa will disappear by the year of 2012. Nubulsa government wants to host the 2011 Expo in their country so that even in the future, all the people in the world will remember that there was a country named &#xFFFD;&#xFFFD;Nubulsa&#xFFFD;&#xFFFD;.<br><br>As you know, the Expo garden is made up of many museums of different countries. In the Expo garden, there are a lot of bi-directional roads connecting those museums, and all museums are directly or indirectly connected with others. Each road has a tourist capacity which means the maximum number of people who can pass the road per second. <br><br>Because Nubulsa is not a rich country and the ticket checking machine is very expensive, the government decides that there must be only one entrance and one exit. The president has already chosen a museum as the entrance of the whole Expo garden, and it&#xFFFD;&#xFFFD;s the Expo chief directory Wuzula&#xFFFD;&#xFFFD;s job to choose a museum as the exit.<br><br>Wuzula has been to the Shanghai Expo, and he was frightened by the tremendous &#xFFFD;&#xFFFD;people mountain people sea&#xFFFD;&#xFFFD; there. He wants to control the number of people in his Expo garden. So Wuzula wants to find a suitable museum as the exit so that the &#xFFFD;&#xFFFD;max tourists flow&#xFFFD;&#xFFFD; of the Expo garden is the minimum. If the &#xFFFD;&#xFFFD;max tourist flow&#xFFFD;&#xFFFD; is W, it means that when the Expo garden comes to &#xFFFD;&#xFFFD;stable status&#xFFFD;&#xFFFD;, the number of tourists who enter the entrance per second is at most W. When the Expo garden is in &#xFFFD;&#xFFFD;stable status&#xFFFD;&#xFFFD;, it means that the number of people in the Expo garden remains unchanged.<br><br>Because there are only some posters in every museum, so Wuzula assume that all tourists just keep walking and even when they come to a museum, they just walk through, never stay.","type":"description","format":"html"},{"title":"Input","content":"There are several test cases, and the input ends with a line of &#xFFFD;&#xFFFD;0 0 0&#xFFFD;&#xFFFD;.<br><br>For each test case:<br><br>The first line contains three integers N, M and S, representing the number of the museums, the number of roads and the No. of the museum which is chosen as the entrance (all museums are numbered from 1 to N). For example, 5 5 1 means that there are 5 museums and 5 roads connecting them, and the No. 1 museum is the entrance.<br><br>The next M lines describe the roads. Each line contains three integers X, Y and K, representing the road connects museum X with museum Y directly and its tourist capacity is K.<br><br>Please note:<br><br>1&lt;N&lt;=300, 0&lt;M&lt;=50000, 0&lt;S,X,Y&lt;=N, 0&lt;K&lt;=1000000","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a line with only an integer W, representing the &#xFFFD;&#xFFFD;max tourist flow&#xFFFD;&#xFFFD; of the Expo garden if Wuzula makes the right choice.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 5 1\n1 2 5\n2 4 6\n1 3 7\n3 4 3\n5 1 10\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Fuzhou+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Fuzhou Regional Contest </a> ","type":"source","format":"html"}]}