{"title":"Let the light guide us","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3698","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3698&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3698","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3698"},"statement":[{"title":"Problem Description","content":"Plain of despair was once an ancient battlefield where those brave spirits had rested in peace for thousands of years. Actually no one dare step into this sacred land until the rumor that &#x201C;there is a huge gold mine underneath the plain&#x201D; started to spread. <br><br>Recently an accident destroyed the eternal tranquility. Some greedy fools tried using powerful bombs to find the hidden treasure. Of course they failed and such behavior enraged those spirits--the consequence is that all the human villages nearby are haunted by ghosts.<br><br>In order to stop those ghosts as soon as possible, Panda the Archmage and Facer the great architect figure out a nice plan. Since the plain can be represented as grids of N rows and M columns, the plan is that we choose ONLY ONE cell in EACH ROW to build a magic tower so that each tower can use holy light to protect the entire ROW, and finally the whole plain can be covered and all spirits can rest in peace again. It will cost different time to build up a magic tower in different cells. The target is to minimize the total time of building all N towers, one in each row.<br><br>&#x201C;Ah, we might have some difficulties.&#x201D; said Panda, &#x201C;In order to control the towers correctly, we must guarantee that every two towers in two consecutive rows share a common magic area.&#x201D;<br><br>&#x201C;What?&#x201D;<br><br>&#x201C;Specifically, if we build a tower in cell (i,j) and another tower in cell (i+1,k), then we shall have |j-k|&#x2264;f(i,j)+f(i+1,k). Here, f(i,j) means the scale of magic flow in cell (i,j).&#x201D;<br><br>&#x201C;How?&#x201D;<br><br>&#x201C;Ur, I forgot that you cannot sense the magic power. Here is a map which shows the scale of magic flows in each cell. And remember that the constraint holds for every two consecutive rows.&#x201D;<br><br>&#x201C;Understood.&#x201D;<br><br>&#x201C;Excellent! Let&#x2019;s get started!&#x201D;<br><br>Would you mind helping them?<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. <br><br>Each test case starts with a line containing 2 integers N and M (2&lt;=N&lt;=100,1&lt;=M&lt;=5000), representing that the plain consists N rows and M columns.<br><br>The following N lines contain M integers each, forming a matrix T of N&#xD7;M. The j-th element in row i (Tij) represents the time cost of building a magic tower in cell (i, j). (0&lt;=Tij&lt;=100000&#xFF09;<br><br>The following N lines contain M integers each, forming a matrix F of N&#xD7;M. The j-th element in row i (Fij) represents the scale of magic flows in cell (i, j). (0&lt;=Fij&lt;=100000&#xFF09;<br><br>For each test case, there is always a solution satisfying the constraints.<br><br>The input ends with a test case of N=0 and M=0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a line with a single integer, which is the minimum time cost to finish all magic towers.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 5\n9 5 3 8 7\n8 2 6 8 9\n1 9 7 8 6\n0 1 0 1 2\n1 0 2 1 1\n0 2 1 0 2\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Fuzhou+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Fuzhou Regional Contest </a> ","type":"source","format":"html"}]}