{"title":"Error Curves","time_limit":2000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3714","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3714&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3714","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3714"},"statement":[{"title":"Problem Description","content":"Josephina is a clever girl and addicted to Machine Learning recently. She<br>pays much attention to a method called Linear Discriminant Analysis, which<br>has many interesting properties.<br>In order to test the algorithm&apos;s efficiency, she collects many datasets.<br>What&apos;s more, each data is divided into two parts: training data and test<br>data. She gets the parameters of the model on training data and test the<br>model on test data. To her surprise, she finds each dataset&apos;s test error curve is just a parabolic curve. A parabolic curve corresponds to a quadratic function. In mathematics, a quadratic function is a polynomial function of the form f(x) = ax2 + bx + c. The quadratic will degrade to linear function if a = 0.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/3714-1.jpg\"></center><br><br>It&apos;s very easy to calculate the minimal error if there is only one test error curve. However, there are several datasets, which means Josephina will obtain many parabolic curves. Josephina wants to get the tuned parameters that make the best performance on all datasets. So she should take all error curves into account, i.e., she has to deal with many quadric functions and make a new error definition to represent the total error. Now, she focuses on the following new function&apos;s minimum which related to multiple quadric functions. The new function F(x) is defined as follows: F(x) = max(Si(x)), i = 1...n. The domain of x is [0, 1000]. Si(x) is a quadric function. Josephina wonders the minimum of F(x). Unfortunately, it&apos;s too hard for her to solve this problem. As a super programmer, can you help her?","type":"description","format":"html"},{"title":"Input","content":"The input contains multiple test cases. The first line is the number of cases T (T &lt; 100). Each case begins with a number n (n &#xFFFD;&#xFFFD; 10000). Following n lines, each line contains three integers a (0 &#xFFFD;&#xFFFD; a &#xFFFD;&#xFFFD; 100), b (|b| &#xFFFD;&#xFFFD; 5000), c (|c| &#xFFFD;&#xFFFD; 5000), which mean the corresponding coefficients of a quadratic function.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the answer in a line. Round to 4 digits after the decimal point.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n2 0 0\n2\n2 0 0\n2 -4 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.0000\n0.5000</div></pre>","type":"example","format":"html"},{"title":"Author","content":"LIN, Yue","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Chengdu+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Chengdu Regional Contest </a> ","type":"source","format":"html"}]}