{"title":"Rescue","time_limit":3000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3717","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3717&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3717","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3717"},"statement":[{"title":"Problem Description","content":"The princess is trapped in a magic place. In this place, there are N magic stones. In order to rescue the princess, you should destroy all the stones. The N stones are in a straight line. We number them as s1, s2, ... sn from left to right. Each stone has a magic strength m<sub>1</sub>, m<sub>2</sub>, ... m<sub>n</sub>. You have a powerful skill that can do some damage to the stones. To release the skill, you should stand to the right of some stone (s<sub>i</sub>). Then you throw a power ball towards left. Initially, this ball has a power of p. When it hits a stone, it will do some damage to the stone and its power will be decreased, and the ball will continue to fly left to the next stone if its power is still positive. Formally, if you stand to the right of s<sub>i</sub> and the power ball&apos;s initial power is p, then the ball will do Max(0, p - (i - j) * (i - j)) damage to sj, for each j &lt;= i. So from this formula, we can see that the damage to stone sj is only determined by the initial power of the ball and the number of stones between s<sub>i</sub> and s<sub>j</sub>. A stone is destroyed if the damage you do is larger than its magic strength. Note that even if a stone is destroyed, it will not disappear; your magic ball will do damage to it and the power will be decreased by that stone. You are not strong enough so that you can release at most k magic balls. It will cost a lot of energy if the power of the magic ball is too high. So what is the minimum value of p with which you can destroy all the magic stones, with no more than k magic balls? You can choose where to release each magic ball as your will, and the power of the ball must be a positive integer.","type":"description","format":"html"},{"title":"Input","content":"The first line is the number of cases T (T &#xFFFD;&#xFFFD; 100). For each case, the first line gives two integers n, k (1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 50000, 1 &#xFFFD;&#xFFFD; k &#xFFFD;&#xFFFD; 100000). The second line are n integers, giving m<sub>1</sub>, m<sub>2</sub>, ... m<sub>n</sub> (1 &#xFFFD;&#xFFFD; m<sub> </sub> &#xFFFD;&#xFFFD; 10<sup>9</sup>).","type":"input_format","format":"html"},{"title":"Output","content":"Print minimum possible p in a line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 1\n1\n3 1\n1 4 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6</div></pre>","type":"example","format":"html"},{"title":"Author","content":"HANG, Hang","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Chengdu+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Chengdu Regional Contest </a> ","type":"source","format":"html"}]}