{"title":"Similarity","time_limit":2000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3718","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3718&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3718","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3718"},"statement":[{"title":"Problem Description","content":"When we were children, we were always asked to do the classification homework. For example, we were given words {Tiger, Panda, Potato, Dog, Tomato, Pea, Apple, Pear, Orange, Mango} and we were required to classify these words into three groups. As you know, the correct classification was {Tiger, Panda, Dog}, {Potato, Tomato, Pea} and {Apple, Pear, Orange, Mango}. We can represent this classification with a mapping sequence{A,A,B,A,B,B,C,C,C,C}, and it means Tiger, Panda, Dog belong to group A, Potato, Tomato, Pea are in the group B, and Apple, Pear, Orange, Mango are in the group C.<br>But the LABEL of group doesn&apos;t make sense and the LABEL is just used to indicate different groups. So the representations {P,P,O,P,O,O,Q,Q,Q,Q} and {E,E,F,E,F,F,W,W,W,W} are equivalent to the original mapping sequence. However, the representations {A,A,A,A,B,B,C,C,C,C} and<br>{D,D,D,D,D,D,G,G,G,G} are not equivalent.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/3718-1.jpg\"></center><br><br>The pupils in class submit their mapping sequences and the teacher should read and grade the homework. The teacher grades the homework by calculating the maximum similarity between pupils&apos; mapping sequences and the answer sequence. The definition of similarity is as follow. <br><br>Similarity(S, T) = sum(S<sub>i</sub> == T<sub>i</sub>) / L <br>L = Length(S) = Length(T), i = 1, 2,... L,<br>where sum(S<sub>i</sub> == T<sub>i</sub>) indicates the total number of equal labels in corresponding positions. The maximum similarity means the maximum similarities between S and all equivalent sequences of T, where S is the answer and fixed. Now given all sequences submitted by pupils and the answer sequence, you should calculate the sequences&apos; maximum similarity.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains multiple test cases. The first line is the total number of cases T (T &lt; 15). The following are T blocks. Each block indicates a case. A case begins with three numbers n (0 &lt; n &lt; 10000), k (0 &lt; k &lt; 27), m (0 &lt; m &lt; 30), which are the total number of objects, groups, and students in the class. The next line consists of n labels and each label is in the range [A...Z]. You can assume that the number of different labels in the sequence is exactly k. This sequence represents the answer. The following are m lines, each line contains n labels and each label also is in the range [A...Z]. These m lines represent the m pupils&apos; answer sequences. You can assume that the number of different labels in each sequence doesn&apos;t exceed k.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output m lines, each line is a floating number (Round to 4 digits after the decimal point). You should output the m answers in the order of the sequences appearance.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n10 3 3\nA A B A B B C C C C\nF F E F E E D D D D\nX X X Y Y Y Y Z Z Z\nS T R S T R S T R S\n3 2 2\nA B A\nC D C\nF F E</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1.0000\n0.7000\n0.5000\n1.0000\n0.6667</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"LIN, Yue","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Chengdu+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Chengdu Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}