{"title":"Encoded Barcodes","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3724","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3724&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3724","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3724"},"statement":[{"title":"Problem Description","content":"All the big malls need a powerful system for the products retrieval. Now you are employed design a sub-system: reading the barcodes and return the matching products.<br><br>A barcode is an optical machine-readable representation of data, which shows certain data on certain products. A barcode consists of a series of bars with different widths. In our system, the barcodes have been scanned and the widths have been recorded. Every consecutive eight bars are considered as representing the ASCII code of a character, each bar for each bit. Ideally, there should be only two kinds of widths in the eight bars, and the width of the wider bar is twice of the narrower. The wider bar indicates 1, while the narrower indicates 0. However, due to the inaccuracy of printing and scanning, there will be an error of at most 5%. That is, if the pretended exact width is x, you may get a value in the range [0.95x, 1.05x].<br><br>For example, the width sequence &quot;10.0 20.0 10.0 10.0 10.0 10.0 10.0 20.0&quot; is a valid barcode of our system, and it means (01000001)<sub>2</sub>, which is (65)<sub>10</sub> and the corresponding character is &quot;A&quot;. Note that &quot;10.5 20.1 10.1 10.2 9.9 9.7 10.0 19.9&quot; is also a valid barcode representing the same letter.<br><br>You are given the names of all the products and many queries. Every name contains lower-case letters only, and the length is no more than 30. The queries are represented as barcodes. For each query, you should decode it to a string S, and report the amount of products whose prefix is S. For the output may be very large, you only need to output the sum of all the queries for each case.<br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases in the input. The first line of each case contains two integers N and M (1 &lt;= N &lt;= 10000, 1 &lt;= M &lt;= 2000), indicating the number of products and queries. Then N lines follow, indicating the names of the products. Note that the names may be duplicated. Then M query blocks follow. The first line of each query block is an integer K (0 &lt; K &lt;= 30) indicating the length of the query, then K lines follow, each line contains 8 positive float numbers, indicating the barcode for each character.<br><br>You can assume that the barcodes are always valid, and always represent lower-case letters.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output one line for each test case, indicating the sum of all the query results as described above.<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3\napple\napple\navatar\nbook\n1\n1 2 2 1 1 1 1 2\n2\n1 2 2 1 1 1 1 2\n10.1 20.1 19.9 20.0 10.2 9.8 9.9 10.0\n1\n1 2 2 1 1 1 2 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>There is only one test case. The first query is &quot;a&quot;, and the answer is 3. The second query is &quot;ap&quot;, and the answer is 2. The third query is &quot;c&quot;, and the answer is 0. So the total sum is 3+2+0 = 5.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Tianjin+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Tianjin Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}