{"title":"Graph and Queries","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3726","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3726&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3726","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3726"},"statement":[{"title":"Problem Description","content":"You are given an undirected graph with N vertexes and M edges. Every vertex in this graph has an integer value assigned to it at the beginning. You&apos;re also given a sequence of operations and you need to process them as requested. Here&apos;s a list of the possible operations that you might encounter:<br>1)&#xA0;&#xA0;Deletes an edge from the graph.<br>The format is [D X], where X is an integer from 1 to M, indicating the ID of the edge that you should delete. It is guaranteed that no edge will be deleted more than once.<br>2)&#xA0;&#xA0;Queries the weight of the vertex with K-th maximum value among all vertexes currently connected with vertex X (including X itself).<br>The format is [Q X K], where X is an integer from 1 to N, indicating the id of the vertex, and you may assume that K will always fit into a 32-bit signed integer. In case K is illegal, the value for that query will be considered as undefined, and you should return 0 as the answer to that query.<br>3)&#xA0;&#xA0;Changes the weight of a vertex.<br>The format is [C X V], where X is an integer from 1 to N, and V is an integer within the range [-10<sup>6</sup>, 10<sup>6</sup>].<br><br>The operations end with one single character, E, which indicates that the current case has ended.<br>For simplicity, you only need to output one real number - the average answer of all queries.<br><br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases in the input file. Each case starts with two integers N and M (1 &lt;= N &lt;= 2 * 10<sup>4</sup>, 0 &lt;= M &lt;= 6 * 10<sup>4</sup>), the number of vertexes in the graph. The next N lines describes the initial weight of each vertex (-106 &lt;= weight[i] &lt;= 10<sup>6</sup>). The next part of each test case describes the edges in the graph at the beginning. Vertexes are numbered from 1 to N. The last part of each test case describes the operations to be performed on the graph. It is guaranteed that the number of query operations [Q X K] in each case will be in the range [1, 2 * 10<sup>5</sup>], and there will be no more than 2 * 10<sup>5</sup> operations that change the values of the vertexes [C X V].<br><br>There will be a blank line between two successive cases. A case with N = 0, M = 0 indicates the end of the input file and this case should not be processed by your program.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one real number &#xFFFD;C the average answer of all queries, in the format as indicated in the sample output. Please note that the result is rounded to six decimal places.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n10\n20\n30\n1 2\n2 3\n1 3\nD 3\nQ 1 2\nQ 2 1\nD 2\nQ 3 2\nC 1 50\nQ 1 1\nE\n\n3 3\n10\n20\n20\n1 2\n2 3\n1 3\nQ 1 1\nQ 1 2\nQ 1 3\nE\n\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 25.000000\nCase 2: 16.666667\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>For the first sample:\nD 3 -- deletes the 3rd edge in the graph (the remaining edges are (1, 2) and (2, 3))\nQ 1 2 -- finds the vertex with the second largest value among all vertexes connected with 1. The answer is 20.\nQ 2 1 -- finds the vertex with the largest value among all vertexes connected with 2. The answer is 30.\nD 2 -- deletes the 2nd edge in the graph (the only edge left after this operation is (1, 2))\nQ 3 2 -- finds the vertex with the second largest value among all vertexes connected with 3.  The answer is 0 (Undefined).\nC 1 50 -- changes the value of vertex 1 to 50.\nQ 1 1 -- finds the vertex with the largest value among all vertex connected with 1. The answer is 50.\nE -- This is the end of the current test case. Four queries have been evaluated, and the answer to this case is (20 + 30 + 0 + 50) / 4 = 25.000.\n\nFor the second sample, caution about the vertex with same weight:\n\tQ 1 1 &#xFFFD;C the answer is 20\n\tQ 1 2 &#xFFFD;C the answer is 20\n\tQ 1 3 &#xFFFD;C the answer is 10\n\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2010+Asia+Tianjin+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2010 Asia Tianjin Regional Contest </a> ","type":"source","format":"html"}]}