{"title":"Tunnelling the Earth","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3772","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3772&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3772","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3772"},"statement":[{"title":"Problem Description","content":"There are different methods of transporting people from place to place: cars, bikes, boats, trains, planes, etc. For very long distances, people generally fly in a plane. But this has the disadvantage that the plane must fly around the curved surface of the earth. A distance travelled would be shorter if the traveller followed a straight line from one point to the other through a tunnel through the earth.<br><br>For example, travelling from Waterloo to Cairo requires a distance of 9293521 metres following the great circle route around the earth, but only 8491188 metres following the straight line through the earth.<br><br>For this problem, assume that the earth is a perfect sphere with radius of 6371009 metres.","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a single integer, the number of test cases to follow. Each test case is one line containing four floating point numbers: the latitude and longitude of the origin of the trip, followed by the latitude and longitude of the destination of the trip. All of these measurements are in degrees. Positive numbers indicate North latitude and East longitude, while negative numbers indicate South latitude and West longitude.<br> ","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a line containing a single integer, the difference in the distance between the two points following the great circle route around the surface of the earth and following the straight line through the earth, in metres. Round the difference of the distances to the nearest integer number of metres.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n43.466667 -80.516667 30.058056 31.228889</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">802333</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=University+of+Waterloo+Local+Contest+2010.07.10+&amp;source=1&amp;searchmode=source\"> University of Waterloo Local Contest 2010.07.10  </a> ","type":"source","format":"html"}]}