{"title":"Soccer","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3778","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3778&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3778","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3778"},"statement":[{"title":"Problem Description","content":"In soccer, there are many different rewards (and punishments) depending on how you rank in the league at the end of a season. For example, in the British Premier League, the top 4 teams are eligible to play in the Champions League, the next team is eligible to play in the Europa League, and the bottom three teams are relegated to the lower division. It is now near the end of the soccer season, and there are still a number of games to be played. For any given team, we wish to know what is the highest and lowest rank it can have at the end of the season.<br><br>For each game played, a team wins if it scores more goals than its opponent. A team loses a game if it scores fewer goals. When both teams score the same number of goals, we call it a draw. A team earns 3 points for each win, 1 point for each draw and 0 point for each loss. Teams are ranked according to the number of points earned (more points result in a higher ranking). Teams that are tied are given the same rank. For example, if two teams are tied and have the next highest point total after the 3rd place team, then they are both ranked 4th (and the next team is ranked 6th). In real life, factors such as goal differences and goals scored are used to break ties, but we will not consider these for this problem.<br><br>You are given a list of soccer teams and a list of matches in a season. You may assume that every team will play the same number of games at the end. Some of the matches have been played and the results are known.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of a number of cases. The first line in each case specifies two integers n and m (2&#x2264;n&#x2264;20, 1&#x2264;m&#x2264;1000) indicating the number of teams in the league and the number of matches in the season. The next n lines contain the name of each team in its own line. The team names contain only alphabetic characters and have lengths at most 30 characters. This is followed by m lines each of the form<br><br><b>team1 vs team2: x y</b><br><br>with team1 and team2 being the names of two different teams, and x and y are non-negative integers (or both are -1), indicating that in the game between team1 and team2, team1 scores x goals and team2 scores y goals. If both x and y are -1, then the game has not yet been played. At most 12 games will not have been played yet.<br><br>The input is terminated with n = m = 0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each team in the same order as the team list in the input, print one line of the following form:<br><br><b>Team XXX can finish as high as nth place and as low as mth place.</b><br><br>Use st, nd, and rd instead of th for first, second, and third place, respectively. Print a blank line between cases.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 6\nManUnited\nArsenal\nChelsea\nTottenham\nManUnited vs Arsenal: 3 1\nChelsea vs Arsenal: 2 2\nManUnited vs Chelsea: 1 0\nTottenham vs ManUnited: -1 -1\nTottenham vs Chelsea: 0 4\nTottenham vs Arsenal: -1 -1\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Team ManUnited can finish as high as 1st place and as low as 1st place.\nTeam Arsenal can finish as high as 2nd place and as low as 4th place.\nTeam Chelsea can finish as high as 2nd place and as low as 3rd place.\nTeam Tottenham can finish as high as 1st place and as low as 4th place.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ%BF%AA%B7%C5%CA%BD%BD%F8%BD%D7%D1%B5%C1%B7%2811%29%A1%AA%A1%AA%C8%AB%B3%CC%B2%E2%CA%D4&amp;source=1&amp;searchmode=source\"> HDOJ&#x5F00;&#x653E;&#x5F0F;&#x8FDB;&#x9636;&#x8BAD;&#x7EC3;(11)&#x2014;&#x2014;&#x5168;&#x7A0B;&#x6D4B;&#x8BD5; </a> ","type":"source","format":"html","require":["katex"]}]}