{"title":"Railroad","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3779","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3779&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3779","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3779"},"statement":[{"title":"Problem Description","content":"A train yard is a complex series of railroad tracks for storing, sorting, or loading/unloading railroad cars. In this problem, the railroad tracks are much simpler, and we are only interested in combining two trains into one.<br><img style=\"max-width:100%;\" src=\"http://acm.hdu.edu.cn/data/images/C325-1007-1.gif\"><br><center> Figure 1: Merging railroad tracks. </center><br><br>The two trains each contain some railroad cars. Each railroad car contains a single type of products identified by a positive integer up to 1,000,000. The two trains come in from the right on separate tracks, as in the diagram above. To combine the two trains, we may choose to take the railroad car at the front of either train and attach it to the back of the train being formed on the left. Of course, if we have already moved all the railroad cars from one train, then all remaining cars from the other train will be moved to the left one at a time. All railroad cars must be moved to the left eventually. Depending on which train on the right is selected at each step, we will obtain different arrangements for the departing train on the left. For example, we may obtain the order 1,1,1,2,2,2 by always choosing the top train until all of its cars have been moved. We may also obtain the order 2,1,2,1,2,1 by alternately choosing railroad cars from the two trains.<br><br>To facilitate further processing at the other train yards later on in the trip (and also at the destination), the supervisor at the train yard has been given an ordering of the products desired for the departing train. In this problem, you must decide whether it is possible to obtain the desired ordering, given the orders of the products for the two trains arriving at the train yard.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input consists of a number of cases. The first line contains two positive integers N<sub>1</sub> N<sub>2</sub> which are the number of railroad cars in each train. There are at least 1 and at most 1000 railroad cars in each train. The second line contains N1 positive integers (up to 1,000,000) identifying the products on the first train from front of the train to the back of the train. The third line contains N<sub>2</sub> positive integers identifying the products on the second train (same format as above). Finally, the fourth line contains N<sub>1</sub>+N<sub>2</sub> positive integers giving the desired order for the departing train (same format as above).<br><br>The end of input is indicated by N<sub>1</sub> = N<sub>2</sub> = 0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, print on a line <b>possible</b> if it is possible to produce the desired order, or <b> not possible </b> if not.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n1 2 1\n2 1 1\n1 2 1 1 2 1\n3 3\n1 2 1\n2 1 2\n1 1 1 2 2 2\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">possible\nnot possible</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=HDOJ%BF%AA%B7%C5%CA%BD%BD%F8%BD%D7%D1%B5%C1%B7%2811%29%A1%AA%A1%AA%C8%AB%B3%CC%B2%E2%CA%D4&amp;source=1&amp;searchmode=source\"> HDOJ&#x5F00;&#x653E;&#x5F0F;&#x8FDB;&#x9636;&#x8BAD;&#x7EC3;(11)&#x2014;&#x2014;&#x5168;&#x7A0B;&#x6D4B;&#x8BD5; </a> ","type":"source","format":"html","require":["katex"]}]}