{"title":"Magina","time_limit":30000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3810","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3810&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3810","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3810"},"statement":[{"title":"Problem Description","content":"Magina, also known as Anti-Mage, is a very cool hero in DotA (Defense of the Ancient).<br><img style=\"max-width:100%;\" src=\"http://acm.hdu.edu.cn/data/images/C344-1002-1.png\"><br>If you have no idea of him, here is some brief introduction of his legendary antecedents:<br>Twin sons to the great Prophet, Terrorblade and Magina were blessed with divine powers: Terrorblade granted with an unnatural affinity with life forces; Magina gifted with energy manipulation. Magina&apos;s eventual overexposure to the magic gradually augmented his elemental resistances and bestowed him the unique ability to move faster than light itself. Now, broken by Terrorblade&apos;s fall to the dark side, Magina answers the Sentinel&apos;s call in a desperate bid to redeem his brother. Every bitter strike turns the Scourge&apos;s evil essences upon themselves, culminating in a finale that forces his enemy to awaken to the void within and spontaneously implode.<br>Magina has a very IMBA (imbalanced) skill &#x2013; Blink, yes, move from one place to another place in a wink. Our problem begins at there.<br>As a formidable hero in the later stage, Magina always farm with the wild monsters for a long time. To make the farming more efficient, Magina use Blink frequently to jump here and there. Here we assume Blink skill has no CD, that is, we can use this skill at any time we want.<br>There are N spots of the wild monsters, and Magina can choose any one to begin. For every spots, Magina may use Ti time to kill the monsters and gain Gi units money, or he choose blink to other spots, which is known to our brilliant Magina. If the monsters in a spot were killed, it won&#x2019;t appear any more.<br>Now Magina want to get M units money to but some excellent equipment, say Battle Fury for example. As a hero to save the world, there is no much time left for Magina, he wonders the minimum time for him to gain at least M units money. ","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer T, indicating the number of test cases.<br>Each test case begins with two integers N, M. Their meanings are the same as the description.<br>Then N blocks follow, each one describes a spot of wild monsters.<br>The first line of each block is there integers Ti, Gi and Ki. Ti is the time, Gi is the units of money, Ki is the number of spots Magina can blink to from here.<br>Then Ki integer Cij follow, indicating the spots&#x2019; ID Magina can blink to. You may assume no ID would appear twice.<br>The spots are described with ID increasing from 1 to N. Input ensure if you can blink from i to j, you can also blink from j to i.<br><br>Technical Specification<br><br>1. 1 &lt;= T &lt;= 50<br>2. 1 &lt;= N &lt;= 50<br>3. 1 &lt;= Ti &lt;= 10000000<br>4. 1 &lt;= M, Gi &lt;= 1000000000<br>5. 1 &lt;= Ki &lt; N<br>6. 1 &lt;= Cij &lt;= N","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the case number first, then the minimum time for Magina to gain at least M units money, if can&#x2019;t, output &#x201C;<font color=\"red\">Poor Magina, you can&apos;t save the world all the time!</font>&#x201D;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 4\n2 5 0\n1 5\n1 4 0\n4 10\n1 9 0\n3 3 1\n3\n3 3 2\n2 4\n4 4 1\n3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 2\nCase 2: Poor Magina, you can&apos;t save the world all the time!\nCase 3: 10</div></pre>","type":"example","format":"html"},{"title":"Author","content":"iSea@WHU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+6th+Central+China+Invitational+Programming+Contest+and+9th+Wuhan+University+Programming+Contest+Preliminary&amp;source=1&amp;searchmode=source\"> The 6th Central China Invitational Programming Contest and 9th Wuhan University Programming Contest Preliminary </a> ","type":"source","format":"html"}]}