{"title":"To Add or to Multiply","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3837","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3837&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3837","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3837"},"statement":[{"title":"Problem Description","content":"The Industrial Computer Processor Company offers very fast, special purpose processing units tailored to customer needs. Processors of the a-C-mfamily (such as the 1-C-2 and the 5-C-3) have an instruction set with only two different operations:<br><br>A add a<br>M multiply by m<br><br>The processor receives an integer, executes a sequence of A and M operations (the program) that modifies the input, and outputs the result. For example, the 1-C-2 processor executing the program AAAM with the input 2 yields the output<br>10 (the computation is 2 ! 3 ! 4 ! 5 ! 10), while the 5-C-3 processor yields 51 with the same program and input (2 ! 7 ! 12 ! 17 ! 51).<br><br>You are an a-C-m programmer assigned to a top secret project. This means that you have not been told the precise computation your program should perform. But you are given particular values p, q, r, and s and the following<br>conditions:<br><br>1. The input is guaranteed to be a number between p and q.<br>2. The output must be some number between r and s.<br><br>Given an a-C-m processor and the numbers p, q, r, and s, your job is to construct the shortest a-C-m program which, for every input x such that p &lt;= x &lt;= q, yields some output y such that r &lt;= y &lt;= s. If there is more than one program of minimum length, choose the one that come first lexicographically, treating each program as a string of As and Ms.","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. Each test case is given by a line with the six integers a, m, p, q, r, and s as described above (1 &lt;= a, m, p, q, r, s &lt;= 10^9, p &lt;= q and r &lt;= s).<br><br>The last test case is followed by a line with six zeros.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, display its case number followed by the best program as described above. Display the word &#x201C;empty&#x201D; if the best program uses no operations. Display the word &#x201C;impossible&#x201D; if there is no program meeting the specifications.<br><br>Display the program as a sequence of space-separated strings, alternating between strings of the form &#x201C;nA&#x201D; and strings of the form &#x201C;nM&#x201D;, where n &gt; 0. Strings of the former type indicate n consecutive A operations, and strings of the latter type indicate n consecutive M operations.<br><br>Follow the format of the sample output.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2 2 3 10 20\n1 3 2 3 22 33\n3 2 2 3 4 5\n5 3 2 3 2 3\n0 0 0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1A 2M\nCase 2: 1M 2A 1M\nCase 3: impossible\nCase 4: empty</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011WorldFinal&amp;source=1&amp;searchmode=source\"> 2011WorldFinal </a> ","type":"source","format":"html"}]}