{"title":"Ancient Messages","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3839","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3839&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3839","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3839"},"statement":[{"title":"Problem Description","content":"In order to understand early civilizations, archaeologists often study texts written in ancient languages. One such language, used in Egypt more than 3000 years ago, is based on characters called hieroglyphs. Figure C.1 shows six hieroglyphs and their names. In this problem, you will write a program to recognize these six characters.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/3839-1.jpg\"></center> ","type":"description","format":"html"},{"title":"Input","content":"The input consists of several test cases, each of which describes an image containing one or more hieroglyphs chosen from among those shown in Figure C.1. The image is given in the form of a series of horizontal scan lines consisting of black pixels (represented by 1) and white pixels (represented by 0). In the input data, each scan line is encoded in hexadecimal notation. For example, the sequence of eight pixels 10011100 (one black pixel, followed by two white pixels, and so on) would be represented in hexadecimal notation as 9c. Only digits and lowercase letters a through f are used in the hexadecimal encoding. The first line of each test case contains two integers, H and W: H (0 &lt; H &lt;= 200) is the number of scan lines in the image. W (0 &lt; W &lt;= 50) is the number of hexadecimal characters in each line. The next H lines contain the hexadecimal characters of the image, working from top to bottom. Input images conform to the following rules:<br><ul><br><li> The image contains only hieroglyphs shown in Figure C.1.</li><br><li> Each image contains at least one valid hieroglyph.</li><br><li> Each black pixel in the image is part of a valid hieroglyph.</li><br><li> Each hieroglyph consists of a connected set of black pixels and each black pixel has at least one other black pixel on its top, bottom, left, or right side.</li><br><li> The hieroglyphs do not touch and no hieroglyph is inside another hieroglyph.</li><br><li> Two black pixels that touch diagonally will always have a common touching black pixel.</li><br><li> The hieroglyphs may be distorted but each has a shape that is topologically equivalent to one of the symbols in Figure C.1<sup>1</sup>.</li><br></ul><br>The last test case is followed by a line containing two zeros.<br><br><sup>1</sup>Two figures are topologically equivalent if each can be transformed into the other by stretching without tearing.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, display its case number followed by a string containing one character for each hieroglyph recognized in the image, using the following code:<br><br>Ankh: A<br>Wedjat: J<br>Djed: D<br>Scarab: S<br>Was: W<br>Akhet: K<br><br>In each output string, print the codes in alphabetic order. Follow the format of the sample output.<br><br>The sample input contains descriptions of test cases shown in Figures C.2 and C.3. Due to space constraints not all of the sample input can be shown on this page.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/3839-2.jpg\"></center> ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">100 25\n0000000000000000000000000\n0000000000000000000000000\n ...(50 lines omitted)...\n00001fe0000000000007c0000\n00003fe0000000000007c0000\n ...(44 lines omitted)...\n0000000000000000000000000\n0000000000000000000000000\n150 38\n00000000000000000000000000000000000000\n00000000000000000000000000000000000000\n    ...(75 lines omitted)...\n0000000003fffffffffffffffff00000000000\n0000000003fffffffffffffffff00000000000\n    ...(69 lines omitted)...\n00000000000000000000000000000000000000\n00000000000000000000000000000000000000\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: AKW\nCase 2: AAAAA</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011WorldFinal&amp;source=1&amp;searchmode=source\"> 2011WorldFinal </a> ","type":"source","format":"html"}]}