{"title":"Magic Sticks","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3843","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3843&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3843","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3843"},"statement":[{"title":"Problem Description","content":"Magic was accepted by all ancient peoples as a technique to compel the help of divine powers. In a well-known story, one group of sorcerers threw their walking sticks on the floor where they magically appeared to turn into live serpents. In opposition, another person threw his stick on the floor, where it turned into a serpent which then consumed the sorcerers&#x2019; serpents!<br><br>The only magic required for this problem is its solution. You are given a magic stick that has several straight segments, with joints between the segments that allow the stick to be folded. Depending on the segment lengths and how they are folded, the segments of the stick can be arranged to produce a number of polygons. You are to determine the maximum area that could be enclosed by the polygons formed by folding the stick, using each segment in at most one polygon. Segments can touch only at their endpoints. For example, the stick shown below on the left has five segments and four joints. It can be folded to produce a polygon as shown on the right.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/3843-1.jpg\"></center> ","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. Each test case describes a magic stick. The first line in each test case contains an integer n (1 &lt;= n &lt;= 500) which indicates the number of the segments in the magic stick. The next line contains n integers S<sub>1</sub>,S<sub>2</sub>, . . . , S<sub>n</sub> (1 &lt;= S<sub>i</sub> &lt;= 1000) which indicate the lengths of the segments in the order they appear in the stick.<br>The last test case is followed by a line containing a single zero.","type":"input_format","format":"html"},{"title":"Output","content":"For each case, display its case number followed by the maximum total enclosed area that can be obtained by folding the magic stick at the given points. Answers within an absolute or relative error of 10^-4 will be accepted.<br> Follow the format of the sample output.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n1 2 3 4\n8\n3 4 5 33 3 4 3 5\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 4.898979\nCase 2: 19.311</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011WorldFinal&amp;source=1&amp;searchmode=source\"> 2011WorldFinal </a> ","type":"source","format":"html"}]}