{"title":"LOOPS","time_limit":5000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3853","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3853&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3853","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3853"},"statement":[{"title":"Problem Description","content":"Akemi Homura is a Mahou Shoujo (Puella Magi/Magical Girl).<br><br>Homura wants to help her friend Madoka save the world. But because of the plot of the Boss Incubator, she is trapped in a labyrinth called LOOPS.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/3853-1.jpg\"></center> <br>The planform of the LOOPS is a rectangle of R*C grids. There is a portal in each grid except the exit grid. It costs Homura 2 magic power to use a portal once. The portal in a grid G(r, c) will send Homura to the grid below G (grid(r+1, c)), the grid on the right of G (grid(r, c+1)), or even G itself at respective probability (How evil the Boss Incubator is)!<br>At the beginning Homura is in the top left corner of the LOOPS ((1, 1)), and the exit of the labyrinth is in the bottom right corner ((R, C)). Given the probability of transmissions of each portal, your task is help poor Homura calculate the EXPECT magic power she need to escape from the LOOPS.<br><br><br><br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains two integers R and C (2 &lt;= R, C &lt;= 1000).<br><br>The following R lines, each contains C*3 real numbers, at 2 decimal places. Every three numbers make a group. The first, second and third number of the cth group of line r represent the probability of transportation to grid (r, c), grid (r, c+1), grid (r+1, c) of the portal in grid (r, c) respectively. Two groups of numbers are separated by 4 spaces.<br><br>It is ensured that the sum of three numbers in each group is 1, and the second numbers of the rightmost groups are 0 (as there are no grids on the right of them) while the third numbers of the downmost groups are 0 (as there are no grids below them).<br><br>You may ignore the last three numbers of the input data. They are printed just for looking neat.<br><br>The answer is ensured no greater than 1000000.<br><br>Terminal at EOF<br><br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"A real number at 3 decimal places (round to), representing the expect magic power Homura need to escape from the LOOPS.<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2\n0.00 0.50 0.50    0.50 0.00 0.50\n0.50 0.50 0.00    1.00 0.00 0.00</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6.000</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Invitational+Contest+Host+by+BUPT&amp;source=1&amp;searchmode=source\"> 2011 Invitational Contest Host by BUPT </a> ","type":"source","format":"html","require":["katex"]}]}