{"title":"Circuit Board","time_limit":5000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3860","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3860&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3860","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3860"},"statement":[{"title":"Problem Description","content":"Recently Silence has got a new circuit board with which he will do a new experiment. <br><br>Now we can assume that the circuit board is made of R lines and each line has C holes. And we can only put a wire between the adjacent holes. We say a hole is adjacent to another one if and only if it is at the up, down, left or right side of the other one. <br><center><img style=\"max-width:100%;\" src=\"../../data/images/C352-1002-1.jpg\"></center><br>This is a circuit board and we can add wires like this.<br><br>Now P holes on the left side of the board are power sources and each one can afford a specific amount of electric current. And O holes on the right side of the board are output interfaces and each one needs a specific amount of electric current.<br><br>In order to complete the experiment we should put some wires on the board so that we can meet every output interface on the board (we don&#x2019;t have to use up all the power). But the circuit board is a little old so between some adjacent holes we can only put a wire whose capacity is not greater than a specific value. And what&#x2019;s more, some of the holes are fault holes which means the fault hole can&#x2019;t be connect to any adjacent holes, we assume no power sources or output interfaces are fault holes.<br><br>Now we have several different kinds of wires and each kind of wire has a specific capacity. And we can use as many wires as we want of each kind. But as we know the wire which has a higher capacity is much more expensive than the one which has a lower capacity. So we should make the highest capacity of the wires we use as low as possible. <br><br>Now it is your turn to write a program to get the best solution whose highest capacity of all the wires is as low as possible. You can just output the highest capacity of the best solution.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases in this problem. The first line of the input is an integer T(1 &lt;= T &lt;= 10), which means there are T test cases in the input.<br>&#xA0;&#xA0;<br>The first line of each test case is two integers R and C (2 &lt;= R, C &lt;= 200), which means the circuit board has R lines and each line has C holes. And the coordinate of the upper left corner is always (1, 1).<br><br>Then there is an integer P(1 &lt;= P &lt;= R) means P holes of the left side is power sources. And each of the next P lines has two integers Ai, Si (1 &lt;= Ai &lt;= R, 0 &lt; Si &lt;= 1000), which indicates the i-th power source is located at (Ai, 1) and can afford Si amount of electric current. Then there is an integer O (1 &lt;= O &lt;= R) means O holes of the right side is Output interfaces. And each of the next O lines has two integer Bi, Ti, (1 &lt;= Bi &lt;= R, 0 &lt; Ti &lt;= 1000), which indicates the i-th output source is located at (Bi, C) and needs Ti amount of electric current.<br><br>Then there is an integer Q (0 &lt;= Q &lt;= R*(C-1) + C*(R-1)), and the next Q lines each one has 5 integers x1, y1, x2, y2, m (0 &lt; x1,x2 &lt;= R, 0 &lt; y1, y2 &lt;= C, 0 &lt; m &lt;= 1000). That indicates between the holes at (x1, y1) and (x2, y2) we can only put a wire whose capacity is not greater than m. we assume that (x1, y1) and (x2, y2) are adjacent holes.<br><br>And then there is an integer K (0 &lt;= K &lt;= R * C &#x2013; P - O). And each of the next K lines has two integers xi, yi, means there are k fault holes on the board and the i-th hole&#x2019;s coordinate is (xi, yi).<br><br>Then there is an integer W (1 &lt;= W &lt;= 10000), means there are W kinds of wire we can choose. And the followed line has W integers u1, u2, &#x2026;, uw. ui means the i-th kind of wire&#x2019;s capacity is ui (0 &lt; ui &lt;= 100000).<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one integer which is the minimum of the largest capacity we choose to complete the experiment. If we can&#x2019;t complete it, output -1.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2 3\n1\n1 4\n1\n2 4\n1\n1 1 1 2 1\n0\n4\n1 2 3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div><center><img src=\"../../data/images/C352-1002-2.jpg\"></center> \nThis is one of the solution of the sample input, so the answer is 3.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+3+-+Host+by+BIT&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 3 - Host by BIT </a> ","type":"source","format":"html"}]}