{"title":"The King’s Problem","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3861","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3861&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3861","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3861"},"statement":[{"title":"Problem Description","content":"In the Kingdom of Silence, the king has a new problem. There are N cities in the kingdom and there are M directional roads between the cities. That means that if there is a road from u to v, you can only go from city u to city v, but can&#x2019;t go from city v to city u. In order to rule his kingdom more effectively, the king want to divide his kingdom into several states, and each city must belong to exactly one state. <font color=\"red\">What&#x2019;s more, for each pair of city (u, v), if there is one way to go from u to v and go from v to u, (u, v) have to belong to a same state. </font>And the king must insure that in each state we can ether go from u to v or go from v to u between every pair of cities (u, v) without passing any city which belongs to other state.<br>&#xA0;&#xA0;Now the king asks for your help, he wants to know the least number of states he have to divide the kingdom into.","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer T, the number of test cases. And then followed T cases. <br><br>The first line for each case contains two integers n, m(0 &lt; n &lt;= 5000,0 &lt;= m &lt;= 100000), the number of cities and roads in the kingdom. The next m lines each contains two integers u and v (1 &lt;= u, v &lt;= n), indicating that there is a road going from city u to city v.","type":"input_format","format":"html"},{"title":"Output","content":"The output should contain T lines. For each test case you should just output an integer which is the least number of states the king have to divide into.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 2\n1 2\n1 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+3+-+Host+by+BIT&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 3 - Host by BIT </a> ","type":"source","format":"html"}]}