{"title":"East and West","time_limit":4000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3894","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3894&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3894","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3894"},"statement":[{"title":"Problem Description","content":"TDB (Tie Dao Bu) is a magical department in TC (Tian Chao), as you all know... Now we have some emergency foods to transport from east TC to west TC. In order to avoid more tragedies, this time it&apos;s your turn to act as the role of scheduling the trains...<br>There are N stations numbered from 1 to N in TC, connected by M undirected railways, guaranteeing that any of the two stations are reachable to each other.<br>The east of TC has E (numbered from 1 to E) stations, while the west has W (numbered from N-W+1 to N) stations. Initially, P trains filled with food are waiting at P different stations in the east. Your task is to schedule these trains, thus making them finally stopped at P different stations in the west.<br>Here, the time for a train to pass a single railway is exactly one day. And for safety reasons, each railway can let only one train pass per day. Moreover, a train can stop at any station for an arbitrarily number of days. And each station can hold at most P trains.<br>To simplify, we shall promise that M = N - 1 and N &lt;= 10^6, and there always exists a railway whose removal separates the east and the west.<br>Your task is to make the trains&apos; arrival completed as soon as possible.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases. For each test case, there will be 4 integers in the first line, namely N, M, E and W, as mentioned above. Each of the next M lines will contain two integers u and v, which indicates a railway between u and v. Then the following line has a single integer P. For the next P lines, each will contain a single integer describing the initial positions for the trains with food.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the number of days needed at least to finish the transportation, in a single line.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1 1 1\n1 2\n1\n1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+6+-+Host+by+JLU&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 6 - Host by JLU </a> ","type":"source","format":"html","require":["katex"]}]}