{"title":"Enchantress","time_limit":1000,"memory_limit":61.296875,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3922","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3922&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3922","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3922"},"statement":[{"title":"Problem Description","content":"This time Vance controls a hero, enchantress and let&apos;s just called her Aiushtha. Aiushtha uses spear to attack and she has a powerful ultra skill called Impetus. <br>It will give your enemy huge damage every time you attack. <br>The damage equals to p*dis, p is constant decimal, and dis means the distance between you and your enemy when the spear hit your enemy.<br><br>Now Vance&apos;s enchantress is run after her enemy, to make the problem simple, <br>let&apos;s imagine that you and your enemy can only run left or right.<br> Your enemy will always run left and Aiushtha can turn around at any time. <br><font color=\"red\">Aiushtha can&apos;t go to the leftside of your enemy.</font><br><br>The firing range of enchantress is d, a.k.a. you cannot attack if the distance between you and your enemy if longer than d. <br>She can&apos;t attack twice within cd seconds. Your enemy speed is v1, your speed is v2, and your spear&apos;s speed is v3. <br>We guarantee that v3 &gt; max(v1,v2). The enemy&apos;s current life point is hp.<br> When enchantress uses impetus to hurt his enemy, the enemy&apos;s life reduce the value of the damage that impetus makes. <br>In time t=0s your enemy is at x=0 and you are in x=d, <br>your enemy will always run leftwards now Aiushtha finds that she has only two spears and she want to kill his enemy as soon as possible. Can you help her?<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C355-1003-1.jpg\"></center> ","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single positive integer T( T &lt;= 200 ), indicates the number of test cases.<br>For each test case: give you the parameters separated by a single space in the following order: d, cd, v1, v2, v3, hp, p. <br>All of above numbers are positive decimals between 0 and 10^6 and we guarantee that cd is longer than the time the spear need to hit the enemy. <br>When the enemy&apos;s current hp is equals or lower than zero he died immediately. All of the given numbers have at most two decimals.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case: output the case number as shown and then output the least time needed to make the enemy die up to 4 decimals. <br>If it&apos;s impossible to kill the enemy output -1.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n600 2 400 300 1000 2000 0.5\n600 2 400 300 1000 200 0.5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: -1\nCase #2: 1.0000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+9+-+Host+by+BJTU&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 9 - Host by BJTU </a> ","type":"source","format":"html"}]}