{"title":"River Problem","time_limit":2000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3947","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3947&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3947","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3947"},"statement":[{"title":"Problem Description","content":"The River of Bitland is now heavily polluted. To solve this problem, the King of Bitland decides to use some kinds of chemicals to make the river clean again.<br><br>The structure of the river contains n nodes and exactly n-1 edges between those nodes. It&apos;s just the same as all the rivers in this world: The edges are all unidirectional to represent water flows. There are source points, from which the water flows, and there is exactly one sink node, at which all parts of the river meet together and run into the sea. The water always flows from sources to sink, so from any nodes we can find a directed path that leads to the sink node. Note that the sink node is always labeled 1.<br><br>As you can see, some parts of the river are polluted, and we set a weight Wi for each edge to show how heavily polluted this edge is. We have m kinds of chemicals to clean the river. The i-th chemical can decrease the weight for all edges in the path from Ui to Vi by exactly 1. Moreover, we can use this kind of chemical for Li times, the cost for each time is Ci. Note that you can still use the chemical even if the weight of edges are 0, but the weight of that edge will not decrease this time.<br><br>When the weight of all edges are 0, the river is cleaned, please help us to clean the river with the least cost.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input is an integer T representing the number of test cases. The following T blocks each represents a test case.<br><br>The first line of each block contains a number n (2&lt;=n&lt;=150)  representing the number of nodes. The following n-1 lines each contains 3 numbers U, V, and W, means there is a directed edge from U to V, and the pollution weight of this edge is W. (1&lt;=U,V&lt;=n, 0&lt;=W&lt;=20)<br><br>Then follows an number m (1&lt;=m&lt;=2000), representing the number of chemical kinds. The following m lines each contains 4 numbers Ui, Vi, Li and Ci (1&lt;=Ui,Vi&lt;=n, 1&lt;=Li&lt;=20, 1&lt;=Ci&lt;=1000), describing a kind of chemical, as described above. It is guaranteed that from Ui we can always find a directed path to Vi.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"First output &quot;Case #k: &quot;, where k is the case numbers, then follows a number indicating the least cost you are required to calculate, if the answer does not exist, output &quot;-1&quot; instead.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n2 1 2\n3 1 1\n1\n3 1 2 2\n3\n2 1 2\n3 1 1\n2\n3 1 2 2\n2 1 2 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: -1\nCase #2: 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Thost &amp; Kennethsnow","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+11+-+Host+by+UESTC&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 11 - Host by UESTC </a> ","type":"source","format":"html","require":["katex"]}]}