{"title":"Parking Log","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3950","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3950&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3950","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3950"},"statement":[{"title":"Problem Description","content":"The parking lot in the center of the capital has N parking spaces. You are asked to develop a program to write the parking log of the lot. The program is required to record such two operations which may happen in the lot:<br><br>A: A motorcade with Mi cars applies for Mi parking spaces in a row, namely, continuous spaces [Si,Si+Mi-1]. A special constraint is that the number of free spaces between the coming motorcade and the last car parking before Si, should not be larger than Li. Note that, this constraint has no effect if there is no car before Si. What&apos;s more, the number of free spaces between the coming motorcade and the first car parking after Si+Mi-1 should not be larger than Ri. Also, you should ignore this constraint when Si+Mi-1 is last occupied space. The space with the smallest Si is selected when there are several candidate start places. The motorcade will leave if there are no spaces satisfying the conditions. After one motorcade is parked, its parking limits Li and Ri can be ignored when finding parking places for later coming motorcades. Your task is to find the Si, and return it as result.<br><br>B. The k-th motorcade counted from left to right leaves the lot. Ignore this operation if there are no more than k motorcades in the parking lot.<br><br>In the very beginning, the spaces in the lot are all free.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"First line of the input is a single integer T(T &lt;= 10), indicates there are T test cases.<br>For each test case, the first line is two integers N(1 &lt;= N &lt;= 50000) Q(1 &lt;= Q &lt;= 100000), representing the size of the lot and the number of operations. <br>The following Q lines give the operations, in which lines with one char and three integers as &quot;A M L R&quot; (0 &lt; M,L,R &lt;= 50000) representing operations of type A, and lines with one char and a single number are of type B.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, you should output &quot;Case #k:&quot; first. After that, your  program should output the result place for each operation A, -1 if no place available.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n90 5\nA 77 2 2\nB 3\nB 1\nA 53 2 3\nA 7 3 3\n7 15\nA 3 1 1\nA 1 1 1\nB 1\nA 1 1 1\nA 1 1 1\nB 2\nA 2 1 1\nA 1 1 1\nA 2 1 1\nA 1 1 1\nB 4\nB 3\nB 2\nA 1 1 1\nA 2 1 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n1\n1\n54\nCase #2:\n1\n4\n2\n1\n2\n5\n6\n-1\n-1\n3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+11+-+Host+by+UESTC&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 11 - Host by UESTC </a> ","type":"source","format":"html","require":["katex"]}]}