{"title":"SanguoSHA","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3956","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3956&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3956","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3956"},"statement":[{"title":"Problem Description","content":"SanguoSHA is a very popular game. The rules of SanguoSHA are too complex for me to describe it in English, so just let me simplify it a lot. ^ ^.<br><center><img style=\"max-width:100%;\" src=\"http://acm.hdu.edu.cn/data/images/C361_1006_1.jpg\"></center><br>In this custom game we have several rules shown below, and you should read carefully:<br><i><b>Part I--Identifies:</b></i><br>1): There are at most 8 players while at least 4;<br>2): There are 4 roles: Lord, Minister, Rebel, and Traitor.<br>3): The goal of the Lord and Ministers is to kill all of the Rebels and the Traitor.<br>4): The goal of the Rebel is to kill the Lord.<br>5): The goal of the Traitor is to make himself alive until the game over.<br>6): There is only 1 Lord.<br>7): There is only 1 Traitor.<br>8): There will be at least 1 Rebel.<br>9): There will be at least 1 Minister.<br>10): Every player know the total remain number of Rebel and Minister.<br><br><i><b>Part II--How to determine the game over and who wins:</b></i><br>1): If the Lord is alive, and there is neither alive Rebel nor Traitor, then the game over, and the Lord and Ministers win.<br>2): When the Lord is killed by someone, the game over, if there is no one but the Traitor alive, then the Traitor wins; otherwise, the Rebels win.<br><br><i><b>Part III--How to play in this custom game:</b></i><br>1): At first, the roles of all players except for the Lord are hidden, they only know their own roles. That means players have to conjecture others&apos; role by analysing their behavior.<br>2): In each round, all alive players play one by one. The player1 plays first, then player2...<br>3): In each player&apos;s turn, the player can choose one and only one player to attack. The probability of killing the chosen one is P.<br>4): When a player is killed, his role should be announced.<br><br><i><b>Part IV--How to analysis player&apos;s behaviors:</b></i><br>1): The Lord is always be considered as Lord.<br>2): A player will be considered as Rebel when he attack the Lord.<br>3): A player will be considered as Rebel when he attack one which considered as Minister before all Rebels are eliminated.<br>4): A player will be considered as Minister when he attack one which considered as Rebel.<br>5): A player will be considered as Traitor when he have been considered as Minister and Rebel.<br>6): The players are not clever enough, they can&apos;t analysis other behaviors.<br><br><i><b>Part V--The attack strategy of each role:</b></i><br>Eliminated player couldn&apos;t do anything.<br>No one will attack eliminated player or himself.<br>For each strategy, all eligible player have equal probability of being attacked.<br>The Rebel will choose one of the following strategies by order:<br>1)The Lord or Ministers if some players are considered as Minister.<br>2)The Lord or Traitor if a player is considered as Traitor.<br>3)The Lord.<br>The Lord and Ministers will choose one of the following strategies  by order:<br>1)The player which be considered as Rebel.<br>2)The player which be considered as Traitor.<br>3)If all rebel roles are eliminated, then attack anyone except Lord.<br>4)The player with unknown role.<br>The Traitor will choose one of the following strategies by order:<br>1)The player which be considered as Minister if alive Minister number more than alive Rebel number.<br>2)The player which be considered as Rebel if alive Rebel number not less than alive Minister number.<br>3)Anyone expect the Lord.<br>4)The Lord.<br><br>Such information will be given:<br>1): The number of players.<br>2): Each player&apos;s identify.<br>3): The probability of killing the chosen one.<br>For each role, you should calculate the probability of winning within 10 round.","type":"description","format":"html"},{"title":"Input","content":"The first line is a number T(1&lt;=T&lt;=30), represents the number of case. The next T blocks follow each indicates a case.<br>Each case consists of three lines, the first line is an integer N(4&lt;=N&lt;=8), indicating the number of players.<br>The second line contains N integers, player1,player2...playern, indicating the role of each player.(The first player will always be the Lord).(0, 1, 2, 3 indicating Lord, Minister, Rebel, and Traitor respectively.)<br>Then the third line contains a real number P(0&lt;P&lt;1).","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output the number of case and the win probability of the 4 roles.Answers are rounded to 3 numbers after the decimal point.(as shown in the sample output)","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\n0 1 2 3\n0.5\n4\n0 3 2 1\n0.5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\nLord and Minister:0.549\nRebel:0.334\nTraitor:0.118\nCase 2:\nLord and Minister:0.501\nRebel:0.334\nTraitor:0.166</div></pre>","type":"example","format":"html"},{"title":"Author","content":"NotOnlySuccess","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Alibaba+Programming+Contest&amp;source=1&amp;searchmode=source\"> 2011 Alibaba Programming Contest </a> ","type":"source","format":"html"}]}