{"title":"Crisis","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=3961","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=3961&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=3961","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=3961"},"statement":[{"title":"Problem Description","content":"Warning! Warning! The new round of sunspot radiation is now coming and that put the life of all creatures on the earth in great danger. In order to protect our mother earth, the Association of Cosmos Monitoring(ACM) has decided to build a huge barrier floating in the sky to block the radiation. Since the earth is extremely large and the barrier may not be able to cover the whole planet, the ACM wants to know how many areas will still be under the radiation so that they could evacuate the people in those areas. <br><center><img style=\"max-width:100%;\" src=\"../../data/images/3961-1.jpg\"></center> <br>To simplify the problem, you may assume the earth, the barrier and the sun are in the same 2D plane. The sun is considered as a point radiation source. The barrier is a simple polygon which has N endpoints and the earth is a circle. As we all know, to keep a huge barrier on the sky against the gravity, the barrier has to do uniform circular motion surround the earth. Also the barrier itself rotates surround its gravity center at a certain speed. <br><center><img style=\"max-width:100%;\" src=\"../../data/images/3961-2.jpg\"></center> <br>You need pay attention to the next points:<br><br>The revolution and rotation are both anticlockwise.<br><br>There is always a line dividing the plane into two half-plane, making the barrier in one, and the earth in the other.<br><br>The sun is exactly out of the barrier and the earth at any time.<br><br>The revolution is translational motion.<br><br>To calculate the movement of the huge barrier is very difficult, so the ACM needs you to write a program to calculate this problem and heal the world. Given the current location of the sun, the earth and the barrier, the periods of the barrier traveling around the earth and its rotation, and the time when the radiation outbreak from now, the ACM wants you to tell them the arc length of the areas which are under radiation. ","type":"description","format":"html"},{"title":"Input","content":"Input contains several test cases (&#x2264;1000). The first line of each case contains 5 integer numbers Xs, Ys, Xe, Ye, Re. (Xs, Ys) is the coordinate of the sun (-10000 &#x2264; x, y, r &#x2264; 10000, similarly hereinafter), (Xe, Ye) is the coordinate of the earth&apos;s core, Re indicate the radius of the earth.<br><br>The second line of the input contains 4 integer numbers N (&#x2264;100), T1, T2, T. N indicate the number of the barrier&apos;s endpoints, T1 is the barrier&apos;s period of revolution, T2 is the barrier&apos;s rotation period, T is the time when the radiation outbreak from now. The next N lines, each line consists of two integers xi and yi indicate the coordinate of the i-th endpoint of the barrier, and the endpoints will be given by the clockwise or anticlockwise order. ","type":"input_format","format":"html"},{"title":"Output","content":"For each case, print the the arc length of the areas which are under radiation when the radiation outbreak. Any answer with absolute error smaller than 0.01 is acceptable. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-11 -6 9 7 9\n7 100 120 0\n-5 -3\n-3 -4\n-1 -3\n-1 -2\n-2 -1\n-3 0\n-4 -1\n-11 -6 9 7 9\n7 100 120 95\n-5 -3\n-3 -4\n-1 -3\n-1 -2\n-2 -1\n-3 0\n-4 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">13.93\n13.45</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Multi-University+Training+Contest+13+-+Host+by+HIT+&amp;source=1&amp;searchmode=source\"> 2011 Multi-University Training Contest 13 - Host by HIT  </a> ","type":"source","format":"html"}]}