{"title":"The war","time_limit":1000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4005","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4005&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4005","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4005"},"statement":[{"title":"Problem Description","content":"In the war, the intelligence about the enemy is very important. Now, our troop has mastered the  situation  of  the  enemy&apos;s  war  zones,  and  known  that  these  war  zones  can  communicate  to each other directly or indirectly through the network. We also know the enemy is going to build a new communication line to strengthen their communication network. Our task is to destroy their communication  network,  so  that  some  of  their  war  zones  can&apos;t  communicate.  Each  line  has  its &quot;cost of destroy&quot;. If we want to destroy a line, we must spend the &quot;cost of destroy&quot; of this line. We want to finish this task using the least cost, but our enemy is very clever. Now, we know the network  they have  already built,  but  we know  nothing  about  the  new  line  which our  enemy  is going to build. In this condition, your task is to find the minimum cost that no matter where our enemy builds the new line, you can destroy it using the fixed money. Please give the minimum cost. For efficiency, we can only destroy one communication line. ","type":"description","format":"html"},{"title":"Input","content":"The input contains several cases. For each cases, the first line contains two positive integers n,  m  (1&lt;=n&lt;=10000,  0&lt;=m&lt;=100000)  standing  for  the  number  of  the  enemy&apos;s  war  zones (numbered from 1 to n), and the number of lines that our enemy has already build. Then m lines follow. For each line there are three positive integer a, b, c (1&lt;=a, b&lt;=n, 1&lt;=c&lt;=100000), meaning between war zone A and war zone B there is a communication line with the &quot;cost of destroy &quot; c. ","type":"input_format","format":"html"},{"title":"Output","content":"For each case, if the task can be finished output the minimum cost, or output &#x2010;1. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2\n1 2 1\n2 3 2\n4 3\n1 2 1\n1 3 2\n1 4 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1\n3\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>For the second sample input: our enemy may build line 2 to 3, 2 to 4,\n\n3 to 4. If they build line 2 to 3, we will destroy line 1 to 4, cost 3. If they\n\nbuild line 2 to 4, we will destroy line 1 to 3, cost 2. If they build line 3 to 4,\n\nwe will destroy line 1 to 2, cost 1. So, if we want to make sure that we can\n\ndestroy successfully, the minimum cost is 3. </div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Dalian+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Dalian Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html"}]}