{"title":"Transfer water","time_limit":3000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4009","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4009&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4009","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4009"},"statement":[{"title":"Problem Description","content":"XiaoA lives in a village. Last year flood rained the village. So they decide to move the whole village to the mountain nearby this year. There is no spring in the mountain, so each household could only dig a well or build a water line from other household. If the household decide to dig a well,  the  money  for  the  well  is  the  height  of  their  house  multiplies  X  dollar  per  meter.  If  the household decide to build a water line from other household, and if the height of which supply water is not lower than the one which get water, the money of one water line is the Manhattan distance  of  the  two  households  multiplies  Y  dollar  per  meter.  Or  if  the  height  of  which  supply water is lower than the one which get water, a water pump is needed except the water line. Z dollar should be paid for one water pump. In addition,therelation of the households must be considered. Some households may do not allow some other households build a water line from there house. Now  given  the  3&#xFFFD;\\dimensional  position (a,  b,  c)  of  every  household  the  c  of  which  means height, can you calculate the minimal money the whole village need so that every household has water, or tell the leader if it can&#xFFFD;&#xFFFD;t be done. ","type":"description","format":"html"},{"title":"Input","content":"Multiple cases. <br>First line of each case contains 4 integers n (1&lt;=n&lt;=1000), the number of the households, X (1&lt;=X&lt;=1000), Y (1&lt;=Y&lt;=1000), Z (1&lt;=Z&lt;=1000). <br>Each of the next n lines contains 3 integers a, b, c means the position of the i&#xFFFD;\\th households, none of them will exceeded 1000. <br>Then next n lines describe the relation between the households. The n+i+1&#xFFFD;\\th line describes the relation of the i&#xFFFD;\\th household. The line will begin with an integer k, and the next k integers are the household numbers that can build a water line from the i&#xFFFD;\\th household. <br>If n=X=Y=Z=0, the input ends, and no output for that. <br>","type":"input_format","format":"html"},{"title":"Output","content":"One  integer  in  one  line  for  each  case,  the  minimal  money  the  whole  village  need  so  that every household has water. If the plan does not exist, print &#xFFFD;&#xFFFD;poor XiaoA&#xFFFD;&#xFFFD; in one line. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 10 20 30\n1 3 2\n2 4 1\n1 2\n2 1 2\n0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">30\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In  3&#xFFFD;\\dimensional  space  Manhattan  distance  of  point  A  (x1,  y1,  z1)  and  B(x2,  y2,  z2)  is |x2&#xFFFD;\\x1|+|y2&#xFFFD;\\y1|+|z2&#xFFFD;\\z1|. \n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Dalian+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Dalian Site &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; Online Contest </a> ","type":"source","format":"html"}]}