{"title":"Query on The Trees","time_limit":5000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4010","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4010&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4010","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4010"},"statement":[{"title":"Problem Description","content":"We have met so many problems on the tree, so today we will have a query problem on a set of trees. <br>There  are  N  nodes,  each  node  will  have  a  unique  weight  Wi.  We  will  have  four  kinds  of operations on it and you should solve them efficiently. Wish you have fun! <br><br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases in our dataset. <br>For each case, the first line contains only one integer N.(1  &#x2264;  N  &#x2264;  300000) The next N&#x2010;1 lines each contains two integers x, y which means there is an edge between them. It also means we will give you one tree initially. <br>The next line will contains N integers which means the weight Wi of each node. (0  &#x2264;  Wi &#x2264;  3000) <br>The next line will contains an integer Q. (1  &#x2264;  Q  &#x2264;  300000) The next Q lines will start with an integer 1, 2, 3 or 4 means the kind of this operation. <br>1. Given two integer x, y, you should make a new edge between these two node x and y. So after this operation, two trees will be connected to a new one. <br>2. Given two integer x, y, you should find the tree in the tree set who contain node x, and you should make the node x be the root of this tree, and then you should cut the edge between node y and its parent. So after this operation, a tree will be separate into two parts. <br>3. Given three integer w, x, y, for the x, y and all nodes between the path from x to y, you should increase their weight by w. <br>4. Given two integer x, y, you should check the node weights on the path between x and y, and you should output the maximum weight on it. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each query you should output the correct answer of it. If you find this query is an illegal operation, you should output &#x2010;1. <br>You should output a blank line after each test case. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n1 2\n2 4\n2 5\n1 3\n1 2 3 4 5\n6\n4 2 3\n2 1 2\n4 2 3\n1 3 5\n3 2 1 4\n4 1 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n-1\n7\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nWe define the illegal situation of different operations: \nIn first operation: if node x and y belong to a same tree, we think it&apos;s illegal. \nIn second operation: if x = y or x and y not belong to a same tree, we think it&apos;s illegal. \nIn third operation: if x and y not belong to a same tree, we think it&apos;s illegal. \nIn fourth operation: if x and y not belong to a same tree, we think it&apos;s illegal. \n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Dalian+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Dalian Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html","require":["katex"]}]}