{"title":"Batch System","time_limit":5000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4019","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4019&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4019","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4019"},"statement":[{"title":"Problem Description","content":"Large distributed data center so-called &#x201C;bigtable&#x201D; receives a huge number of update queries every minute from servers all over the world. The engineers want to make the system works more efficiency, so they come up with a batch system for bigtable.<br>We can denote the data in the bigtable as an infinity text data. Every client can send commands to the bigtable server to editing the text. Once the client connects to the bigtable server, the cursor for the client is positioned before the first character of the text before performing any commands. The bigtable only supports three operations below:<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C368-1009-1.jpg\"></center> <br>When a new client connects the server, it sends all the operations to the bigtable. And then the next client can connect and perform its own operation list.<br>&#xA0;&#xA0;The batch system is designed to save the traffic volume. It merges all the clients operation together to one equivalent operation list. But their engineers soon noticed that it is hard to make the resulted operation list shortest.<br>&#xA0;&#xA0;They ask you, their senior programmer, to make up a solution, give the operation lists with minimum length and let the delete operations before the insert operations if possible.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains the number of test cases. The description of T tests follow.<br>&#xA0;&#xA0;The first line of each test case contains the amount of clients n (1 &lt;= n &lt;= 10000). You can assume the client comes exactly in the order of the input. <br>The description of operation list of each client follows. The first line of each operation list contains the number of operations m first (1 &lt;= m &lt;= 10). The next m lines contain the description of each operation in the format given above. 1 &lt;= k &lt;= 100000 for R and D operations, and 1 &lt;= k &lt;= 10 for C operations. The strings in C operations consist of latin letters and digits only.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case your program should print the result of batch system. The format of the command should be the same as the input file, except the limitations of m and k. The result should contain the least possible number of operations. The delete operations should precede the insert operations if possible. If the result contains no operations, just print 0 instead.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\n4\nR 4\nC 3 abc\nR 2\nC 3 xyz\n3\nR 7\nC 3 def\nD 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\nR 4\nD 2\nC 8 abcdefyz</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Shanghai+Site+%A1%AA%A1%AA+Warmup&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Shanghai Site &#x2014;&#x2014; Warmup </a> ","type":"source","format":"html","require":["katex"]}]}