{"title":"Bombing","time_limit":2000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4022","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4022&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4022","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4022"},"statement":[{"title":"Problem Description","content":"It&#xFFFD;&#xFFFD;s a cruel war which killed millions of people and ruined series of cities. In order to stop it, let&#xFFFD;&#xFFFD;s bomb the opponent&#xFFFD;&#xFFFD;s base.<br>It seems not to be a hard work in circumstances of street battles, however, you&#xFFFD;&#xFFFD;ll be encountered a much more difficult instance: recounting exploits of the military. In the bombing action, the commander will dispatch a group of bombers with weapons having the huge destructive power to destroy all the targets in a line. Thanks to the outstanding work of our spy, the positions of all opponents&#xFFFD;&#xFFFD; bases had been detected and marked on the map, consequently, the bombing plan will be sent to you.<br>Specifically, the map is expressed as a 2D-plane with some positions of enemy&#xFFFD;&#xFFFD;s bases marked on. The bombers are dispatched orderly and each of them will bomb a vertical or horizontal line on the map. Then your commanded wants you to report that how many bases will be destroyed by each bomber. Notice that a ruined base will not be taken into account when calculating the exploits of later bombers.<br>","type":"description","format":"html"},{"title":"Input","content":"Multiple test cases and each test cases starts with two non-negative integer N (N&lt;=100,000) and M (M&lt;=100,000) denoting the number of target bases and the number of scheduled bombers respectively. In the following N line, there is a pair of integers x and y separated by single space indicating the coordinate of position of each opponent&#xFFFD;&#xFFFD;s base. The following M lines describe the bombers, each of them contains two integers c and d where c is 0 or 1 and d is an integer with absolute value no more than 10<sup>9</sup>, if c = 0, then this bomber will bomb the line x = d, otherwise y = d. The input will end when N = M = 0 and the number of test cases is no more than 50.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output M lines, the ith line contains a single integer denoting the number of bases that were destroyed by the corresponding bomber in the input. Output a blank line after each test case.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2\n1 2\n1 3\n2 3\n0 1\n1 3\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Shanghai+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Shanghai Site &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; Online Contest </a> ","type":"source","format":"html"}]}