{"title":"Dwarven Sniper’s hunting","time_limit":1000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4024","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4024&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4024","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4024"},"statement":[{"title":"Problem Description","content":"Now the hunting starts in the world named DOTA, a stupid PC game which cannot play with others together.<br>Among the individuals in the game, there are two heroes named Dwarven Sniper and Lycanthrope. Lycanthrope wants to escape from being captured; however, our Dwarven Sniper won&#x2019;t let him go! He will use the Silver Bullet to kill the Lycanthrope by only one shot! Yes, that&#x2019;s enough.<br>&#xA0;&#xA0;Lycanthrope is running on a line in the map with a constant speed and direction. The weapon range of the Silver Bullet is limited by L meters. Dwarven Sniper can run for a while freely, and then shoot Lycanthrope. In order to show his excellent shooting skill, Dwarven Sniper wants the Silver Bullet flying as far as possible. But don&#x2019;t forget the flying time of the Silver Bullet due to considerable weight of the bullet. And Dwarven Sniper wants to stop the hunting as quickly as possible. So if there is more than one way to show his excellent skill, he would choose the fastest way. In this problem we consider the Silver Bullet and Lycanthrope as two points.<br>    Now Dwarven Sniper wants to know the maximum length that the Silver Bullet can fly, and the shortest time that the hunting lasts. Specifically, the total hunting time is defined as the time interval from the start of hunting to the moment that the bullet hit Lycanthrope. Can you help him?<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C347-1004-1.jpg\"></center> ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases. Each of them contains only one line which consist of 9 real numbers, that are X1, Y1, X2, Y2, Lx, Ly, vD , vB and L (-10000 &lt;= X1 , Y1 , X2 , Y2 , Lx , Ly &lt;= 10000 , 0 &lt;= vD , vB , L &lt;=100000).<br>The pair (X1, Y1) is the starting position of the Lycanthrope while (X2, Y2) is the starting position of Dwarven Sniper.<br>&#xA0;&#xA0;(Lx, Ly) is the moving vector per second of the Lycanthrope. <br>vD is the speed of the Dwarven Sniper .<br>vB is the speed of the Silver Bullet.<br>All units are meters/second.<br>It is guaranteed that (Lx*Lx+Ly*Ly) &lt; vD*vD &lt; vB*vB , and Dwarven Sniper&#x2019;s starting position is different from Lycanthrope&#x2019;s position. The input ends with a line containing all zeros.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output two real numbers S and T in a line separated by a single space denoting that the Silver bullet flies S meters before hitting Lycanthrope and the hunting lasts for T seconds, both with 3 digits after the decimal point.<br>&#xA0;&#xA0;You may assume that Dwarven Sniper can finish his hunting within no more than 1e+9 seconds.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1 0 0 10 1 0 2 10 10\n0 0 0 5 0 1 2 6 6\n0 0 0 0 0 0 0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10.000 1.000\n6.000 3.000</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Shanghai+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Shanghai Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html","require":["katex"]}]}