{"title":"Unlock the Cell Phone","time_limit":3000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4026","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4026&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4026","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4026"},"statement":[{"title":"Problem Description","content":"Modern high-tech cell phones use unlock patterns to unlock the system. The pattern is usually a 3*3 dot array. By moving your finger over there dots, you can generate your personal unlock pattern. More specifically, press your finger over any starting dot, then slide all the way to the next dot, touch it, and so on. Jumping is not allowed. For example, starting from dot 1, you can slide to touch dot 2, dot 4 and dot 5, but sliding directly to dot 3, dot 7 or dot 9 are not allowed. Note that sliding from 1 to 6 and 8 is also allowed because they are not considered as jumping over any dot. However, you can jump a dot if it has been touched before. For example, staring with 1-5-9-6, you can slide directly to dot 4.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C347-1006-1.jpg\"></center> <br>Here is a very particular cell phone. It has a dot array of size n*m. Some of the dots are ordinary ones: you can touch, and slide over them when touched before; some are forbidden ones: you cannot touch or slide over them; some are inactive ones: you cannot touch them, but can slide over them. Each dot can only be touched once. You are required to calculate how many different unlock patterns passing through all the ordinary dots.","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. Each test case begins with a line containing two integers n and m (1 &lt;= n, m &lt;= 5), indicating the row and column number of the lock keypad. The following n lines each contains m integers kij indicating the properties of each key, kij=0 stands for an ordinary key, kih=1 stands for a forbidden key; and kij=2 stands for an inactive key. The number of ordinary keys is greater than zero and no more than 16.","type":"input_format","format":"html"},{"title":"Output","content":"For each test, output an integer indicating the number of different lock patterns.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2\n0 0\n0 0\n3 3\n0 0 0\n0 2 1\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">24\n2140</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Shanghai+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Shanghai Site &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; Online Contest </a> ","type":"source","format":"html"}]}