{"title":"Can you answer these queries?","time_limit":2000,"memory_limit":64.2265625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4027","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4027&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4027","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4027"},"statement":[{"title":"Problem Description","content":"A lot of battleships of evil are arranged in a line before the battle. Our commander decides to use our secret weapon to eliminate the battleships. Each of the battleships can be marked a value of endurance. For every attack of our secret weapon, it could decrease the endurance of a consecutive part of battleships by make their endurance to the square root of it original value of endurance. During the series of attack of our secret weapon, the commander wants to evaluate the effect of the weapon, so he asks you for help.<br>You are asked to answer the queries that the sum of the endurance of a consecutive part of the battleship line.<br><br><font color=\"red\">Notice that the square root operation should be rounded down to integer.</font>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases, terminated by EOF.<br>&#xA0;&#xA0;For each test case, the first line contains a single integer N, denoting there are N battleships of evil in a line. (1 &lt;= N &lt;= 100000)<br>&#xA0;&#xA0;The second line contains N integers Ei, indicating the endurance value of each battleship from the beginning of the line to the end. You can assume that the sum of all endurance value is less than 2<sup>63</sup>.<br>&#xA0;&#xA0;The next line contains an integer M, denoting the number of actions and queries. (1 &lt;= M &lt;= 100000)<br>&#xA0;&#xA0;For the following M lines, each line contains three integers T, X and Y. The T=0 denoting the action of the secret weapon, which will decrease the endurance value of the battleships between the X-th and Y-th battleship, inclusive. The T=1 denoting the query of the commander which ask for the sum of the endurance value of the battleship between X-th and Y-th, inclusive.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the case number at the first line. Then print one line for each query. And remember follow a blank line after each test case.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10\n1 2 3 4 5 6 7 8 9 10\n5\n0 1 10\n1 1 10\n1 1 5\n0 5 8\n1 4 8</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n19\n7\n6</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Shanghai+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Shanghai Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html"}]}