{"title":"Eliminate Witches!","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4041","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4041&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4041","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4041"},"statement":[{"title":"Problem Description","content":"Kaname Madoka is a Magical Girl(Mahou Shoujo/Puella Magi). The duty of a Magical Girl is to eliminate Witches(Majo). Though sounds horrific, it is not a hard job for her as a powerful magical girl. <br><br>One day Madoka is eliminating Witches as usual. This time she is facing a maze full of Witches. The maze consists of rooms, each lives exactly one Witch. And there is exactly one path from one room to another. So you see, the maze can be represented as a tree, with rooms regarded as nodes on the tree. <br><br>Madoka eliminates Witches according to the following rules: <br>1. At first, Madoka enters the root node room of the maze. <br>2. If the room Madoka enters lives a Witch, Madoka will eliminate it at once, and the Witch disappear. <br>3. If the room has child node rooms with Witches, Madoka will choose the leftmost one and enter it. <br>4. Madoka won&apos;t go back to the parent node room of a room X until Witches living in child node rooms of X are all eliminated. <br><br>See the figure below for details about a sample maze. The numbers inside nodes indicate the order of elimination of the corresponding Witches, the strings below nodes are names of Witches, and the arrow shows the tracks Madoka travels: <br><center><img style=\"max-width:100%;\" src=\"../../data/images/4041.jpg\"></center>  <br>After finishes her task, Madoka just make a brief log like this: <br>&quot;walpurgis(charlotte(patricia,gertrud),elly,gisela)&quot; <br>which represents the tree-like maze identifying rooms by the names of Witches living in them. <br><br>Akemi Homura, a classmate of Madoka, also a Magical Girl, is a mad fan of her. She wants to take detailed notes of everything Madoka do! Apparently the log Madoka made is hard to read, so Homura decide to make a new one of her own. <br><br>The new log should contain the following information: <br>1. The number of rooms of the maze <br>2. Names of Witches in all rooms. <br>3. The tracks Madoka travels. (represented by the number identifying the node) <br><br>So the new log should be like this: <br>6 <br>walpurgis <br>charlotte <br>patricia <br>gertrud <br>elly <br>gisela <br>1 2 <br>2 3 <br>3 2 <br>2 4 <br>4 2 <br>2 1 <br>1 5 <br>5 1 <br>1 6 <br>6 1 <br><br>However, the maze may be very large, so Homura nees a program to help her. <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer T(T&lt;=20), indicating the number of test cases. <br>For each case there is only one string on a line, Madoka&apos;s log. <br>It is guaranteed that the maze consists of at most 50000 rooms, and the names of Witches is a string consists of at most 10 lowercase characters, while the string of Madoka&apos;s log consists of at most 1000000 characters, which are lowercase characters, &apos;(&apos;, &apos;)&apos; or &apos;,&apos;. <br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, you should output the detailed log. <br>The first line an integer N, the number of rooms of the maze. <br>The following N lines, each line a string, the name of the Witches, in the order of elimination. <br>The following 2(N-1) lines, each line two integers, the number of two nodes indicating the path Madoka passes. <br>Output a blank line after each case. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 \nwalpurgis(charlotte(patricia,gertrud),elly,gisela) \nwuzetian \nnanoha(fate(hayate)) </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 \nwalpurgis \ncharlotte \npatricia \ngertrud \nelly \ngisela \n1 2 \n2 3 \n3 2 \n2 4 \n4 2 \n2 1 \n1 5 \n5 1 \n1 6 \n6 1 \n\n1 \nwuzetian \n\n3 \nnanoha \nfate \nhayate \n1 2 \n2 3 \n3 2 \n2 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Beijing+Site+%A1%AA%A1%AA+Online+Contest+&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Beijing Site &#x2014;&#x2014; Online Contest  </a> ","type":"source","format":"html","require":["katex"]}]}