{"title":"Fireworks","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4042","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4042&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4042","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4042"},"statement":[{"title":"Problem Description","content":"2008 witnessed the magnificent opening ceremony of the 29th Beijing Olympic Games. The gorgeous fireworks shows during the ceremony have left deep impressions on millions of people all over the world.<br><br>Fireworks are always used to accompany many festivities. Today, in important events and festivities, fireworks are still guaranteed sights.<br><br>Recently, a new advanced device for generating fireworks is put into use. This device can precisely control the shapes and the positions and the colors of fireworks easily and arbitrarily. To use this device, we just need to set up its range of targets, as well as the appearances of fireworks. However, this kind of devices have a fatal flaw - if two or more devices have common part(s) in their ranges of targets, even just a point, it may cause some unpredictable errors, and finally result in unexpected appearances.<br><br>Now here comes your task: given the target ranges of two devices, please determine whether they have common part(s).<br><br>Note that the target range of a device will always be a none hole and none self-intersecting polygon on a plane, and the edges are considered as a part of the range. To simplify the problem, it&#x2019;s guaranteed that interior angles of polygon will never be straight angles.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains multiple test cases, and the number of test cases is less than 50. <br>Each test case begins with two integers, m and n (3 &lt;= m, n &lt;= 500), indicating the numbers of the vertices of the ranges of two devices. Then m + n lines follow. Each line contains three float numbers (no more than 1000 in absolute value) indicating the coordinates of a point in 3D space. The first m points are the vertices of the range of the first device, and the other n points are the vertices of the range of the second device. The vertices of both polygonal ranges are given in clockwise order. <br><br>Two consecutive cases are separated by a blank line.<br><br>The input ends with m = 0 and n = 0<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, there should be a single line containing only one word &quot;YES&quot; or &quot;NO&quot; as the answer to the question: Are the ranges of two devices have common part(s)?<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3\n3 3 0\n7 8 0\n8 7 0\n10 0 0\n5 3 -1\n3 2 9\n1 8 7\n\n4 3\n3 3 0\n7 8 0\n8 7 0\n10 0 0\n5 5 1\n3 2 9\n1 8 7\n\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">YES\nNO</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Beijing+Site+%A1%AA%A1%AA+Online+Contest+&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Beijing Site &#x2014;&#x2014; Online Contest  </a> ","type":"source","format":"html","require":["katex"]}]}