{"title":"Raining","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4047","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4047&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4047","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4047"},"statement":[{"title":"Problem Description","content":"There are N mountains represented by N Isosceles triangles above ground. We can assume that every adjacent mountain can shape a valley. When it rains, the rain will form a plane in the valley. Now let&apos;s make things a little easier by drawing the vertical profile of the actual mountains. You can get more details from the below figure.<br><br>When it rains, the quantity of water is proportional to the time that is raining and the length of the plane by which some valley can receive the water (in the figure 1, &#x201C;l1&#x201D; is the length of the plane). In the figure 1, v means the velocity of the rain (please see the figure for more details for the formula of the rain). If a valley is filled with rain, the water will overflow. According to the shape of the mountain, the water may flow to the left, or to the right. You can assume that the height of the different mountains are different. This outflow of water will fill the valley next to the current valley. You can get the more details from the Figure 2. <br>&#xA0;&#xA0;<br>You will get the information of the mountain. Please output the time during  which the mountains can be filled by the rain. After the time, the quantity of the  water will not increase even if it still rains. <br><center><img style=\"max-width:100%;\" src=\"../../data/images/4047-1.png\"></center> <br><center><img style=\"max-width:100%;\" src=\"../../data/images/4047-2.png\"></center> <br><center><img style=\"max-width:100%;\" src=\"../../data/images/4047-3.png\"></center> <br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of an input file consists of a single number denoting the number of test cases in the file. The number of cases is not more than 20. <br>&#xA0;&#xA0;For each test case, the input format is as follows. The first line gives two integers N and V( 1&lt;=N&lt;=5000,  20&lt;=V&lt;=200). N is the number of the mountains and V is the velocity of the rain. For the next n lines, the ith line gives three integers Li, Ri, Hi( 0&lt;=Li&lt;Ri&lt;=10^9, 1&lt;=Hi&lt;=2500000, i=1, 2, ... , N). li is the coordinate of the left bottom point of the ith mountain. And the ri is the right one.  hi is the height of the ith mountain. You can assume that Li&lt;=Ri-1.We guarantee that the valley exists between every two adjacent mountains. You can assume that the left coordinate of the i+1th mountain is strictly larger than the corresponding one of the ith mountain. Please mind that there may be such conditions like the figure 3.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the time we need. The number must be printed with 3 decimal digits. (The number must be rounded up or down according to the usual rounding rules. <br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n\n2 3\n0 2 1\n1 5 2\n\n5 3\n0 26 37\n17 59 35\n48 81 79\n77 123 77\n106 212 33</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.042\n11.384</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Beijing+Site+%A1%AA%A1%AA+Online+Contest+&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Beijing Site &#x2014;&#x2014; Online Contest  </a> ","type":"source","format":"html","require":["katex"]}]}