{"title":"Tourism Planning","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4049","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4049&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4049","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4049"},"statement":[{"title":"Problem Description","content":"Several friends are planning to take tourism during the next holiday. They have selected some places to visit. They have decided which place to start their tourism and in which order to visit these places. However, anyone can leave halfway during the tourism and will never back to the tourism again if he or she is not interested in the following places. And anyone can choose not to attend the tourism if he or she is not interested in any of the places. <br>Each place they visited will cost every person certain amount of money. And each person has a positive value for each place, representing his or her interest in this place. To make things more complicated, if two friends visited a place together, they will get a non negative bonus because they enjoyed each other&#x2019;s companion. If more than two friends visited a place together, the total bonus will be the sum of each pair of friends&#x2019; bonuses.<br>Your task is to decide which people should take the tourism and when each of them should leave so that the sum of the interest plus the sum of the bonuses minus the total costs is the largest. If you can&#x2019;t find a plan that have a result larger than 0, just tell them to STAY HOME.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several cases. Each case starts with a line containing two numbers N and M ( 1&lt;=N&lt;=10, 1&lt;=M&lt;=10). N is the number of friends and M is the number of places. The next line will contain M integers Pi (1&lt;=i&lt;=M) , 1&lt;=Pi&lt;=1000, representing how much it costs for one person to visit the ith place. Then N line follows, and each line contains M integers Vij (1&lt;=i&lt;=N, 1&lt;=j&lt;=M), 1&lt;=Vij&lt;=1000, representing how much the ith person is interested in the jth place. Then N line follows, and each line contains N integers Bij (1&lt;=i&lt;=N, 1&lt;=j&lt;=N), 0&lt;=Bij&lt;=1000, Bij=0 if i=j, Bij=Bji.<br>A case starting with 0 0 indicates the end of input and you needn&#x2019;t give an output.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, if you can arrange a plan lead to a positive result, output the result in one line, otherwise, output STAY HOME in one line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1\n10\n15\n5\n0 5\n5 0\n3 2\n30 50\n24 48\n40 70\n35 20\n0 4 1\n4 0 5\n1 5 0\n2 2\n100 100\n50 50\n50 50\n0 20\n20 0\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n41\nSTAY HOME</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Beijing+Site+%A1%AA%A1%AA+Online+Contest+&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Beijing Site &#x2014;&#x2014; Online Contest  </a> ","type":"source","format":"html"}]}