{"title":"The Last Puzzle","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4053","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4053&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4053","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4053"},"statement":[{"title":"Problem Description","content":"There is one last gate between the hero and the dragon. But opening the gate isn&apos;t an easy task.<br><br>There were n buttons list in a straight line in front of the gate and each with an integer on it. Like other puzzles the hero had solved before, if all buttons had been pressed <br>down in any moment, the gate would open. So, in order to solve the puzzle, the hero must press all the button one by one.<br><br> After some trials, the hero found that those buttons he had pressed down would pop up after a while before he could press all the buttons down. He soon realized that <br>the integer on the button is the time when the button would automatic pop up after pressing it, in units of second. And he measured the distance between every button<br> and the first button, in units of maximum distance the hero could reach per second. Even with this information, the hero could not figure out in what order he should <br>press the buttons. So you talent programmers, are assigned to help him solve the puzzle.<br><br>To make the puzzle easier, assuming that the hero always took integral seconds to go from one button to another button and he took no time turnning around or pressing <br>a button down. And the hero could begin from any button.<br>","type":"description","format":"html"},{"title":"Input","content":"The input file would contain multiple cases. Each case contains three lines. Process to the end of file.<br><br>The first line contains a single integer n(1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD;200), the number of buttons.<br><br>The second line contains n integers T<sub>1</sub>, T<sub>2</sub>, ..., T<sub>n</sub>, where T<sub>i</sub>(1 &#xFFFD;&#xFFFD; T<sub>i</sub> &#xFFFD;&#xFFFD; 1,000,000) is the time the i<sub>th</sub> button would automatic pop up after pressing it, in units of second.<br><br>The third line contains n integers D<sub>1</sub>, D<sub>2</sub>, ..., D<sub>n</sub>, where D<sub>i</sub>(1 &#xFFFD;&#xFFFD; D<sub>i</sub> &#xFFFD;&#xFFFD; 1,000,000) is the time hero needed to go between the ith button and the first button, in units of second. <br>The sequence will be in ascending order and the first element is always 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Output a single line containing n integers which is the sequence of button to press by the hero. If there are multiply sequences, anyone will do. If there is no way for the <br>hero to solve the puzzle, just output &quot;Mission Impossible&quot;(without quote) in a single line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4 3\n0 3\n2\n3 3\n0 3\n4\n5 200 1 2\n0 1 2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2\nMission Impossible\n1 2 4 3\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the second sample, no matter which button the hero pressed first, the button would always pop up before he press the other button. So there is no way to make all\n the button pressed down.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Author","content":"WANG, Yelei","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Dalian+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2011 Asia Dalian Regional Contest </a> ","type":"source","format":"html"}]}