{"title":"Chess Board","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4060","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4060&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4060","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4060"},"statement":[{"title":"Problem Description","content":"allis Brook and Helen Heather like playing chess. Today they are not going to play chess buthave a competition on drawing a chess board. The chess board they used are a bit different from the ordinary one. The chess board consist of n rows and each row has m white square cells of the same size. Adjacent cells are seperated with a black border. There are also black borders on the edge of the chess board. Each border has the same width. The following figure shows how the chess board looks like. To make it like a chess board more, it is also constrained that the length of the cell should be no shorter than the width of the border, i.e. a &#x2265; b.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/4060-1.gif\"></center> <br>Now they are given a black-and-white image. They are going to make it a chess board as mentioned above. They both want to finish it faster than the other one. <br><br>In order to win the competition, Vallis managed to know how Helen would draw the chess board. Each time, Helen can draw a rectangle with one color and all the pixels in the rectangle will be painted with that color. He needs time T to draw one rectangle. In addition, he will only paint each pixel with the target color. That is to say, there will be no pixel to be painted multiple times with different colors. Because Vallis is busy drawing the chess board pixel by pixel, he ask you to help him calculate the minimum time for Helen to finish the job. <br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. The first line of each test case contains five integers H, W, n, m and T (3 &#x2264; H, W &#x2264; 2000, 1 &#x2264; n, m &#x2264; 200, 0 &lt; T &#x2264; 1000), indicating the height and the width of the image, the numbers of rows and columns and the time Helen needs to draw a rectangle. Then H lines follows, each of which contains W 0 or 1, indicating the image. 0 means the color of that pixel is black and 1 means white. <br>","type":"input_format","format":"html"},{"title":"Output","content":"Output the minimum time Helen needs to finish the chess board if it is possible to draw one. Otherwise, output -1 instead. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 5 1 2 1\n00000\n01110\n01110\n5 7 1 2 1\n0000000\n0000000\n0000000\n0000000\n0000000</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n-1</div></pre>","type":"example","format":"html"},{"title":"Author","content":"GUAN, Yao","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Dalian+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2011 Asia Dalian Regional Contest </a> ","type":"source","format":"html"}]}