{"title":"A Card Game","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4061","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4061&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4061","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4061"},"statement":[{"title":"Problem Description","content":"There are N cards on the table, whose front side is writen one integer number from 1 to M. We call one card &quot;a type k card&quot; if its number is k. The quantity of type i cards is a_i. <br>Let&apos;s play a game with these cards. We divide these cards into M piles by random with the only constrains that the quantity of cards in i-th (indexed from 1) pile must exactly be a_i. The possbility of each card appears in i-th pile is directly proportional to the size of this pile. That is to say, if the size of a pile is A, the possibility for each card appears in this pile is A/N assuming that N is the amount of all cards. We choose pile 1 to start the game. Assuming the we now play this game at pile k, we randomly choose a card from pile k with the same possibility for all cards in it, remember the number written on this card and throw it away. If the number on the chosen card is j, we continue this game at pile j on next round. The game terminates when we are going to get a card from an empty pile.<br><br>Now the question is, when the game ends, what is the possibility that all piles are empty?<br>","type":"description","format":"html"},{"title":"Input","content":"There is only one input file. The first line is the number of test cases T. T cases follow, each of which contains two lines. The first line is an integer M (1 &lt;= M &lt;= 100), the number of type of cards (and the number of piles, they are exactly the same). The second line contains M positive integers not greater than 1000, the i-th number of which is a_i.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the possibility you are required to calculate. Answers are rounded to 6 numbers after the decimal point.(as shown in the sample output)<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n5\n2\n1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1.000000\nCase 2: 0.333333</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+36th+ACM%2FICPC+Asia+Regional+Fuzhou+Site+%A1%AA%A1%AA+Online+Contest&amp;source=1&amp;searchmode=source\"> The 36th ACM/ICPC Asia Regional Fuzhou Site &#x2014;&#x2014; Online Contest </a> ","type":"source","format":"html"}]}