{"title":"Happy Telephones","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4079","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4079&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4079","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4079"},"statement":[{"title":"Problem Description","content":"In the land of Eden, all phone conversations are happy ones. People complaining on the phone are immediately put in jail. To enforce this law, the police taps all phone conversations. <br>The police wants to hire the approriate number of operators to listen to all conversations in a given period of time. Unfortunately, each of their operators can listen to one conversation only before needing a really long break to rest from the effort. <br>As a contractor of the police department, you have been asked to provide a program capable of determining the required number of operators. If the program does not work correctly, you will be put in jail as well, along with all the unhappy complainers. Do you really want to end up there?<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C297-1009-1.jpg\"></center> ","type":"description","format":"html"},{"title":"Input","content":"Each test case starts with two integers denoting the number of phone calls N (1 &lt;= N &lt; 10 000) and the number of intervals M (1 &lt;= M &lt; 100). This is followed by N lines describing the telephone calls, each one consisting of four integers Source, Destination, Start and Duration. Source and Destination identify the pair of telephone numbers establishing the connection (0 &lt;= Source, Destination &lt;= 10 000 000). Start and Duration are the start time and duration of the call in seconds (1 &lt;= Duration &lt;= 10 000 and Start &gt;= 0). You can safely assume that the sum of Start and Duration fits into a 32-bit signed integer. <br>Afterwards follow M lines containing the time intervals the police are interested in, each on described by two integers Start and Duration, in the same format and with the same meaning and constraints as those in the telephone calls. The last test case is represented by N = M = 0 and must not be processed.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each of the M intervals of each test case, print the number of calls that are active during at least one  second of the interval.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 2\n3 4 2 5\n1 2 0 10\n6 5 5 8\n0 6\n8 2\n1 2\n8 9 0 10\n9 1\n10 1\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2\n1\n0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2009+South+Western+European+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2009 South Western European Regional Contest </a> ","type":"source","format":"html"}]}