{"title":"Qin Shi Huang's National Road System","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4081","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4081&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4081","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4081"},"statement":[{"title":"Problem Description","content":"During the Warring States Period of ancient China(476 BC to 221 BC), there were seven kingdoms in China ---- they were Qi, Chu, Yan, Han, Zhao, Wei and Qin. Ying Zheng was the king of the kingdom Qin. Through 9 years of wars, he finally conquered all six other kingdoms and became the first emperor of a unified China in 221 BC. That was Qin dynasty ---- the first imperial dynasty of China(not to be confused with the Qing Dynasty, the last dynasty of China). So Ying Zheng named himself &quot;Qin Shi Huang&quot; because &quot;Shi Huang&quot; means &quot;the first emperor&quot; in Chinese.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/4081-1.jpg\"></center> <br>Qin Shi Huang undertook gigantic projects, including the first version of the Great Wall of China, the now famous city-sized mausoleum guarded by a life-sized Terracotta Army, and a massive national road system. There is a story about the road system:<br>There were n cities in China and Qin Shi Huang wanted them all be connected by n-1 roads, in order that he could go to every city from the capital city Xianyang.<br>Although Qin Shi Huang was a tyrant, he wanted the total length of all roads to be minimum,so that the road system may not cost too many people&apos;s life. A daoshi (some kind of monk) named Xu Fu told Qin Shi Huang that he could build a road by magic and that magic road would cost no money and no labor. But Xu Fu could only build ONE magic road for Qin Shi Huang. So Qin Shi Huang had to decide where to build the magic road. Qin Shi Huang wanted the total length of all none magic roads to be as small as possible, but Xu Fu wanted the magic road to benefit as many people as possible ---- So Qin Shi Huang decided that the value of A/B (the ratio of A to B) must be the maximum, which A is the total population of the two cites connected by the magic road, and B is the total length of none magic roads.<br>Would you help Qin Shi Huang?<br>A city can be considered as a point, and a road can be considered as a line segment connecting two points.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer t meaning that there are t test cases(t &lt;= 10).<br>For each test case:<br>The first line is an integer n meaning that there are n cities(2 &lt; n &lt;= 1000).<br>Then n lines follow. Each line contains three integers X, Y and P ( 0 &lt;= X, Y &lt;= 1000, 0 &lt; P &lt; 100000). (X, Y) is the coordinate of a city and P is the population of that city.<br>It is guaranteed that each city has a distinct location.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print a line indicating the above mentioned maximum ratio A/B. The result should be rounded to 2 digits after decimal point.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\n1 1 20\n1 2 30\n200 2 80\n200 1 100\n3\n1 1 20\n1 2 30\n2 2 40</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">65.00\n70.00</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Beijing+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2011 Asia Beijing Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}