{"title":"Three Kingdom Chess","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4083","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4083&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4083","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4083"},"statement":[{"title":"Problem Description","content":"Zhuge Liang and Zhou Yu were famous strategists in The Three Kingdoms Period.<br>During The War of the Red Cliff in which Cao Chao was defeated, they often sat together to play chess. But the chess they played was special.<br>We can call the chess &quot;Three Kingdom Chess&quot;. There are 2 players, and each one has some soldiers. All the soldiers are put on an N &#xD7; M chessboard. Each grid on the chess board can be mountain, plain or lake. And there are 3 kinds of soldiers which are footman, archer and rider. All kind of soldiers can stay at or pass through plains. None of them can stay at or pass through lakes. Only footmen and archers can stay at or pass through mountains.<br>There are at most K turns in the game. Two players take turns to act. The first turn is Zhuge Liang&apos;s turn, the second turn is Zhou Yu&apos;s, the third turn is Zhuge Liang&apos;s&#x2026;and so on. When one player&apos;s soldiers are all destroyed or after the Kth turn, the game ends. In each turn, the player can move one of his soldiers to a destination and then let it attack one of the opponent&apos;s soldiers.<br>The rule of moving is as below. Every kind of soldiers has its &quot;pace length&quot;. A soldier with &quot;pace length&quot; of q can move at most q steps(you can also let your soldier move 0 step). On each step, a soldier can move up, down, left or right by one grid. But please note that no soldier can pass a lake and a rider can&apos;t pass a mountain, as mentioned above. A soldier is also not able to pass a grid which is occupied by an enemy soldier. A soldier can pass, but cannot stay at a grid which is occupied by his comrade.<br>After a soldier reaching his moving destination, he can launch an attack. A soldier can attack an enemy soldier who is in his &quot;attack region&quot;. The attack regions of different kinds of soldiers are shown in the figures below:<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/4083-1.jpg\"></center> <br><br>It means that the soldier in the grid with a circle can attack one enemy soldier who is in the black grids.<br>Every soldier has a &quot;strength&quot; property. A soldier&apos;s strength will decrease if he is attacked. The strength decrement equals to S &#xD7; F, which S is the attacker&apos;s strength, and F is the attacking factor. The attacking factor is 2 when a footman attacks an archer, an archer attacks a rider and a rider attacks a footman. It&apos;s 1 when a footman attacks a footman, a rider 6 attacks a rider and an archer attacks an archer. It&apos;s 0.5 when a footman attacks a rider, a rider attacks an archer and an archer attacks a footman.<br>A soldier will be destroyed and disappear if its strengths is equal to or less than 0.<br>In one turn, a soldier can only launch one attack, and he can&apos;t move again in the same turn after attacking.<br>At the end, the score you get is the sum of strength of all your soldiers minus the sum of strengths of all your opponent&apos;s soldiers. So the score can be negative. Suppose Zhuge Liang and Zhou Yu were both very clever and always chose the best strategy to get as many score as possible, so what&apos;s the maximum score could Zhuge Liang get in the game?","type":"description","format":"html"},{"title":"Input","content":"There are several test cases. For each test case:<br>The first line contains 3 integers, N, M (1 &lt;= N, M &lt;= 5) and K (1 &lt;= K &lt;= 10), indicating that the chessboard is N &#xD7; M, and the game will end after K turns.<br>Then N lines follow, each containing M integers. Every integer represents a grid, showing the grid&apos;s property. 0 stands for plain, 1 stands for mountain and 2 stands for lake.<br>The next line contains 4 integers, T (1 &lt;= T &lt;= 6), S1, S2 and S3, indicating that there are T soldiers on the chessboard at the beginning. It is guaranteed that no more than one soldier stay at the same grid. S1, S2 and S3 mean the &quot;pace length&quot; of footman, rider and archer.<br>For the next T lines, each line contains 5 integers x, y, a, b and c, describing a soldier.<br>The soldier is in row x and column y (The coordinates x, y start from 1). If a=0 then the soldier is Zhuge Liang&apos;s and if a=1 then it is Zhouyu&apos;s. The strength of the soldier is b. c=0 means the soldier is a footman, c=1 means it is a rider and c=2 means it is an archer.<br>The input ends with N = M = K = 0.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing the maximumscore Zhuge Liang can get in the game.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3 2\n0 0 0\n0 0 0\n0 0 0\n2 1 1 1\n2 1 0 100 0\n2 3 1 100 0\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">100</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Beijing+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2011 Asia Beijing Regional Contest  </a> ","type":"source","format":"html"}]}