{"title":"The Voyages of Zheng He","time_limit":20000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4084","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4084&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4084","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4084"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../data/images/4084-1.jpg\"></center> <br><br>Zheng He (1371&#x2013;1433) was a Hui-Chinese mariner, explorer, diplomat and fle et admiral, who commanded seven voyages to Southeast Asia, South Asia, the Middle East, and East Africa, collectively referred to as the Voyages of Zheng He.<br>His fle et was by far the largest and most advanced fleet in the world at his time, and his voyages were about 80 years earlier than Columbus&apos; America discovering voyage.<br>Recently some Chinese ACMers just found an old document about Zheng He&apos;s Voyage. It said: <br>Once upon a time, when Zheng He was sailing along the Malaysia coast, a strange volcano suddenly erupted.The volcano threw some strange hot rocks on the sea. Those rocks floated on the water at first, and after some time, when water went into their center, they would explode. Every rock could be considered as a point and it had a set of properties X, Y, R, T and L, meaning that:<br>The position of the rock was (X, Y). The rock would explode at time T, and the explosion would last until time T+L. During the time interval [T, T+L](both ends are included), any ship whose distance from that rock was no more than R would be destroyed.<br>At time 0, Zheng He&apos;s ship was at the position (0, 0), and his ship could also be considered as a point. When talking about &quot;distance&quot;, it means the Manhattan Distance. In a plane, the Manhattan Distance between (x1, y1) and (x2, y2) is |x1 - x2| + |y1 - y2|. Zheng He&apos;s ship could only move horizontally or vertically. The maximum speed of Zheng He&apos;s ship was 1 per second. That means, if Zheng He&apos;s ship was at (x, y) now, then 1 second latter it may arrive at any point in the region S( S={(x1,y1) | |x1-x|+|y1-y| &lt;= 1}).<br>Suppose Zheng He knew every rock&apos;s properties. Given time P, Zheng He wanted to know whether he could survive after time P.","type":"description","format":"html"},{"title":"Input","content":"Input contains several test cases. For each test case:<br>The first line contains 2 integers, N and P (1&lt;=N&lt;=1000,1&lt;=P&lt;=1000000), indicating that there were N rocks on the sea and Zheng He wanted to know whether he could survive after time P.<br>Then N lines follow. Each line describes a rock by 5 integers ---- X, Y, R, T and L(-50&lt;=X, Y&lt;=50, 1&lt;=R&lt;=50, 1&lt;=T, L&lt;=10000) mentioned above.<br>Input ends with N = P = 0.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, If Zheng He can survive after time P, please print &quot;Zheng can survive.&quot; But if P &lt;= 100, you should print one extra line &quot;The survive area is : A&quot;, where A is the area of the region which Zheng He can safely reach at time P (rounded to 3 digits after the decimal point). If Zheng He cannot survive, please print &quot;Zheng dies at : H&quot;, where H is the latest time Zheng He can survive (H is an integer and Zheng He will be alive at time H but be dead at time H+1). Note that there are one space before the mark &quot;:&quot; and one after it.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 30\n50 50 50 50 100\n-50 50 50 50 100\n50 -50 50 50 100\n-50 -50 50 50 100\n3 20\n-1 -4 4 3 7\n-4 2 8 6 1\n4 -3 10 10 10\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Zheng can survive.\nThe survive area is : 1800.000\nZheng dies at : 10</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Beijing+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2011 Asia Beijing Regional Contest  </a> ","type":"source","format":"html"}]}