{"title":"Activation","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4089","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4089&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4089","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4089"},"statement":[{"title":"Problem Description","content":"After 4 years&apos; waiting, the game &quot;Chinese Paladin 5&quot; finally comes out. Tomato is a crazy fan, and luckily he got the first release. Now he is at home, ready to begin his journey.<br>But before starting the game, he must first activate the product on the official site. There are too many passionate fans that the activation server cannot deal with all the requests at the same time, so all the players must wait in queue. Each time, the server deals with the request of the first player in the queue, and the result may be one of the following, each has a probability:<br>1. Activation failed: This happens with the probability of p1. The queue remains unchanged and the server will try to deal with the same request the next time.<br>2. Connection failed: This happens with the probability of p2. Something just happened and the first player in queue lost his connection with the server. The server will then remove his request from the queue. After that, the player will immediately connect to the server again and starts queuing at the tail of the queue.<br>3. Activation succeeded: This happens with the probability of p3. Congratulations, the player will leave the queue and enjoy the game himself.<br>4. Service unavailable: This happens with the probability of p4. Something just happened and the server is down. The website must shutdown the server at once. All the requests that are still in the queue will never be dealt.<br>Tomato thinks it sucks if the server is down while he is still waiting in the queue and there are no more than K-1 guys before him. And he wants to know the probability that this ugly thing happens.<br>To make it clear, we say three things may happen to Tomato: he succeeded activating the game; the server is down while he is in the queue and there are no more than K-1 guys before him; the server is down while he is in the queue and there are at least K guys before him.<br>Now you are to calculate the probability of the second thing.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are no more than 40 test cases. Each case in one line, contains three integers and four real numbers: N, M (1 &lt;= M &lt;= N &lt;= 2000), K (K &gt;= 1), p1, p2, p3, p4 (0 &lt;= p1, p2, p3, p4 &lt;= 1, p1 + p2 + p3 + p4 = 1), indicating there are N guys in the queue (the positions are numbered from 1 to N), and at the beginning Tomato is at the Mth position, with the probability p1, p2, p3, p4 mentioned above.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"A real number in one line for each case, the probability that the ugly thing happens.<br>The answer should be rounded to 5 digits after the decimal point.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2 1 0.1 0.2 0.3 0.4\n3 2 1 0.4 0.3 0.2 0.1\n4 2 3 0.16 0.16 0.16 0.52</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.30427\n0.23280\n0.90343</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Beijing+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2011 Asia Beijing Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}