{"title":"Universal Question Answering System","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4096","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4096&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4096","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4096"},"statement":[{"title":"Problem Description","content":"&#xA0;&#xA0;Every student needs help from getting new knowledge by asking questions. Surveys are suggesting that some similar questions are repeated frequently. So it will be nice to develop an automatic question-answering system to answer these questions. Your algorithm should not have any prior knowledge, but it must be able to read sentences and remember the mentioned facts. Whenever the question is asked about such a fact, the system has to answer it properly.","type":"description","format":"html"},{"title":"Input","content":"&#xA0;&#xA0;The input consists of many dialogues.<br>&#xA0;&#xA0;There is a single positive integer T on the first line of input. (T &lt;= 500, but note that 95% of them are relatively small) It denotes the number of following dialogues. Each dialogue includes one or more lines. Each line contains one sentence: either a statement or a question. Statements end with a dot character (.) while questions end with a question mark (?). There is one extra line after each dialogue. That line ends with an exclamation mark (!). The definitions of the statements and questions will be discussed later.<br><br>Sentences can contain words, spaces and punctuation characters. All words contain only Latin letters and are case-sensitive. Unlike the normal English writing rules, the first letter of a sentence should keep lowercase unless the first word itself should begin with a capital letter. There are no extra spaces between words. No word will have more than 10 characters. There will be at most 1000 lines per dialogue.<br><b>Statements</b><br>Each statement has one of the following forms:<br><i><br>noun_phrase are noun_phrase.<br>noun_phrase can verb_phrase.<br>everything which can verb_phrase can verb_phrase.<br>everything which can verb_phrase are noun_phrase.<br></i><br>noun_phrase and verb_phrase are both single word. The meanings of the four forms are:<br><br>A are B: If X is A, then X is B.<br>A can B: If X is A, then X has the ability to B.<br>everything which can A can B: If X has the ability to A, X has the ability to B.<br>everything which can A are B: If X has the ability to A, X is B.<br><br><b>Questions</b><br>Each question has one of the following forms:<br><i><br>are noun_phrase noun_phrase?<br>can noun_phrase verb_phrase?<br>can everything which can verb_phrase verb_phrase?<br>are everything which can verb_phrase noun_phrase?<br></i><br><br>They are the question form of the statements.<br><br>In each test case, the number of different noun phrases will not exceed 100; the number of different verb phrases will not exceed 100.<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#xA0;&#xA0;For each test case, output two lines. The first line describes the test case number counting from 1, while the second line contains the same number of characters as the number of questions in this test case. Each character is either &#xFFFD;&#xFFFD;Y&#xFFFD;&#xFFFD;(denoting you can get that fact logically) or &#xFFFD;&#xFFFD;M&#xFFFD;&#xFFFD;(otherwise), without quotes.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\nflies can fly.\nflies are insects.\neverything which can fly are animals.\nare everything which can fly insects?\nare flies animals?\ncan flies eat?\neverything which can fly can eat.\ncan flies eat?\nBye!</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\nMYMY</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Shanghai+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2011 Asia Shanghai Regional Contest  </a> ","type":"source","format":"html"}]}