{"title":"GRE Words","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4117","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4117&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4117","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4117"},"statement":[{"title":"Problem Description","content":"Recently George is preparing for the Graduate Record Examinations (GRE for short). Obviously the most important thing is reciting the words.<br>Now George is working on a word list containing N words.<br>He has so poor a memory that it is too hard for him to remember all of the words on the list. But he does find a way to help him to remember. He finds that if a sequence of words has a property that for all pairs of neighboring words, the previous one is a substring of the next one, then the sequence of words is easy to remember.<br>So he decides to eliminate some words from the word list first to make the list easier for him. Meantime, he doesn&apos;t want to miss the important words. He gives each word an importance, which is represented by an integer ranging from -1000 to 1000, then he wants to know which words to eliminate to maximize the sum of the importance of remaining words. Negative importance just means that George thought it useless and is a waste of time to recite the word.<br>Note that although he can eliminate any number of words from the word list, he can never change the order between words. In another word, the order of words appeared on the word list is consistent with the order in the input. In addition, a word may have different meanings, so it can appear on the list more than once, and it may have different importance in each occurrence.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/4117-1.jpg\"></center>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer T(1 &lt;= T &lt;= 50), indicating the number of test cases.<br>Each test case contains several lines.<br>The first line contains an integer N(1 &lt;= N &lt;= 2 * 10<sup>4</sup>), indicating the number of words.<br>Then N lines follows, each contains a string S<sub>i</sub> and an integer W<sub>i</sub>, representing the word and its importance. S<sub>i</sub> contains only lowercase letters.<br>You can assume that the total length of all words will not exceeded 3 * 10<sup>5</sup>.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case in the input, print one line: &quot;Case #X: Y&quot;, where X is the test case number (starting with 1) and Y is the largest importance of the remaining sequence of words.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5\na 1\nab 2\nabb 3\nbaba 5\nabbab 8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 14</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+ChengDu+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2011 Asia ChengDu Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}