{"title":"Ji-Tu Problem","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4120","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4120&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4120","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4120"},"statement":[{"title":"Problem Description","content":"There are some chickens and rabbits in the cage. They have fifteen heads and forty feet in all.<br>How many chickens and rabbits are there respectively?<br>It is a classical math problem which can date back to the Northern and Southern Dynasties (420-589). Here is an interesting algorithm to solve the problem: Assume that the chickens and rabbits are well trained. You whistle, and all of them lift a leg, then there are 40-15 = 25 feet on the floor. You whistle again, and there are 25 - 15 = 10 legs remain standing. After two whistles, all the chickens sit on the floor, and all the rabbits stand on two legs. So there are 10/2 = 5 rabbits and 15 - 5 = 10 chickens.<br>John has a farm with lots of animals in it. He is now facing the similar problem. There are exactly N kinds of animals and he wants to know their quantities. He only knows that different kinds of animals have different number of legs (at least one), but he has no idea how many legs they each have. He trains the animals and tries to figure it out using the algorithm stated above. First he makes all the animals stand up with all their legs and counts their legs. then, for each time he whistles, all the animals lift one leg(if it has at least one leg standing on the ground), and then he counts the feet again. After K times, he thinks that it is enough to determine the quantity of each kind of animal, but does it really work? So, it is your job to help him to solve the problem.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer T(1 &lt;= T &lt;= 100), indicating the number of test cases.<br>Each test case contains two lines.<br>The first line contains two integers N(1 &lt;= N &lt;= 1000) and K(1 &lt;= K &lt;= 1000), representing the number of different kinds of animals and the time he whistles.<br>The second line contains K + 1 integers A<sub>0</sub>,A<sub>1</sub> ... A<sub>K</sub>(0 &lt;= A<sub>i</sub> &lt;= 10<sup>4</sup>) where A<sub>i</sub> represents the number of legs after his i<sup>th</sup> whistle.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case in the input, print several lines.<br>The first line contains &quot;Case #X:&quot;, where X is the test case number (starting with 1).<br>The next line contains &quot;No Solution&quot;, &quot;Unique Solution&quot; or &quot;Multiple Solutions&quot; according to the result.<br>If the result is uniquely determined, you should print N extra lines each contains two integer L<sub>i</sub>,N<sub>i</sub>, where L<sub>i</sub> represents how many legs does the ith kind of animal have and N<sub>i</sub> represents the number of ith kind of animal. The animals should be sorted by the number of their legs in ascending order.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 3\n14 9 6 3\n2 2\n8 5 3\n3 2\n20 13 8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\nUnique Solution\n1 2\n4 3\nCase #2:\nNo Solution\nCase #3:\nMultiple Solutions</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+ChengDu+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2011 Asia ChengDu Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}