{"title":"Moles","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4125","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4125&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4125","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4125"},"statement":[{"title":"Problem Description","content":"A mole is a strange mammal adapted to a subterranean lifestyle. It has invisible eyes and short, powerful limbs with large paws oriented for digging.<br><br>Before the catastrophic earthquake, a group of moles have perceived the disaster. They move to a safe place and want to dig holes under the ground. There are n moles, numbered from 1 to n. They stand in a line and dig holes one by one. The mole line is not necessary sorted by the mole number. Every mole should live in a hole dug by itself and every mole just digs one hole. The first mole in the line digs the first hole with a channel to the ground. Then other moles go down through that channel and dig more holes and channels. A hole may have at most three neighbors connected by channels, one is on the upper level, and the other two holes are on the lower level lying on the left side and the right side. When a mole reaches a hole, if its number is smaller than the hole owner&apos;s, it will go to the left-lower hole(or digs a left-lower hole and stays there when there is no left-lower hole), otherwise it will go to the right-lower hole(or digs a right-lower hole and stays there when there is no right-lower hole). Due to the excellent ability and well-designed layout, these holes and channels will not cross with each other.<br><br>Mouse Jerry is a friend of those moles. He comes to visit them and prepares gifts for every mole. There is a rule that the mole whose number is smaller must get the gift earlier than the mole whose number is larger. Jerry starts from the ground. He travels through the holes and channels to deliver his gifts. After giving out all his gifts, he comes back to the ground. In the mole world, it is interesting that the moles with odd numbers are males and others are females. When reaching a hole, Jerry takes a note about the gender of the hole owner(0 represents female and 1 represents male). When he gets back to the ground, he will get a 0-1 sequence. Now he wants to calculate the &quot;harmony value&quot;. The harmony value represents the number of occurrences of a given &quot;harmony string&quot; in the above mentioned sequence. Occurrences may overlap.<br><br>Please note that Jerry is very smart so his travel distance is as small as possible.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer t meaning that there are t test cases(t &lt;= 10).<br>For each test case :<br>The first line is an integer n meaning that there are n moles. (n &lt;= 600000).<br>The second line contains n integers representing the mole line. Each integer is a mole&apos;s number and the first integer is the number of the first mole in the line.<br>The third line is the harmony string. The string length is not large than 7000.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, please output the case number and the harmony value.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n8\n5 1 3 2 7 8 4 6\n01\n10\n1 2 3 4 5 6 7 8 9 10\n1010</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 4\nCase #2: 8\n\n(Please note that there is a blank before &apos;#&apos; and after &apos;:&apos;)\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first test case, the 0-1 sequence of the first case is &quot;111010111101011&quot;, and the number of occurrences of harmony string &quot;01&quot; is 4.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2011+Asia+Fuzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2011 Asia Fuzhou Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}