{"title":"Wimbledon","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4136","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4136&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4136","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4136"},"statement":[{"title":"Problem Description","content":"I&#xFFFD;&#xFFFD;m flying back to Cairo tomorrow, and do you know what is sad about that? Well, in addition to leaving beautiful Lebanon? Yep, I&#xFFFD;&#xFFFD;m going to miss the 2011 Wimbledon final match which is going to happen while I&#xFFFD;&#xFFFD;m 20,000 feet above sea level!<br>But hey, wait! I may have a shot here! At Wimbledon, matches are played only at  day light, so maybe if players were not ready to give up easily on each point, then the match will extend until sunset, and the match would be suspended and resumed on Monday just for my convenience! So what I need to know is how long on average a game between two players will last, and to help me feel better you should write a computer program to determine that!<br>The result of a tennis match is determined by the number of &#xFFFD;&#xFFFD;sets&#xFFFD;&#xFFFD; each player wins, the first player to win three sets wins the match. Accordingly, all possible match results are 3-0, 3-1 and 3-2. The result of each set is determined by the number of &#xFFFD;&#xFFFD;games&#xFFFD;&#xFFFD; in the set each player wins, the first player to win six or more games with two or more game difference from the opponent wins the set, however if the result of a set (including the last set) leveled at 6-6 then a tie-break game is played to determine the set winner, Accordingly all possible set results are 6-0, 6-1, 6-2, 6-3, 6-4, 7-5 and 7-6 using a tie breaker game!<br>During each game (including tie-break), one player has the serve, this means that this player must start the play for all points of the game by hitting the ball, serving the ball is considered a big advantage. Assume that the serve starts at the first player and then alternates after each game till the end.<br>Given the probability of winning a game on serve for each player against his  opponent, and assuming that each game lasts for five minutes, calculate the expected duration of the match.","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains an integer T, the number of test cases.<br>The first line of each test case contains the first and last names of the first player, followed by an integer (0 &lt;= A &lt;= 100) where A/100 is the probability that the first player wins a game on his serve against the second player. The second line contains the first and last names of the second player, followed by an integer (0 &lt;= B &lt;= 100) where B/100 is the probability that the second player wins a game on his serve against the first player.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the case number followed by the expected duration of the match in minutes rounded to six decimal digits.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nRafael Nadal 50\nRoger Federer 50\nPete Sampras 100\nHamza Darwish 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 199.281006\nCase #2: 90.000000\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the second test case, I don&#xFFFD;&#xFFFD;t stand a chance against Pete! He always wins all games on his serve\n(probability 100/100) and he also always wins all games on my serve (as I win with probability 0/100),\nso he always wins the match with three straight sets (6-0, 6-0, 6-0), a total of 18 games played,\neach lasting five minutes for a total of 90 minutes match.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+Third+Lebanese+Collegiate+Programming+Contest&amp;source=1&amp;searchmode=source\"> The Third Lebanese Collegiate Programming Contest </a> ","type":"source","format":"html"}]}