{"title":"Crank","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4141","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4141&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4141","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4141"},"statement":[{"title":"Problem Description","content":"Chev Chelios had his heart stolen from him, by the boss of the most dangerous gang in the city. His heart has been replaced with an artificial chargeable one!<br>Chelios was on mission of locating the boss of the gang to get his heart back since then without luck! Now the artificial heart&#x2019;s battery lifetime is about to expire! Fortunately, he finally located the target but he needs your help to get there before his artificial heart stops beating!<br>Chelios decided to attack the boss building from the roof because all gates are heavily protected by gangsters. Chelios has the map of the gang block which shows the heights of all buildings within the block. The plan is that a helicopter will drop Chelios on the roof of one of the buildings on the boundary of the block during night. Then Chelios will get to the boss building by moving to adjacent buildings, vertically or horizontally. Chelios can only move to a building which has the same or smaller height as the current building (going up severely affects his damaged heart).<br>Given the gang building block map which shows the heights of all buildings in the block along with the boss building, write a program to help Chev Chelios determine the number of buildings on the boundary of the block he can be dropped by the helicopter at so that he would be able to reach the boss&#x2019;s building without climbing!","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains an integer T, the number of test cases. T test cases follow, the first line of each test case contains two integers (1 &lt;= R,C &lt;= 10) the height and width of the building block. The second line contains two integers (1 &lt;= A &lt;= R), and (1 &lt;= B &lt;= C), the coordinates of the boss building on the map. R lines follows; each line consists of C space separated integers representing the heights of all buildings. A height H of a building satisfies (1 &lt;= H &lt;= 1000).","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the number of buildings on the boundary of the block Chev Chelios can be dropped by the helicopter at so that he would be able to reach the boss&#x2019;s building without climbing up! Follow the output format below.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 3\n2 2\n1 7 3\n2 6 3\n3 5 4\n2 2\n2 1\n2 7\n2 6</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 1\nCase #2: 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+Third+Lebanese+Collegiate+Programming+Contest&amp;source=1&amp;searchmode=source\"> The Third Lebanese Collegiate Programming Contest </a> ","type":"source","format":"html","require":["katex"]}]}