{"title":"Roll-call in Woop Woop High","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4178","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4178&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4178","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4178"},"statement":[{"title":"Problem Description","content":"The new principal of Woop Woop High is not satisfied with her pupils performance.She introduced a new roll-call process to get a daily measure of the pupils&apos; learning, which proceeds as follows:At the beginning of the daily roll-call period each pupil is handed a question, which they must attempt to answer, before proceeding to their classes. A pupil stops after the question is answered correctly. Each pupil is allowed up to five attempts to answer the question correctly. Pupils who answer correctly on the first attempt are marked present. Pupils who answer correctly after more than one attempt are encouraged to work at home. Pupils who fail to develop a correct answer within five attempts are given remedial classes after school. Pupils who do not give any answer are marked as abscent. Your task is to write a program that reads the pupils&apos; assessments and generates performance reports for the principal to proceed with appropriate actions.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input starts with an integer K (1 &lt;= K &lt;= 100) indicating the number of classes. Each class starts with an integer N (1 &lt;= N &lt;= 50) indicating the number of pupils in the class. Each of the following N lines starts with a pupil&apos;s name followed by up-to five assessments of his/her answers. An assessment of &apos;yes&apos; or &apos;y&apos; indicates a correct answer and an assessment of &apos;n&apos; or &apos;no&apos; indicates a wrong answer. A pupil&apos;s name consists of a single string with no white spaces.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"The attendance report for each class consists of five lines. <br>The first line consists of the sentence: &quot;Roll-call: X&quot;, where X indicates the class number starting with the value of one. <br>The second line consists of the sentence: &apos;&apos;Present: Y1 out of N&apos;&apos;, where Y1 is the number of pupils who did not submit a wrong answer. <br>The third line consists of the sentence: &apos;&apos;Needs to study at home: Y2 out of N&apos;&apos;, where Y2 is the number of pupils who submitted a number of wrong answers before submitting the correct answer. <br>The fourth line consists of the sentence: &apos;&apos;Needs remedial work after school: Y3 out of N&apos;&apos;, where Y3 indicates the number of pupils whose submitted five wrong answers.<br>The fifth line consists of the sentence: &apos;&apos;Absent: Y4 out of N&apos;&apos;, where Y4 indicates the number of absent pupils.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5 \nDoc n y\nsneezy n n no yes\nprincecharming no n no no n\ngoofy yes\ngrumpy n y\n5 \nevilemperor n y\nprincesslia\nr2d2 no no y\nobeyonecanopy n no y\ndarthvedar y</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Roll-call: 1\nPresent: 1 out of 5\nNeeds to study at home: 3 out of 5\nNeeds remedial work after school: 1 out of 5\nAbsent: 0 out of 5\nRoll-call: 2\nPresent: 1 out of 5\nNeeds to study at home: 3 out of 5\nNeeds remedial work after school: 0 out of 5\nAbsent: 1 out of 5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+2011+South+Pacific+Programming+Contest&amp;source=1&amp;searchmode=source\"> The 2011 South Pacific Programming Contest </a> ","type":"source","format":"html","require":["katex"]}]}