{"title":"Difficult Routes","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4179","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4179&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4179","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4179"},"statement":[{"title":"Problem Description","content":"In preparation for the coming Olympics, you have been asked to propose bicycle training routes for your country&apos;s team. The training committee wants to identify routes for traveling between pairs of locations in multiple sites around the country. Each route must have a desired level of difficulty based on the steepness of its hills. <br>You will be given a road map with the elevation data superimposed upon it. Each intersection, where two or more roads meet, is identified by its x- , y- , and z-coordinates. Each road starts and ends at an intersection, is straight, and does not contain bridges over or tunnels under other roads. The difficulty level, d, of cycling a road is 0 if the road is level or travelled in the downhill direction. The difficulty of a non-level road when travelled in the uphill direction is<img style=\"max-width:100%;\" src=\"../../data/images/C388-1002-1.jpg\">100*rise / run<img style=\"max-width:100%;\" src=\"../../data/images/C388-1002-2.jpg\"> . Here rise is the absolute value of change in elevation and run is the distance between its two intersection points in its horizontal projection to the 2D-plane at elevation zero. Note that the level of difficulty for cycling a descending road is zero.<br>A route, which is a sequence of roads such that a successor road continues from the same intersection where its predecessor road finishes, has a level of difficulty d if the maximum level of difficulty for cycling among all its roads equals d. The committee is also interested in the chosen route between two selected locations, if such a route with the desired difficulty level exists, being the one with the shortest possible distance to travel.<br>Reminder: The floor function <img style=\"max-width:100%;\" src=\"../../data/images/C388-1002-3.jpg\">X<img style=\"max-width:100%;\" src=\"../../data/images/C388-1002-4.jpg\"> means X truncated to an integer.<br>The figure shows a road map with three intersections for the three sample inputs.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C388-1002-5.jpg\"></center><br>The edge labels of the darker shaded surface give the level of difficulty of going up hill. The lighter shaded surface is the horizontal projection to the 2D-plane at elevation zero.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input consists of many road maps. Each map description begins with two non-negative integers N and M, separated by a space on a line by themselves, that represent the number of intersections and the number of roads, respectively. N &lt;= 10000, M &lt;= 30000.  A value of both N and M equal to zero denotes the end of input data.<br>Each of the next N lines contains three integers, separated by single spaces, which represent the x-, y- and z-coordinates of an intersection. The integers have values between 0 and 10000, inclusive. Intersections are numbered in order of their appearance starting with the value one. Each of the following M lines contains two integers that represent start and end intersections of a road.<br>Finally, three integers s, t and d that represents the desired starting intersection number s, the finishing intersection number t and the level of difficulty d for a training route are given on line by themselves. A valid training route must have at least one road with a difficulty level of d, and no road with a difficulty level greater than d. 0 &lt;= d &lt;= 10. If the training route is meant to form a closed circuit, then s and t are the same intersection numbers.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each road map and desired route, the output consists of a single line that contains:<br>1. number denoting the shortest length of a training route rounded to one decimal places, or<br>2. the single word &#x201C;None&#x201D; if no feasible route exists.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n0 0 0\n100 100 6\n200 0 7\n1 2\n2 3\n3 1\n1 2 3\n3 3\n0 0 0\n100 100 6\n200 0 7\n1 2\n2 3\n3 1\n1 1 4\n3 3\n0 0 0\n100 100 6\n200 0 7\n1 2\n2 3\n3 1\n2 1 5\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">341.5\n283.1\nNone</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+2011+South+Pacific+Programming+Contest&amp;source=1&amp;searchmode=source\"> The 2011 South Pacific Programming Contest </a> ","type":"source","format":"html","require":["katex"]}]}