{"title":"Help-or-else","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4182","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4182&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4182","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4182"},"statement":[{"title":"Problem Description","content":"A penal colony for finance professionals will soon be holding its annual community service activity with some rules that are considered suitable for a penal colony. Every inmate is assigned a set P of N people to help with their finances and a limit of K minutes. In addition to the circumstances of the jth person, 1 &lt;= j &lt;= N, a time penalty of ej for choosing not to give advice and the time duration of dj minutes allotted to provide the advice are also made clear to the inmate. An inmate starts his community service at time T equal to zero. If the inmate started working with the jth person at time T, then he must terminate his work no later than T+dj. Regardless of the validity of the advice and time of completion, a value of C<sub>j</sub> ( = T+ d<sub>j</sub> ) is deducted from the inmate&apos;s alloted minutes. Also the inmate is not permitted to work with another person until the time T+ d<sub>j</sub>. If S is the set of people helped by an inmate, then the total number of used minutes is calculated as <img style=\"max-width:100%;\" src=\"../../../data/images/C388-1005-2.JPG\"> <br>Your task is to write a program to calculate the maximum number of persons that can be helped by an inmate without exceeding his K minutes limit.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Input consists of sets for many inmates. The description for each inmate begins with two integers N and K, separated by a single space on a line by themselves, that represent the number of people and the maximum allowed minutes. 0 &lt; N &lt;= 200 and 0 &lt; K &lt;= 6000. Each of the following N lines contains two integers, separated by a single space, which represent the penalty and time duration one person to be assisted. All integers have values between 0 and 10000, inclusive. Input terminates with two zeros on a line by themselves.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each inmate, the output consists of a single line that contains the maximum number of persons to be helped within the given time limit using the format shown. &#x201C;Mission Impossible&#x201D; is entered where not exceeding the given time limit is not possible.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 1000\n100 1000\n2 100\n1000 1000\n20 10\n1 1\n0 10000\n4 293\n61 30\n295 39\n206 27\n94 85\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1: 1\n2: Mission Impossible\n3: 0\n4: 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+2011+South+Pacific+Programming+Contest&amp;source=1&amp;searchmode=source\"> The 2011 South Pacific Programming Contest </a> ","type":"source","format":"html","require":["katex"]}]}