{"title":"Detour Buster","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4184","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4184&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4184","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4184"},"statement":[{"title":"Problem Description","content":"The Green Parcel Services company employs cyclists to deliver parcels across a large metropolitan city, and employees are paid according to the distances they must travel to deliver parcels. Each company bicycle has been equipped with a global positioning system that records its position once every couple of seconds. The sequence of positions for one delivery is called a track and the length of a track, which is the sum of euclidean distances between consecutive pairs of recorded points, is used to calculate the employee&apos;s payment.<br><br>A recent audit of the recorded tracks revealed that some tracks self-intersect, which indicates that some employees are making unnecessary detours. Your task is to write a program to process a given track and calculate the length of the shortest possible track from the first to the last point of the original track. The shortest possible track must be part of the original track and may include travelling in the same or opposite direction along the original track.","type":"description","format":"html"},{"title":"Input","content":"Input starts with an integer, on a line by itself, that represents the number of tracks tobe shortened. The description of each track begins with a positive integer N, on a line by itself, representing the number of recorded points that define the track. Each of the following N lines contains two integers, separated by a single space, that define the xand y-coordinates of a point on the track in metres. The points are listed in order of their appearance on the track. <br><br>Two successive points, which form a segment, will be no more than thirty metres apart and a segment will not intersect more than twenty other segments. All x- and ycoordinates have values between -10,000,000 and 10,000,000, inclusive. N has values between 1 and 100,000, inclusive.","type":"input_format","format":"html"},{"title":"Output","content":"For each input track, the output consists of a single integer, on a line by itself, which is the length of the shortest track in metres. The answer must be rounded to the nearest integer value. <br><br>Reminder:<br>Rounding a positive number R.xyz to the nearest integer&#xFF1A; <br> If the first decimal place (that is x) is less than 5, <br> then the rounded value is R. Otherwise, the rounded value is R+1.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">25\n0 0\n12 0\n20 0\n10 10\n10 -10\n6\n0 0\n15 0\n10 -5\n4 1\n10 1\n10 -10</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">20\n17</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+2011+South+Pacific+Programming+Contest&amp;source=1&amp;searchmode=source\"> The 2011 South Pacific Programming Contest </a> ","type":"source","format":"html"}]}