{"title":"Alphabet Soup","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4187","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4187&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4187","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4187"},"statement":[{"title":"Problem Description","content":"Peter is having lunch at home. Unfortunately for him, today&apos;s meal is soup. As Peter&apos;s mother is aware that he doesn&apos;t like it very much, she has cooked a special soup using pasta pieces shaped like letters from the alphabet, numbers and other characters. She has a special knife with which she can prepare an unlimited supply of pasta pieces that may come in S di\u000bfferent forms. The soup always has P pasta pieces in it, and is so thick that the pieces never move.<br>    Despite her eff\u000borts, Peter is still not happy with today&apos;s menu and asks how many days in his life he will have to eat soup. His mother promises him that she will prepare a di\u000bfferent soup every day, and that on no day will the dish contain the same shapes in all positions as any soup dish previously served. However, the number P of pasta pieces, as well as the positions in which pieces float, will remain the same every day. Peter is not easily fooled (or so he thinks), and he cleverly realizes that this can still make him eat soup for ages. In an attempt to reduce the number of confi\fgurations, he tells his mother he will not accept any dish which can be obtained by rotating one of the con\ffigurations previously seen.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C389-1001-1.jpg\"></center><br><center>Figure 1: Top view of Peter&apos;s dish</center><br>    Consider the dish as a circle of radius 2 centered at the origin. All the symbols will be floating in the soup at a given angle (in millidegrees) at distance 1 from the origin. Two plates are considered equal if you can perform a rotation of one of the dishes about its center so that the positions of the symbols, as well as the symbols themselves, are the same in both. <br>    Your program will be given the number of possible symbols Peter&apos;s mother has available, and the angles determining the location of each of the pasta pieces (measured clockwise in millidegrees). Write a program that returns the number of possible plates Peter&apos;s mother can prepare. As this number can be very large, output the number modulo 100,000,007, which is prime.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"    The fi\frst line of input in each test case contains two numbers: S (2&lt;=S&lt;=1,000), the number of symbols Peter&apos;s mother can use; and P (P &gt; 0), the number of pasta pieces floating in the soup. Each of the next P lines contain the angle A (0&lt;=A &lt;360,000) of one of the P pieces (measured clockwise in millidegrees). All angles will be di\u000bfferent.<br>    Di\u000bfferent tests cases are separated by a blank line. After the last test case there is a line with S = P = -1.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"    For each test case output a single integer in a line by itself, the number of diff\u000berent plates Peter&apos;s mother can cook modulo 100,000,007.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 4\n0\n90000\n180000\n270000\n\n100 5\n0\n45000\n90000\n180000\n270000\n\n-1 -1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n99999307</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SWERC+2011&amp;source=1&amp;searchmode=source\"> SWERC 2011 </a> ","type":"source","format":"html","require":["katex"]}]}