{"title":"Cybercrime Donut Investigation","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4189","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4189&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4189","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4189"},"statement":[{"title":"Problem Description","content":"Year 2042. The Internet has evolved to a virtual reality dataspace where crimes are committed every day. The 2041 SWERC winner developed an agent that drops a donut every time a crime is committed in the Cyberspace. Each of the donuts has its own signature. The Madrid Police have a huge database with crimes and their donut signatures.<br>    Today is your day. Your task is to implement a new agent that looks for the records in the database that bear a strong resemblance to the given signature of a dropped donut found at a new crime scene.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C389-1003-1.jpg\"></center><br><center>Figure 2: The major piece of evidence for today&apos;s unsolved crime streak</center><br>    Experts in virtual criminology have obtained the best similarity measure between donuts: compute the diff\u000berence in radius of the internal part of the toroids (holes), compute the di\u000bfference in radius of the external part of the toroids (tubes), and then add up those di\u000bfferences.","type":"description","format":"html"},{"title":"Input","content":"    The fi\frst line of each test case contains n (1&lt;=n&lt;=100,000), the number of donuts in the database. The i<sup>th</sup> of the following n lines contains the radius of the hole and radius of the tube of the i<sup>th</sup> donut in the database, described by two integers l and w (1&lt;=l,w&lt;=10<sup>9</sup>). After that there is a line containing q<br>(1&lt;=q&lt;=50,000), the number of donuts that you are looking for in the database. Then q lines follow, the i<sup>th</sup> of them describing the dimensions of the newly found i<sup>th</sup> donut in the same way.<br>    Diff\u000berent test cases are separated by a blank line. A line containing -1 marks the end of the input.","type":"input_format","format":"html"},{"title":"Output","content":"   The output of your program on each test case should have q lines, each of them containing an integer. The i<sup>th</sup> of these lines should contain the similarity between the newly found i<sup>th</sup> donut and the donut in the<br>database that most closely resembles it. Outputs for di\u000bfferent test cases should be separated by a blank line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 3\n3 4\n2\n1 1\n3 4\n\n2\n1 1\n9 9\n4\n4 5\n6 5\n2 5\n3 4\n\n-1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n0\n\n7\n7\n5\n5</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SWERC+2011&amp;source=1&amp;searchmode=source\"> SWERC 2011 </a> ","type":"source","format":"html"}]}