{"title":"Peer Review","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4194","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4194&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4194","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4194"},"statement":[{"title":"Problem Description","content":"For scienti\fc conferences, scientists submit papers presenting their ideas, and then review each other&apos;s papers to make sure only good papers are presented at the conference. Each paper must be reviewed by several scientists, and scientists must not review papers written by people they collaborate with (including themselves), or review the same paper more than once.<br>    You have been asked to write a program to check if your favorite conference is doing things right. Whether a paper is being reviewed too much, too little, or by the wrong people - the organizers must know before it is too late!","type":"description","format":"html"},{"title":"Input","content":"    The fi\frst line in each test case has two integers, K (1&lt;=K&lt;=5) and N (1&lt;=N&lt;=1000). K is the number of reviews that each paper will receive, while N is the number of papers to be reviewed. The conference only accepts papers with a single author, and authors can only present a single paper at the conference.<br>    Each of the next N lines describes an author and includes the name of the institution to which the author belongs, followed by the list of the K papers he or she has been requested to review. It is assumed that researchers from the same institution collaborate with each other, where as researchers from diff\u000berent institutions don&apos;t. All institution names are shorter than 10 characters, and contain only upper or lowercase letters and no whitespace. Since we have as many papers as authors, papers are identi\fed by their author&apos;s index; paper 1 was written by the \ffirst author in the list, and paper N was written by the last author.<br>    The end of the test cases is marked with a line containing K = 0 and N = 0. You should generate no output for this line.","type":"input_format","format":"html"},{"title":"Output","content":"    For each test case, your program should output NO PROBLEMS FOUND (if all rules are being followed) or P PROBLEMS FOUND, where P is the number of rule violations found (counting at most 1 violation per paper). If there is exactly one rule violation overall, your program should output 1 PROBLEM FOUND.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3\nUCM 2 3\nUAM 1 3\nUPM 1 2\n2 3\nUCM 2 3\nUAM 1 2\nUPM 2 2\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">NO PROBLEMS FOUND\n3 PROBLEMS FOUND</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SWERC+2011&amp;source=1&amp;searchmode=source\"> SWERC 2011 </a> ","type":"source","format":"html"}]}