{"title":"Quick out of the Harbour","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4198","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4198&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4198","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4198"},"statement":[{"title":"Problem Description","content":"Captain Clearbeard decided to go to the harbour for a few days so his crew could inspect and repair the ship. Now, a few days later, the pirates are getting landsick(Pirates get landsick when they don&apos;t get enough of the ships&apos; rocking motion. That&apos;s why pirates often try to simulate that motion by drinking rum.). Before all of the pirates become too sick to row the boat out of the harbour, captain Clearbeard decided to leave the harbour as quickly as possible.<br>Unfortunately the harbour isn&apos;t just a straight path to open sea. To protect the city from evil pirates, the entrance of the harbour is a kind of maze with drawbridges in it. Every bridge takes some time to open, so it could be faster to take a detour. Your task is to help captain Clearbeard and the fastest way out to open sea.<br>The pirates will row as fast as one minute per grid cell on the map. The ship can move only horizontally or vertically on the map. Making a 90 degree turn does not take any extra time.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains a single number: the number of test cases to follow. Each test case has the following format:<br>1. One line with three integers, h, w (3 &lt;= h;w &lt;= 500), and d (0 &lt;= d &lt;= 50), the height and width of the map and the delay for opening a bridge.<br>2.h lines with w characters: the description of the map. The map is described using the following characters:<br>&#x2014;&quot;S&quot;, the starting position of the ship.<br>&#x2014;&quot;.&quot;, water.<br>&#x2014;&quot;#&quot;, land.<br>&#x2014;&quot;@&quot;, a drawbridge.<br>Each harbour is completely surrounded with land, with exception of the single entrance.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case in the input, the output should contain one integer on a single line: the travelling time of the fastest route to open sea. There is always a route to open sea. Note that the open sea is not shown on the map, so you need to move outside of the map to reach open sea.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n6 5 7\n#####\n#S..#\n#@#.#\n#...#\n#@###\n#.###\n4 5 3\n#####\n#S#.#\n#@..#\n###@#</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">16\n11</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2011&amp;source=1&amp;searchmode=source\"> BAPC 2011 </a> ","type":"source","format":"html","require":["katex"]}]}