{"title":"Find the Treasure","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4199","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4199&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4199","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4199"},"statement":[{"title":"Problem Description","content":"Four hundred years ago, a group of pirates hid a treasure on an island in an archipelago that consists of many very small islands. Unfortunately, these pirates were particularly bad navigators and cartographers. Therefore, instead of a map, they made drawings of views from the top of the mountain on the treasure island. Each view shows two or more other islands of the archipelago that can be seen from the treasure island, ordered from left to right. The views also contain lots of fog, so the drawings may fail to show some islands that must have been in the field of view between the islands that appear in the drawing. For example, in Figure 2 below, if the treasure is hidden on Rummet, then the pirates could have drawn a view showing (from left to right) Wisket, Ginnet and Vinnet, or a view showing (from left to right) Liquorel and Cidrel. The pirates are known to have had acute vision, with a viewing angle of 180 degrees, but bad drawing skills: the distances between Wisket, Ginnet and Vinnet in their drawing are meaningless, and Liquorel may be drawn far to the left of Cidrel while in the actual view from Rummet, Liquorel must have been only slightly to the left of Cidrel, even obscuring part of it. Fortunately, all islands in the drawings can be identi\fed easily thanks to the unique towers on top of each island.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C392-1003-1.png\"></center><br>Now, four hundred years later, you have got the pirates&apos; drawings and an excellent, accurate map of the archipelago, showing all islands. On which island is the treasure hidden?","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains a single number: the number of archipelagos to follow. Each archipelago has the following format:<br>1.One line with an integer n, satisfying 1 &lt;= n &lt;= 125,000: the number of islands in the archipelago.<br>2.n lines, each with two integers xi and yi, satisfying 0 &lt; xi &lt; 2^29 and 0 &lt; yi &lt; 2^29: these are the coordinates of the tower Ti on each island.<br>3.One line with an integer k: the number of test cases for this archipelago. Each test case hasthe following format:<br>----One line with an integer m, satisfying 0 &lt;= m &lt;= 10,000: the number of pairs of islands that appear in the pirates&apos; drawings.<br>----m lines, each with two integers l and r such that 1 &lt;= l &lt;= n, 1 &lt;= r &lt;= n, l != r, meaning that the tower Tl is drawn to the left of tower Tr.","type":"input_format","format":"html"},{"title":"Output","content":"For every test case in the input, the output should contain:<br>1.One line with an integer i (1 &lt;= i &lt;= n), identifying the i-th island in the archipelago, for each island that could be the treasure island. These lines need to be in increasing order.<br>2.One line containing the number 0.<br>The following input describes one archipelago with one test case, namely the information corre-sponding to the map and the views shown in Figure 2. The potential treasure islands are Rummet, Alet, and Schnahpsum.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n9\n28 34\n32 30\n12 29\n27 22\n42 23\n18 18\n5 14\n26 12\n34 5\n1\n4\n1 2\n1 9\n2 9\n4 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6\n7\n8\n0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2011&amp;source=1&amp;searchmode=source\"> BAPC 2011 </a> ","type":"source","format":"html"}]}