{"title":"Walking the Plank","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4204","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4204&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4204","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4204"},"statement":[{"title":"Problem Description","content":"A bunch of pirates have successfully conquered a commercial vessel. The ship itself is too badly damaged, so the entire shipload needs to be transferred to the pirate ship.<br>The pirates have anchored a plank to both ships, which the pirates can use to go from one ship to the other, but it can only support one pirate at a time.<br>Each pirate executes the following routine:<br>1. Walk across the plank from the pirate ship to the commercial ship<br>2. Pick up an item from the cargo hold and return to the plank<br>3. Cross the plank back to the pirate ship with the item<br>4. Put the item in the cargo hold and return to the plank<br>Each of these four steps takes a given amount of time for each pirate. Every pirate will repeat these steps until the number of pirates on the commercial ship equals the number of items there (i.e. there&apos;s nothing more for the pirate to collect).<br>If a pirate gets to the plank and it&apos;s in use by another pirate, he will wait at his side of the plank. When the plank is vacated and there are pirates on both sides of the plank, the pirates on the side of the commercial vessel (carrying some item) will get to go first. At both sides of the plank, the pirates queue up, i.e. the first one to get there will be the first one to cross. Should two or more pirates arrive at the same side of the plank at the exact same time, the pirate who was slowest (i.e. the one who has taken the most time to and from the cargo hold on this ship) gets to go first.Can you determine how long it takes before the last pirate has crossed the plank with the last item?","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains a single number: the number of test cases to follow. Each test case has the following format:<br>1.One line with two integers N and P, satisfying 1 &lt;= N &lt;= 100,000 and 1 &lt;= P &lt;= 1,000: the number of items on the commercial vessel and the number of pirates, respectively.<br>2.P lines, each with 4 integers t1 through t4, satisfying 1 &lt;= ti &lt;= 1,000: the time in seconds it takes this pirate to complete each step (as listed above).<br>At the start, all pirates are queued up at the plank on the pirate ship in the order given in the input  (the first pirate is the first to cross over).","type":"input_format","format":"html"},{"title":"Output","content":"For every test case in the input, the output should contain one integer on a single line: the time in seconds between the time the first pirate starts crossing the plank and the time the last pirate has crossed the plank carrying the last item.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3 3\n10 3 10 3\n10 3 10 3\n10 3 10 3\n3 2\n10 10 10 10\n1 9 1 8\n3 2\n3 2 3 6\n4 2 5 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">63\n50\n24</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2011&amp;source=1&amp;searchmode=source\"> BAPC 2011 </a> ","type":"source","format":"html"}]}