{"title":"Parking Ships","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4205","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4205&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4205","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4205"},"statement":[{"title":"Problem Description","content":"Life on the great oceans has been good for captain Blackbeard and his fellow pirates. They have gathered so many treasures, that each of them is able to buy a house on their favorite island. The houses on this island are all placed in a long row along the beach line of the island. Next to a house, every pirate is also able to buy his own ship to do their own bit of plundering. However, this causes a whole new kind of problem.<br>Along the beach line there is a long pier where every pirate can park his ship. Although there is enough space along the pier for all the ships, not every pirate will be able to park in front of his house. A pirate is happy with his parking space if some part of the parking space is in front of the center of his house. Captain Blackbeard has been given the diffcult task of assigning the parking spaces to the pirates. A parking space for a pirate i is a range [ai, bi] (ai, bi&#x2208;R) along the pier such that li&lt;= bi - ai, where li is the length of the ship of pirate i. Thus, pirate i is happy if ai &lt;= xi &lt;= bi, where xi is the center of the house of pirate i. Clearly, parking spaces of different pirates must be interior disjoint (the ends of ranges can coincide).<br>Above all, the captain wants a good parking space for himself, so he gives himself the parking space such that the center of his ship is aligned with the center of his house. Next to that, he wants to make as many pirates happy as possible. Can you help him out?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains a single number: the number of test cases to follow. Each test case has the following format:<br>1.One line with one integer n (1 &lt;= n &lt;= 1,000): the number of pirates including the captain.<br>2.n lines with on each line two integers xi (-10^9 &lt;= xi &lt;= 10^9) and li (1 &lt;= li &lt;= 10^9): the center of the house of the ith pirate and the total length of his ship, respectively. The first pirate in the input is always the captain.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case in the input, the output should contain one integer on a single line: the maximum number of happy pirates using an optimal assignment of the parking spaces. This number includes the captain himself. You can assume that the space along the pier is unbounded in both directions.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5\n0 6\n-5 2\n-4 1\n4 2\n5 3\n4\n0 4\n-5 4\n3 4\n5 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2011&amp;source=1&amp;searchmode=source\"> BAPC 2011 </a> ","type":"source","format":"html","require":["katex"]}]}