{"title":"Treasure Map","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4206","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4206&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4206","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4206"},"statement":[{"title":"Problem Description","content":"&quot;Take 147 steps due north, turn 63 degrees clockwise, take 82 steps, ...&quot;. Most people don&apos;t realize how important accuracy is when following the directions on a pirate&apos;s treasure map. If you&apos;re even a tiny bit off at the start, you&apos;ll end up far away from the correct location at the end. Pirates therefore use very exact definitions. One step, for instance, has been defined by the 1670 Pirate Convention to be exactly two times the size of the wooden leg of Long John Silver, or 1.183 m in metricunits.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C392-1010-1.png\"></center><br>Captain Borbassa was thus not at all worried when he set sail to the treasure island, having a rope with knots in it, exactly one step apart, for accurately measuring distances. Of course he also brought his good old geotriangle, once given to him by his father when he was six years old.<br>However, on closer inspection of the map, he got an unpleasant surprise. The map was made by the famous captain Jack Magpie, who was notorious for including little gems into his directions.In this case, there were distances listed such as sqrt(33) steps. How do you measure that accurately? Fortunately, his first mate Pythagor came to the rescue. After puzzling for a few hours, he came up with the following solution: let pirate A go 4 steps into the perpendicular direction, and hold one end of the measuring rope there. Then pirate B goes into the desired direction while letting the rope slide through his fingers, until he is exactly 7 steps away from pirate A. Pythagor worked out a formula that states that pirate B has then traveled exactly sqrt(33) steps.<br>Captain Borbassa was impressed, but he revealed that there were more such distances on the map. Paranoid as he is, he refuses to let Pythagor see the map, or even tell him what other distances there are on it. They are all square roots of integers, that&apos;s all he gets to know. Only on the island itself will the captain reveal the numbers, and then he expects Pyhtagor to quickly work out the smallest two integer numbers of steps that can combine to create the desired distance, using the method described above.<br>Pythagor knows this is not easy, so he has asked your help. Can you help him by writing a program that can determine these two integers quickly? By the way, he did ask the captain how large the numbers inside the square root could get, and the captain replied &quot;one billion&quot;. He was probably exaggerating, but you&apos;d better make sure the program works.<br>If you can successfully help the pirates, you&apos;ll get a share of the treasure. It might be gold, it might be silver, or it might even be... a treasure map!","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains a single number: the number of test cases to follow. Each test case has the following format:<br>1.One line with one integer N, satisfying 1 &lt;= N &lt;= 10^9.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every test case in the input, the output should contain two nonnegative integers, separated by a space, on a single line: the distance pirate A needs to head in the perpendicular direction, and the final distance between pirate A and B, such that pirate B has traveled sqrt(N) steps. If there are multiple solutions, give the one with the smallest numbers. If there are no solutions, the output should be &quot;IMPOSSIBLE&quot; (without the quotation marks) on a single line.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n33\n16\n50\n101</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 7\n0 4\nIMPOSSIBLE\n50 51</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BAPC+2011&amp;source=1&amp;searchmode=source\"> BAPC 2011 </a> ","type":"source","format":"html","require":["katex"]}]}