{"title":"Laser Tag","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4208","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4208&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4208","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4208"},"statement":[{"title":"Problem Description","content":"A Laser Tag environment is set up with a number of upright, rectangular, double-sided mirrors, all reaching high over head.  These mirrors can reflect your laser beam, allowing you multiple ways to shoot your opponents.  Unfortunately, they can also reflect your laser beam in such a way that it hits you by mistake.  Your job is to calculate the angles that result in shooting yourself (so that you can avoid them).<br>The mirrors are not perfectly reflective, so we only need to worry about shots with at most 7 reflections.  Below are several possible setups.  In the figures the views are looking down from above.  The mirrors are shown as black segments.  All the paths that lead back to the firing point are shown in gray.  Take the point of firing as the center of a Cartesian coordinate system, with postive x to the right and positive y up the page.  The coordinates of the origin and the ends of the mirrors are shown.  For simplicity assume the mirrors have negligible thickness.  Each path is labeled with the initial firing angle, measured in degrees counterclockwise from the postive x axis and rounded to the nearest degree, 0 through 359.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/4208-2.png\"></center><pre>    </pre><center><img style=\"max-width:100%;\" src=\"../../data/images/4208-1.png\"></center>","type":"description","format":"html"},{"title":"Input","content":"The input contains one or more data sets.  Each data starts with a line containing the number of mirrors, n, 1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 7.  The next n lines each contain the (x, y) coordinates of the ends of one mirror, so there is a sequence of 4 numbers for each mirror, x1 y1 x2 y2.  All coordinates are integers with magnitude less than 1000.  No mirrors intersect or touch.  No mirror passes through the origin.  <br>After the last dataset is a line containing only 0.","type":"input_format","format":"html"},{"title":"Output","content":"For each data set output a single line.  If there are one or more paths back to the origin with no more than 7 reflections, collect the starting angles rounded to the nearest degree.  All rounded angles, a, should be normalized so 0 &#xFFFD;&#xFFFD; a &#xFFFD;&#xFFFD; 359.  Eliminate any duplicates and print the integers out in increasing order on one line, using a single blank as separator.  If there is no such path back, output &quot;no danger&quot;.  No path will hit the exact edge of a mirror.  No line of output will have more than 79 characters. Please note that although the output is rounded to the nearest angle, your internal computations should be based on double-precision floating-point computations.<br>The first two example data sets correspond to the Figures, and the third merely omits the bottom mirror from the second data set.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 1 -1 4\n-2 4 -2 -1\n4 \n3 10 13 10\n-13 17 -7 23\n33 17 27 23\n10 -10 20 -10\n3\n3 10 13 10\n-13 17 -7 23\n33 17 27 23\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">45 67 90 135 157 180\n29 61 63 117\nno danger</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=MCPC+2011&amp;source=1&amp;searchmode=source\"> MCPC 2011 </a> ","type":"source","format":"html"}]}