{"title":"Refrigerator Magnets","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4211","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4211&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4211","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4211"},"statement":[{"title":"Problem Description","content":"Like many families with small children, my family&#xFFFD;&#xFFFD;s refrigerator is adorned with a set of alphabet magnets:  26 separate magnets, each containing one letter of the alphabet. These magnets can be rearranged to create words and phrases. I feel it is my parental duty to use these magnets to create messages that are witty and insightful, yet at the same time caring and supportive. Unfortunately, I am somewhat hindered in this task by the fact that I can only make phrases that use each letter once.<br>For example, a nice inspiring message to leave for the children might be, &#xFFFD;&#xFFFD;I LOVE YOU.&#xFFFD;&#xFFFD; Unfortunately, I cannot make this message using my magnets because it requires two letter &quot;O&quot;s. I can, however, make the message, &#xFFFD;&#xFFFD;I LOVE MUSTARD.&#xFFFD;&#xFFFD; Admittedly this message isn&apos;t as meaningful, but it does manage to not use any letters more than once.<br>You are to write a program that will look at a list of possible phrases and report which phrases can be written using refrigerator magnets.","type":"description","format":"html"},{"title":"Input","content":"The input will consist of one or more lines, ending with a line that contains only the word &#xFFFD;&#xFFFD;END&#xFFFD;&#xFFFD;.<br>Each line will be 60 characters or less, and will consist of one or more words separated by a single space each, with words using only uppercase letters (A&#xFFFD;CZ). There will not be any leading or trailing whitespace, and there will not be any blank lines.","type":"input_format","format":"html"},{"title":"Output","content":"Output only the lines which can be written in refrigerator magnets&#xFFFD;&#xFFFD;that is, the lines which have no duplicate letters. Output them exactly the same as they were in the input&#xFFFD;&#xFFFD;white spaces and all. Do not output the final &#xFFFD;&#xFFFD;END&#xFFFD;&#xFFFD; string.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">I LOVE YOU\nI LOVE MUSTARD\nHAPPY BIRTHDAY\nGLAD U BORN\nSMILE\nIMAGINE\nWHATS UP DOC\nHAVE A NICE DAY\nEND</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">I LOVE MUSTARD\nGLAD U BORN\nSMILE\nWHATS UP DOC</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=MCPC+2011&amp;source=1&amp;searchmode=source\"> MCPC 2011 </a> ","type":"source","format":"html"}]}