{"title":"Sokoban","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4213","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4213&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4213","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4213"},"statement":[{"title":"Problem Description","content":"Soko-ban is a Japanese word for a warehouse worker, and the name of a classic computer game created in the 1980s. It is a one-player game with the following premise. A single worker is in an enclosed warehouse with one or more boxes. The goal is to move those boxes to a set of target locations, with the number of target locations equalling the number of boxes. The player indicates a direction of motion for the worker using the arrow keys (up, down, left, right), according to the following rules.<br><strong>1.</strong>If the indicated direction of motion for the worker leads to an empty location (i.e., one that does not have a box or wall), the worker advances by one step in that direction.<br><strong>2.</strong>If the indicated direction of motion would cause the worker to move into a box, and the location on the other side of the box is empty, then both the worker and the box move one spot in that direction (i.e., the worker pushes the box).<br><strong>3.</strong>If the indicated direction of motion for a move would cause the worker to move into a wall, or to move into a box that has another box or a wall on its opposite side, then no motion takes place for that keystroke.<br>The goal is to simultaneously have all boxes on the target locations. In that case, the player is successful (and as a formality, all further keystrokes will be ignored).<br>The game has been studied by computer scientists (in fact, one graduate student wrote his entire Ph.D. dissertation about the analysis of sokoban). Unfortunately, it turns out that finding a solution is very difficult in general, as it is both NP-hard and PSPACE-complete. Therefore, your goal will be a simpler task: simulating the progress of a game based upon a player&apos;s sequence of keystrokes. For the sake of input and output, we describe the state of a game using the following symbols:<br><center><img style=\"max-width:100%;\" src=\"../../data/images/4213-1.png\"></center><br>For example, the initial configuration diagrammed at the beginning of this problem appears as the first input case below.","type":"description","format":"html"},{"title":"Input","content":"Each game begins with a line containing integers R and C, where 4 &#xFFFD;&#xFFFD; R &#xFFFD;&#xFFFD; 15 represents the number of rows, and 4 &#xFFFD;&#xFFFD; C &#xFFFD;&#xFFFD; 15 represents the number of columns. Next will be R lines representing the R rows from top to bottom, with each line having precisely C characters, from left-to-right. Finally, there is a line containing at most 50 characters describing the player&apos;s sequence of keystrokes, using the symbols U, D, L, and R respectively for up, down, left, and right. You must read that entire sequence from the input, even though a particular game might end successfully prior to the end of the sequence. The data set ends with the line 0 0.<br>We will guarantee that each game has precisely one worker, an equal number of boxes and locations, at least one initially misplaced box, and an outermost boundary consisting entirely of walls.","type":"input_format","format":"html"},{"title":"Output","content":"For each game, you should first output a line identifying the game number, beginning at 1, and either the word complete or incomplete, designating whether or not the player successfully completed that game. Following that should be a representation of the final board configuration.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8 9\n#########\n#...#...#\n#..bb.b.#\n#...#w#.#\n#...#b#.#\n#...++++#\n#...#..##\n#########\nULRURDDDUULLDDD\n6 7\n#######\n#..####\n#.+.+.#\n#.bb#w#\n##....#\n#######\nDLLUDLULUURDRDDLUDRR\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Game 1: incomplete\n#########\n#...#...#\n#..bb...#\n#...#.#.#\n#...#.#.#\n#...+W+B#\n#...#b.##\n#########\nGame 2: complete\n#######\n#..####\n#.B.B.#\n#.w.#.#\n##....#\n#######</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=MCPC+2011&amp;source=1&amp;searchmode=source\"> MCPC 2011 </a> ","type":"source","format":"html"}]}