{"title":"Graph Theory?","time_limit":8000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4222","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4222&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4222","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4222"},"statement":[{"title":"Problem Description","content":"In mathematics and computer science, graph theory is the study of graphs, mathematical structures used to model pairwise relations between objects from a certain collection. A graph is a collection of vertices and a collection of edges that connect pairs of vertices. <br>Simple word, we have an undirected graph with weight on its edge, and we want to choose a key point on this graph, be careful, the key point can be not only on a vertex, but also on an edge.<br>To make the problem more close to reality and easy to understand, imagine it&#xFFFD;&#xFFFD;s a country where everybody wants to go aboard, say TC for example, and the key point is the only exit of this country to the outside colorful world. The N vertices can be treated as cities, M edges as roads. And if the key point is chosen, everyone in every city will choose a shortest path to the key point, and leave this country as if one second more will erase the purity and dignity.<br>But one last thing, visa. To simplify the problem, we already change the ID order and only the last K vertices have a visa office. One may choose any of those cities to get a visa. Of course, they will choose a visa-city to make the total length as short as possible.<br>And now, we come back to handle the original problem, where should the key vertex be? There are also two viewpoints for judging where the most perfect place is. We use Di to record the minimum cost for people in city i to get a visa and reach the key point, and Pi people in this city. The first opinion claims the Max(Di * Pi)  to be as small as possible, while the second claims the Sum(Di * Pi)  to be as small as possible. Your task is to solve both of these requests. <br>For each request, report the minimum value it claims, and then, report the place it can choose to achieve that value. If more than one such place, report INFINITE instead (you may assume the people in TC only know 0 and 1, other numbers are just infinite for them).<br>If you need to report a chosen place for key point, report the first edge id (1-based) the point appears, and then the distance between the point and the first vertex. For example, if there is only an edge &lt;1, 2&gt;, and the key point lies in vertex 1, report (1, 0.000).<br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer T, indicating the number of test cases.<br>Each test case includes three integers N, M, K. Then a line with N integers Pi follows. Then M lines following, each line contains three integers Ai, Bi, Ci, describing an undirected road. You can assume there is as least one path between any city pair.<br><br><b>Technical Specification</b><br>1. 1 &lt;= T &lt;= 64<br>2. 1 &lt;= K &lt; N &lt;= 32<br>3. 0 &lt;= Pi &lt;= 1024<br>4. N - 1 &lt;= M &lt;= 512<br>5. 1 &lt;= Ci &lt;= 1024<br>6. 1 &lt;= Ai, Bi &lt;= N, Ai != Bi, no edge pair appears more than once.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the case number in the first line. Then two lines, the first line describe the max request, and the second describe the sum request, as the format in the description. <br>Separate them by exactly one space, print &#xFFFD;&#xFFFD;INFINITE&#xFFFD;&#xFFFD; without quote if needed, and round all the floating numbers to three fractional digits. Refer to the sample output for more details. <br>Even more than one such place, you should report the minimum value it claims first.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 3 1\n1 2 3\n1 2 1\n2 3 2\n1 3 3\n4 4 2\n3 2 1 1\n1 2 2\n2 3 2\n3 4 2\n4 1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n4.000 2 2.000\n7.000 2 2.000\nCase 2:\n7.200 3 1.600\n16.000 3 2.000</div></pre>","type":"example","format":"html"},{"title":"Author","content":"iSea@WHU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%CA%D7%BD%EC%BB%AA%D6%D0%C7%F8%B3%CC%D0%F2%C9%E8%BC%C6%D1%FB%C7%EB%C8%FC%F4%DF%B5%DA%CA%AE%BD%EC%CE%E4%BA%BA%B4%F3%D1%A7%B3%CC%D0%F2%C9%E8%BC%C6%B4%F3%C8%FC&amp;source=1&amp;searchmode=source\"> &#xFFFD;&#x5FD;&#xCEEA;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x7F5;&#xFFFD;&#x2AE;&#xFFFD;&#xFFFD;&#xFFFD;&#x4EBA;&#xFFFD;&#xFFFD;&#x467;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x1B4;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}