{"title":"Sunday Drive","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4226","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4226&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4226","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4226"},"statement":[{"title":"Problem Description","content":"After wracking your brains at a programing contest on Saturday, you&#x2019;d like to relax by taking a leisurely Sunday drive. But, gasoline is so expensive nowadays! Maybe, by creatively changing lanes, you can minimize the distance you travel<br>and save some money!<br>You will be given a description of several sections of a highway. All sections will have the same number of lanes. Think of your car as a point mass, moving down the center of the lane. Each lane will be 10 feet wide. There are two kinds of highway sections: curved and straight. You can only change lanes on straight sections, and it takes a minimum of 100 feet of the straight section to move over one lane. You can take longer than that, of course, if you choose.<br>All curve sections will make 90 degree turns. You cannot change lanes on a curve section. In addition, you must be driving along the exact middle of a lane during a turn. So during a turn your position will be 5 feet, or 15 feet, or 25 feet from the edge, etc.<br>Given a description of a highway, compute the minimum total distance required travel the entire highway, including curves and lane changes. You can start, and end, in any lane you choose. Assume that your car is a point mass in the center of the lane. The highway may cross over/under itself, but the changes in elevation are miniscule, so you shouldn&#x2019;t worry about their impact on your distance traveled.<br><center>In order to be used to cross 2 lanes,</center><br><center>this straight section must be at least 200 feet long.</center><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C394-1001-1.jpg\"></center>","type":"description","format":"html"},{"title":"Input","content":"There will be several test cases in the input. Each test case will begin with two integers<br>N M<br>Where N (1 &#x2264; N &#x2264; 1,000) is the number of segments, and M (2 &#x2264; M &#x2264; 10) is the number of lanes. <br>On each of the next N lines will be a description of a segment, consisting of a letter and a number, with a single space between them:<br>T K<br>The letter T is one of S, L, or R (always capital). This indicates the type of the section: a straight section (S), a left curve (L) or a right curve (R). If the section is a straight section, then the number K (10 &#x2264; K &#x2264; 10,000) is simply its length, in feet. If the section is a right or left curve, then the number K (10 &#x2264; K &#x2264; 10,000) is the radius of the inside edge of the highway, again in feet. There will never be consecutive straight sections in the input, but multiple consecutive turns are possible. The input will end with a line with two 0s.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a single number on its own line, indicating the minimum distance (in feet) required to drive the entire highway. The number should be printed with exactly two decimal places, rounded. Output no extra spaces, and do not separate answers with blank lines.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\nR 100\nS 1000\nL 100\n9 5\nS 2500\nL 500\nS 2000\nL 500\nS 5000\nL 500\nS 2000\nL 500\nS 2500\n5 4\nL 100\nL 100\nL 100\nL 100\nL 100\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1330.07\n17173.01\n824.67</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SER2011&amp;source=1&amp;searchmode=source\"> SER2011 </a> ","type":"source","format":"html"}]}