{"title":"Folding Game ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4231","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4231&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4231","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4231"},"statement":[{"title":"Problem Description","content":"Alice and Bob are playing a game. Alice places a rectangular piece of paper in front of Bob with width W and height H. Then she proceeds to fold the paper N times. Each fold is either horizontal or vertical. Folding the paper horizontally leaves another rectangle of the same width W and smaller height h. Similarly, a vertical fold leaves a rectangle with same height H and smaller width w.<br>In the end, Alice puts her finger on some point on the resulting rectangle and asks &apos;Bob, how many layers of paper are directly beneath my finger?&apos;.","type":"description","format":"html"},{"title":"Input","content":"There will be several test cases in the input. Each test case will begin with a line with three integers:<br>W H N<br>Where W and H (0 &lt; W,H &#x2264; 1,000,000) are the width and height of the paper, and N (0 &#x2264; N &#x2264; 20) is the number of folds. W and H are guaranteed to be even. On each of the subsequent N lines there will be a letter and a number, separated by a single space:<br>D K<br>The letter D is one of { &#x2018;T&#x2019;, &#x2018;B&#x2019;, &#x2018;L&#x2019;, &#x2018;R&#x2019; } indicating whether the fold is from the Top, Bottom, Left or Right. It will always be capital. The number K indicates where Alice makes the fold, measured from the given edge. For example, if D is &#x2018;T&#x2019;, then Alice starts with the paper lying flat, lifts the TOP edge and folds it downward. K is guaranteed to be on the paper, and it is guaranteed to be even.<br>On the final line of each case there will be two integers:<br>X Y<br>Which indicate the point where Alice puts her finger. This is measured from the bottom left corner, with X being the distance towards the right, and Y being the distance towards the top. The point (X,Y) is guaranteed to be on the fully folded paper. Both X and Y are also guaranteed to be odd. Since W, H and K are all even, this assures that the point (X,Y) will not be over any edge or fold.<br>The input ends with a line with three 0s.","type":"input_format","format":"html"},{"title":"Output","content":"For each case output a single integer on its own line, indicating the number of layers of paper at the given point (X,Y). Output no extra spaces, and do not separate answers with blank lines.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10 10 1\nB 4\n5 1\n10 10 1\nB 4\n7 5\n10 10 1\nT 6\n3 1\n10 10 1\nT 6\n9 3\n14 10 2\nL 4\nR 4\n3 3\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n1\n2\n3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SER2011&amp;source=1&amp;searchmode=source\"> SER2011 </a> ","type":"source","format":"html"}]}