{"title":"Burnout ","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4232","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4232&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4232","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4232"},"statement":[{"title":"Problem Description","content":"Whenever you buy a light bulb, the package will state an amount of time that the bulb should last. But, that&apos;s assuming the bulb is on continuously. Most people turn their light bulbs on and off. How does this affect their lifetime?<br>A friend of yours has built a rig to test this. Given a simple pattern, his rig will turn the bulb on and off, and a light sensor will tell when the bulb burns out. The pattern has a very simple syntax. It consists of a list of elements, separated by spaces. Each element is either a number M (1 &#x2264; M &#x2264; 1,000,000), indicating a number of milliseconds, or a repeating list. A repeating list consists of one or more elements, surrounded by parentheses, and followed by a &#x2018;*&#x2019; and then an integer K (1 &#x2264; K &#x2264; 100). This integer K indicates how many times the list should be repeated. Your friend&#x2019;s machine always starts with the bulb on, and then goes through the pattern. For every integer, it waits that number of milliseconds, and then switches the bulb. If the bulb is on, it&apos;s turned off, and if it&apos;s off, it gets turned back on. If the machine reaches the end of the pattern, it will start again from the beginning.<br>For example, with this pattern:<br>1 3 5<br>The machine will start by turning the bulb on.<br>It will wait 1 millisecond and turn the bulb off.<br>It will then wait 3 milliseconds and turn the bulb on.<br>It will then wait 5 milliseconds and turn the bulb off.<br>It will then wait 1 millisecond and turn the bulb on.<br>It will then wait 3 milliseconds and turn the bulb off.<br>It will continue like this until the bulb burns out.<br>Here&apos;s an example of a pattern with a repeating section:<br>1 (3 5)*2 7<br>The machine will start by turning the bulb on, and will change the bulb&#x2019;s state after 1 millisecond, then 3, then 5, then 3, then 5, then 7, then 1.....<br>Note that repeating sections can be nested inside of repeating sections.<br>Your friend is not good with programming, though, so he&apos;s asked you to help. He can easily measure how long it takes for the bulb to actually burn out - but, how long SHOULD it have taken? Assume that turning the bulb on and off does NOT affect its life. Also assume that changing the bulb&#x2019;s state takes no time.<br>Given a life N in milliseconds, and a pattern of turning the bulb on and off, how many actual milliseconds would elapse before the bulb is on for exactly N milliseconds?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be several test cases in the input. Each test case will consist of two lines. The first line will contain an integer N (1 &#x2264; N &#x2264; 1,000,000,000) which is the expected life of the bulb in milliseconds.<br>The second line will contain a string, which is the pattern. The pattern will not be longer than 500 characters. The pattern consists of a list of elements, separated by single spaces. Each element is either a number M (1 &#x2264; M &#x2264; 1,000,000), indicating a number of milliseconds, or a repeating list. A repeating list consists of one or more elements, surrounded by parentheses, and followed by a &#x2018;*&#x2019; and then an integer K (1 &#x2264; K &#x2264; 100). There will be single spaces separating elements of a list, but nowhere else. In particular, note that there will not be any spaces surrounding the &#x2018;*&#x2019; at the end of a repeating list, nor immediately following an opening parenthesis, nor immediately before a closing parenthesis. The total amount of time represented by a pattern, including all repetition, will be no greater than 1,000,000,000.<br>The input will terminate with a line with a single 0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a single integer on its own line, indicating the number of milliseconds of total elapsed time until the bulb has been lit for N milliseconds. Output no extra spaces, and do not separate answers with blank lines.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">100\n20 30 40\n1000\n1 3 5\n1000\n1 (3 (5)*3 2)*2 7\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">190\n1999\n2279</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SER2011&amp;source=1&amp;searchmode=source\"> SER2011 </a> ","type":"source","format":"html","require":["katex"]}]}