{"title":"Moving Points ","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4234","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4234&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4234","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4234"},"statement":[{"title":"Problem Description","content":"Consider a number of Target points in a plane. Each Target point moves in a straight line at a constant speed, and do not change direction. Now, consider a Chaser point that starts at the origin, and moves at a speed faster than any of the Target points. The Chaser point moves at a constant speed, but it is capable of changing direction at will. It will &#x2018;Catch&#x2019; a Target point, and then move from there to catch another Target point, and so on.<br>Given the parameters of the Chaser point and the Target points, what is the least amount of time it takes the Chaser point to catch all of the Target points? &#x2018;Catch&#x2019; simply means that the Catcher and the Target occupy the same point in the plane at the same time. This can be instantaneous; there&#x2019;s no need for the Catcher to stay with the Target for any non-zero length of time.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There will be several test cases in the input. Each test case will begin with two integers<br>N C<br>Where N (1 &#x2264; N &#x2264; 15) is the number of Target points, and C (0 &lt; C &#x2264; 1,000) is the speed of the Chaser point. Each of the next N lines will have four integers, describing a Target point:<br>X Y D S<br>Where (X,Y) is the location in the plane (-1000 &#x2264; X,Y &#x2264; 1,000) of that Target point at time 0, D (0 &#x2264; D &lt; 360) is the direction of movement in Degrees (0 degrees is the positive X axis, 90 degrees is the positive Y axis), and S (0 &#x2264; S &lt; C) is the speed of that Target point. It is assumed that all Target points start moving immediately at time 0.<br>The input will end with a line with two 0s.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a single real number on its own line, representing the least amount of time needed for the Chaser point to catch all of the Target points. Print this number to exactly 2 decimal places, rounded. Output no extra spaces, and do not separate answers with blank lines.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 25\n19 19 32 10\n6 45 133 19\n5 10\n10 20 45 3\n30 10 135 4\n100 100 219 5\n10 100 301 4\n30 30 5 3\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">12.62\n12.54</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=SER2011&amp;source=1&amp;searchmode=source\"> SER2011 </a> ","type":"source","format":"html","require":["katex"]}]}