{"title":"A Famous Airport Manager","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4246","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4246&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4246","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4246"},"statement":[{"title":"Problem Description","content":"Mr. B is an airport manager. One day after lunch he looked out of his office and found that the color of each plane in the airport is either blue or green. Before supper he looked the airport again, and found that no plane is in the airport now. He couldn&apos;t remember the order in which the planes took off, but he knew between his two observations no plane had arrived at the airport. In addition, while one plane is setting its way to the takeoff area, the remaining planes must stay at their own position and not move. In other words, considering the planes taking off in a specific order, the first plane will move while others stay at their own position. After the first plane took off, the second plane could move to the takeoff area and so on, until all the planes gone. Now he wants you to find out the number of different possible color sequences he might see, if he watched at the takeoff area during the whole afternoon.<br><br>The airport can be divided into 9 square areas (3 rows x 3 columns), and at most one plane can be parked in one area. The area located at the first column of the first row is the &quot;takeoff area&quot;. The plane can take off only in the takeoff area. Besides, each plane (including the one in the takeoff area) can move to a vacant neighboring area. Two areas are neighboring if and only if they share an edge.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Each test case contains 3 lines, each of which contains 3 characters &apos;*&apos;, &apos;B&apos;, &apos;G&apos;, denoting that the corresponding area is currently vacant, occupied by a blue plane, or occupied by a green plane, respectively. The first character of the first row is always a &apos;*&apos;. There is at least one place in the apron.<br><br>There are about 30,000 test cases. Be careful!","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, display a single line containing the case number and the number of different possible color sequences Mr. B might see.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">*BB\nBBB\nBBB\n*GB\nBBB\nBBB</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1\nCase 2: 8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Fudan+Local+Programming+Contest+2012&amp;source=1&amp;searchmode=source\"> Fudan Local Programming Contest 2012 </a> ","type":"source","format":"html","require":["katex"]}]}