{"title":"The Famous ICPC Team Again","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4251","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4251&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4251","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4251"},"statement":[{"title":"Problem Description","content":"When Mr. B, Mr. G and Mr. M were preparing for the 2012 ACM-ICPC World Final Contest, Mr. B had collected a large set of contest problems for their daily training. When they decided to take training, Mr. B would choose one of them from the problem set. All the problems in the problem set had been sorted by their time of publish. Each time Prof. S, their coach, would tell them to choose one problem published within a particular time interval. That is to say, if problems had been sorted in a line, each time they would choose one of them from a specified segment of the line.<br><br>Moreover, when collecting the problems, Mr. B had also known an estimation of each problem&#x2019;s difficultness. When he was asked to choose a problem, if he chose the easiest one, Mr. G would complain that &#x201C;Hey, what a trivial problem!&#x201D;; if he chose the hardest one, Mr. M would grumble that it took too much time to finish it. To address this dilemma, Mr. B decided to take the one with the medium difficulty. Therefore, he needed a way to know the median number in the given interval of the sequence.","type":"description","format":"html"},{"title":"Input","content":"For each test case, the first line contains a single integer n (1 &lt;= n &lt;= 100,000) indicating the total number of problems. The second line contains n integers xi (0 &lt;= xi &lt;= 1,000,000,000), separated by single space, denoting the difficultness of each problem, already sorted by publish time. The next line contains a single integer m (1 &lt;= m &lt;= 100,000), specifying number of queries. Then m lines follow, each line contains a pair of integers, A and B (1 &lt;= A &lt;= B &lt;= n), denoting that Mr. B needed to choose a problem between positions A and B (inclusively, positions are counted from 1). It is guaranteed that the number of items between A and B is odd.","type":"input_format","format":"html"},{"title":"Output","content":"For each query, output a single line containing an integer that denotes the difficultness of the problem that Mr. B should choose.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n5 3 2 4 1\n3\n1 3\n2 4\n3 5\n5\n10 6 4 8 2\n3\n1 3\n2 4\n3 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n3\n3\n2\nCase 2:\n6\n6\n4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Fudan+Local+Programming+Contest+2012&amp;source=1&amp;searchmode=source\"> Fudan Local Programming Contest 2012 </a> ","type":"source","format":"html"}]}