{"title":"CosmoCraft","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4257","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4257&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4257","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4257"},"statement":[{"title":"Problem Description","content":"In the two-player game CosmoCraft you manage an economy in the hopes of producing an army capable of defeating your opponent. You manage the construction of workers, production facilities, and army units; the game revolves around balancing the resources you allocate to each. The game progresses in turns.<br><strong>1. </strong> Workers give you income at the rate of 1 dollar per turn. <br><strong>2. </strong> Production facilities let you produce either an army unit or a worker for the cost of 1 dollar. (only 1 army unit or worker can be produced per turn per facility) <br><strong>3. </strong> It costs 1 dollar to create a production facility. <br><strong>4. </strong> Your army, of course, lets you fight against your opponent. <br>You start off with n workers and k production facilities. The game progresses in turns &#xFFFD;C at each turn, you can spend the income you get from your workers on a mixture of workers, army, and creating production facilities. Workers produced this round do not give you income until the next round; likewise, production facilities do not become active until the next round. Any unspent income from the current round carries over to the next. <br>At the end of a round, you can take the total army you&#xFFFD;&#xFFFD;ve produced and attack your opponent; if you have strictly more units than your opponent, the opponent loses immediately, and you retain the difference of the army sizes. Otherwise, your army is crushed and your opponent is left with the difference of the army sizes. (it would be wise for him to counter-attack after this, but you don&#xFFFD;&#xFFFD;t lose immediately at least). The game ends after t turns, at which point both players will usually attack with the larger army reigning victorious. <br>You&#xFFFD;&#xFFFD;re playing against your friend, and since you&#xFFFD;&#xFFFD;ve played against him so many times you know exactly what he&#xFFFD;&#xFFFD;s going to spend his money on at every turn, and exactly when he&#xFFFD;&#xFFFD;s going to attack. Knowing this, you&#xFFFD;&#xFFFD;ve decided that the best strategy is to play defensively &#xFFFD;C you just want to survive every attack, and amass as large an army in the meantime so you can counterattack (and hopefully win) at the end of the game. <br>What&#xFFFD;&#xFFFD;s the largest army you can have at the end of the game, given that you must survive all your friend&#xFFFD;&#xFFFD;s attacks? ","type":"description","format":"html"},{"title":"Input","content":"There will be several test cases in the input. Each test case will begin with a line with three integers: <br><strong>n k t </strong><br>where n (1&#xFFFD;&#xFFFD;<strong>n</strong>&#xFFFD;&#xFFFD;100) is the number of workers you start with, <strong>k</strong> (1&#xFFFD;&#xFFFD;<strong>k</strong>&#xFFFD;&#xFFFD;100) is the number of production facilities you have at the start, and <strong>t</strong> (1&#xFFFD;&#xFFFD;<strong>t</strong>&#xFFFD;&#xFFFD;10,000) is the number of turns. On the next line will be <strong>t</strong>-1 integers, <strong>a</strong><sub>i</sub> (0&#xFFFD;&#xFFFD;<strong>a</strong><sub>i</sub>&#xFFFD;&#xFFFD;Max signed 64-bit integer), separated by single spaces. The i<sup>th</sup> integer indicates the strength of the attack (that is, the number of army units your opponent is using in that attack) on turn i. The input will end with a line with three 0s. <br><div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div><br>Huge input, please ues c++.<br></div>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case output a single integer indicating the maximum number of armies you could have at the end of the game. Output -1 if it is impossible to survive. Output each integer on its own line, with no spaces, and do not print any blank lines between answers. While it is possible for some inputs to generate unreasonably large answers, all judge inputs yield answers which will fit in a signed 64-bit integer. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8 4 6\n22 6 10 14 0\n4 3 3\n0 0\n6 9 7\n0 0 11 0 7 0\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1\n11\n101</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+University+of+Chicago+Invitational+Programming+Contest+2012&amp;source=1&amp;searchmode=source\"> The University of Chicago Invitational Programming Contest 2012 </a> ","type":"source","format":"html"}]}