{"title":"The End of The World","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4260","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4260&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4260","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4260"},"statement":[{"title":"Problem Description","content":"Legend says that there is a group of monks who are solving a large Towers of Hanoi puzzle. The Towers of Hanoi is a well-known puzzle, consisting of three pegs, with a stack of disks, each a different size. At the start, all of the disks are stacked on one of the pegs, and ordered from largest (on the bottom) to smallest (on the top). The object is to move this stack of disks to another peg, subject to two rules: 1) you can only move one disk at a time, and 2) you cannot move a disk onto a peg if that peg already has a smaller disk on it.<br>The monks believe that when they finish, the world will end. Suppose you know how far they&#x2019;ve gotten. Assuming that the monks are pursuing the most efficient solution, how much time does the world have left?","type":"description","format":"html"},{"title":"Input","content":"There will be several test cases in the input. Each test case will consist of a string of length 1 to 63, on a single line. This string will contain only (capital) <strong>A</strong>s, <strong>B</strong>s and <strong>C</strong>s. The length of the string indicates the number of disks, and each character indicates the position of one disk. The first character tells the position of the smallest disk, the second character tells the position of the second smallest disk, and so on, until the last character, which tells the position of the largest disk. The character will be <strong>A</strong>, <strong>B</strong> or <strong>C</strong>, indicating which peg the disk is currently on. You may assume that the monks&#x2019; overall goal is to move the disks from peg <strong>A</strong> to peg <strong>B</strong>, and that the input represents a legitimate position in the optimal solution. The input will end with a line with a single capital <strong>X</strong>.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a single number on its own line indicating the number of moves remaining until the given Towers of Hanoi problem is solved. Output no extra spaces, and do not separate answers with blank lines. All possible inputs yield answers which will fit in a signed 64-bit integer.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">AAA\nBBB\nX</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7\n0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+University+of+Chicago+Invitational+Programming+Contest+2012&amp;source=1&amp;searchmode=source\"> The University of Chicago Invitational Programming Contest 2012 </a> ","type":"source","format":"html"}]}