{"title":"Dynamic Lover","time_limit":1500,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4270","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4270&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4270","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4270"},"statement":[{"title":"Problem Description","content":"As a famous person with universal love, changing girlfriend too often makes me harassment because I can&apos;t keep their name in mind timely. To remember who is my lover now, I buy a magic password-box from a wizard.<br>As a faithful atheist, I do not believe that it is caused by magic power. By doing a deep research, I find that all &quot;magic&quot; factors are just because a small software inside the box. Because the software only uses some simple data structure, it has a dissatisfied complexity.<br>Now I shortly introduce the principle of the software.<br>We will support a string with dynamic length and three kinds of operations on it. You can assume that we will always have an initial string.<br>*1. You will receive a short string, and you should <b><i>connect it after the original string to make the new string</i></b>.<br>*2. You will receive an integer len, and you should answer the query: for each index i (1 &lt;= i &lt;= LEN(nowString)), we will get a sub-string from i to i + len - 1 (if i + len - 1 &gt; LEN(nowString), you should make the suffix from index i as its sub-string). You should output the index i whose sub-string has minimum lexicographic.<br>*3. You will receive an integer len. You should delete the suffix whose length is len from the string now and get a new string.<br>As a former ACMer, I want to make a new production with better execution speed. But I am not good at data structure, so I need your help.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are multiple test cases.<br>The first line contains a string as the initial string.<br>The next line contains an integer m (1 &lt;= m &lt;= 100,000) indicating the number of the operations.<br>Each of the next m lines begins with an integer k (1 &lt;= k &lt;= 3) indicating the kind of operation. If k = 1, it is followed by a short non-empty string, otherwise it is followed by an integer len. <br>We guarantee that the total length of the initial string and all short strings are not more than 100,000. And for each query, the len is not more than 1000 and the total sum of len is not more than 100,000.<br>All characters in the input are lower case.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, you should output several lines.<br>For each query, you should output a line indicating the index i whose sub-string has minimum lexicographic. If more answers exist, output the minimal index.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">aacbab\n5\n2 2\n1 aaa\n2 3\n3 2\n2 3 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n9\n7</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Changchun+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Changchun Online </a> ","type":"source","format":"html","require":["katex"]}]}