{"title":"Spy's Work","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4274","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4274&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4274","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4274"},"statement":[{"title":"Problem Description","content":"I&apos;m a manager of a large trading company, called ACM, and responsible for the market research. Recently, another trading company, called ICPC, is set up suddenly. It&apos;s obvious that we are the competitor to each other now!<br>To get some information about ICPC, I have learned a lot about it. ICPC has N staffs now (numbered from 1 to N, and boss is 1), and anybody has at most one superior. To increase the efficiency of the whole company, the company contains N departments and the ith department is led by the ith staff. All subordinates of the ith staff are also belong to the ith department.<br>Last week, we hire a spy stealing into ICPC to get some information about salaries of staffs. Not getting the detail about each one, the spy only gets some information about some departments: the sum of the salaries of staff s working for the ith department is less than (more than or equal to) w. Although the some inaccurate information, we can also get some important intelligence from it.<br>Now I only concerned about whether the spy is telling a lie to us, that is to say, there will be some conflicts in the information. So I invite you, the talented programmer, to help me check the correction of the information. Pay attention, my dear friend, each staff of ICPC will always get a salary even if it just 1 dollar!<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases.<br>The first line is an integer N. (1 &lt;= N &lt;= 10,000)<br>Each line i from 2 to N lines contains an integer x indicating the xth staff is the ith staff&apos;s superior(x&lt;i).<br>The next line contains an integer M indicating the number of information from spy. (1 &lt;= M &lt;= 10,000)<br>The next M lines have the form like (x &lt; (&gt; or =) w), indicating the sum of the xth department is less than(more than or equal to) w (1 &lt;= w &lt;=100,000,000)<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output &quot;True&quot; if the information has no confliction; otherwise output &quot;Lie&quot;.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n1\n1\n3\n3\n3\n1 &lt; 6\n3 = 4\n2 = 2\n\n5\n1\n1\n3\n3\n3\n1 &gt; 5\n3 = 4\n2 = 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Lie\nTrue</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Changchun+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Changchun Online </a> ","type":"source","format":"html"}]}