{"title":"Control","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4289","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4289&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4289","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4289"},"statement":[{"title":"Problem Description","content":"&#x3000;&#x3000;You, the head of Department of Security, recently received a top-secret information that a group of terrorists is planning to transport some WMD <sup>1</sup> from one city (the source) to another one (the destination). You know their date, source and destination, and they are using the highway network.<br>&#x3000;&#x3000;The highway network consists of bidirectional highways, connecting two distinct city. A vehicle can only enter/exit the highway network at cities only.<br>&#x3000;&#x3000;You may locate some SA (special agents) in some selected cities, so that when the terrorists enter a city under observation (that is, SA is in this city), they would be caught immediately.<br>&#x3000;&#x3000;It is possible to locate SA in all cities, but since controlling a city with SA may cost your department a certain amount of money, which might vary from city to city, and your budget might not be able to bear the full cost of controlling all cities, you must identify a set of cities, that:<br>&#x3000;&#x3000;* all traffic of the terrorists must pass at least one city of the set.<br>&#x3000;&#x3000;* sum of cost of controlling all cities in the set is minimal.<br>&#x3000;&#x3000;You may assume that it is always possible to get from source of the terrorists to their destination.<br>------------------------------------------------------------<br><sup>1</sup> Weapon of Mass Destruction","type":"description","format":"html"},{"title":"Input","content":"&#x3000;&#x3000;There are several test cases.<br>&#x3000;&#x3000;The first line of a single test case contains two integer N and M ( 2 &lt;= N &lt;= 200; 1 &lt;= M &lt;= 20000), the number of cities and the number of highways. Cities are numbered from 1 to N.<br>&#x3000;&#x3000;The second line contains two integer S,D ( 1 &lt;= S,D &lt;= N), the number of the source and the number of the destination.<br>&#x3000;&#x3000;The following N lines contains costs. Of these lines the ith one contains exactly one integer, the cost of locating SA in the ith city to put it under observation. You may assume that the cost is positive and not exceeding 10<sup>7</sup>.<br>&#x3000;&#x3000;The followingM lines tells you about highway network. Each of these lines contains two integers A and B, indicating a bidirectional highway between A and B.<br>&#x3000;&#x3000;Please process until EOF (End Of File).<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#x3000;&#x3000;For each test case you should output exactly one line, containing one integer, the sum of cost of your selected set.<br>&#x3000;&#x3000;See samples for detailed information.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 6\n5 3\n5\n2\n3\n4\n12\n1 5\n5 4\n2 3\n2 4\n4 3\n2 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Chengdu+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Chengdu Online </a> ","type":"source","format":"html"}]}