{"title":"Let's Hit Our Head!","time_limit":2500,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4304","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4304&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4304","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4304"},"statement":[{"title":"Problem Description","content":"Kingdom LHOH is celebrating its annual carnival again!This time another crazy game is now on show.N*N piles of brick here lying on the ground in a straight line, and N brave fellows have attended.<br>First they should each choose a distinct piles brick to stand behind, forming a line parrelling to the brick, and facing the same side, watching at his piles of brick.<br>Then their captain can yelled out 3 commands, described below:<br>A &quot;LEFT!&quot; Every one should move so that he is behind the left piles of the original one.  <br>B &quot;RIGHT!&quot; Every one should move so that he is behind the right piles of the original one.  <br>C &quot;HIT!&quot; Every one should break all the piles of brick before him with only his head slamming them.<br> <br>A little constraints are showed below:<br>In every step, when command A or B have been yelled out, no one should move outside, that is, for everyone after his moving, brick(even breaked up) is there before him,and when command C is to be yelled out, intact piles of brick must be there before every one, so that he cannot slamming brick that it already breaked up, and only that is fair to everyone.<br>Not until all piles of brick have been successfully breaked up with the brave fellows&apos; heads, this game is successfully finished.<br>Now the question is,the crazy captain wants to know how many initial options are there,satisfying for each initial option he always chooses the first piles, other members choose their own distinct ones,and the game can be finished successfully at the same time?<br>We assume the other members except the captain cannot be told out.","type":"description","format":"html"},{"title":"Input","content":"First there&apos;s an integer T(T&lt;=15000) indicating the scenary numbers.<br>Then there&apos;s T lines represented for the scenaries, with an integer N(1&lt;=N&lt;=10^12) in each line.","type":"input_format","format":"html"},{"title":"Output","content":"For each datus, you should output one integer in a line represented the answer for the scenary with N brave fellows and N*N piles of brick.And that&apos;s all.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">10\n1\n2\n3\n4\n8\n16\n6469693228\n6469693229\n6469693230\n1024</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2\n2\n6\n20\n70\n84\n14\n8787513806478134\n184756</div></pre>","type":"example","format":"html"},{"title":"Author","content":"BUPT","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 1 </a> ","type":"source","format":"html"}]}