{"title":"Mission Impossible","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4316","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4316&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4316","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4316"},"statement":[{"title":"Problem Description","content":"Flabby is an agent of CIA. At present, he has received a top-secret mission which is theft of military intelligence. After careful investigation, there is only one question to consider. In original plan, Flabby has to go through a room. In this room, there are three video cameras on the ceiling. Every video camera can photograph in any perspective, but it cannot move. It brings great difficulties to Flabby. Fortunately, there is a big machine on the ground in the room, which can be used by Flabby. Flabby has known the information about three cameras and the big machine. As his partner, your mission is to help him find the size of security zone in order to help Flabby implements the mission successfully. The size of security zone is the area of ground where cannot be photographed by cameras. <br>The ground is represented as by z = 0. The ceiling is represented as z = 100. The machine is described as a convex polyhedron. You can always assume that the machine is placed on the ground and don&#xFFFD;&#xFFFD;t contact with ceiling.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases in the input files. For each test case, the first line is an integer N (N &lt;= 100) which represents the number of points of convex polyhedron which represents the machine. Each of the following N lines contains three real numbers xi, yi, zi, which are the points&#xFFFD;&#xFFFD; coordinate of convex polyhedron. The last three lines describe the cameras position. Each line contains two real number x, y which represents the camera&#xFFFD;&#xFFFD;s coordinate on the ceiling.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the size of the security zone. The result should be printed with two digits to the right of the decimal point.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n-1 0 0\n0 0 0\n0 1 0\n0 0 1\n-2 2\n-1 2\n-2 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.51</div></pre>","type":"example","format":"html"},{"title":"Author","content":"TJU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+2&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 2 </a> ","type":"source","format":"html"}]}