{"title":"Magic Number","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4323","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4323&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4323","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4323"},"statement":[{"title":"Problem Description","content":"There are many magic numbers whose lengths are less than 10. Given some queries, each contains a single number, if the Levenshtein distance (see below) between the number in the query and a magic number is no more than a threshold, we call the magic number is the lucky number for that query. Could you find out how many luck numbers are there for each query?<br><br><strong>Levenshtein distance</strong> (from Wikipedia http://en.wikipedia.org/wiki/Levenshtein_distance):<br>In information theory and computer science, the Levenshtein distance is a string metric for measuring the amount of difference between two sequences. The term edit distance is often used to refer specifically to Levenshtein distance.<br>The Levenshtein distance between two strings is defined as the minimum number of edits needed to transform one string into the other, with the allowable edit operations being insertion, deletion, or substitution of a single character. It is named after Vladimir Levenshtein, who considered this distance in 1965.<br>For example, the Levenshtein distance between &quot;kitten&quot; and &quot;sitting&quot; is 3, since the following three edits change one into the other, and there is no way to do it with fewer than three edits:<br>1.kitten &#xFFFD;&#xFFFD; sitten (substitution of &apos;s&apos; for &apos;k&apos;)<br>2.sitten &#xFFFD;&#xFFFD; sittin (substitution of &apos;i&apos; for &apos;e&apos;)<br>3.sittin &#xFFFD;&#xFFFD; sitting (insertion of &apos;g&apos; at the end).<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases. The first line contains a single number T shows that there are T cases. For each test case, there are 2 numbers in the first line: n (n &lt;= 1500) m (m &lt;= 1000) where n is the number of magic numbers and m is the number of queries.<br>In the next n lines, each line has a magic number. You can assume that each magic number is distinctive.<br>In the next m lines, each line has a query and a threshold. The length of each query is no more than 10 and the threshold is no more than 3.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, the first line is &quot;Case #id:&quot;, where id is the case number. Then output m lines. For each line, there is a number shows the answer of the corresponding query.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5 2\n656\n67\n9313\n1178\n38\n87 1\n9509 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n1\n0</div></pre>","type":"example","format":"html"},{"title":"Author","content":"BJTU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+3&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 3 </a> ","type":"source","format":"html"}]}