{"title":"Revolving Digits","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4333","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4333&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4333","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4333"},"statement":[{"title":"Problem Description","content":"One day Silence is interested in revolving the digits of a positive integer. In the revolving operation, he can put several last digits to the front of the integer. Of course, he can put all the digits to the front, so he will get the integer itself. For example, he can change 123 into 312, 231 and 123. Now he wanted to know how many different integers he can get that is less than the original integer, how many different integers he can get that is equal to the original integer and how many different integers he can get that is greater than the original integer. We will ensure that the original integer is positive and it has no leading zeros, but if we get an integer with some leading zeros by revolving the digits, we will regard the new integer as it has no leading zeros. For example, if the original integer is 104, we can get 410, 41 and 104.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains an integer T (1&lt;=T&lt;=50) which means the number of test cases. <br>For each test cases, there is only one line that is the original integer N. we will ensure that N is an positive integer without leading zeros and N is less than 10^100000.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, please output a line which is &quot;Case X: L E G&quot;, X means the number of the test case. And L means the number of integers is less than N that we can get by revolving digits. E means the number of integers is equal to N. G means the number of integers is greater than N.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n341</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1 1 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+4&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 4 </a> ","type":"source","format":"html","require":["katex"]}]}