{"title":"Simple Path","time_limit":2000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4338","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4338&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4338","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4338"},"statement":[{"title":"Problem Description","content":"Everybody knows that totalfrank has absolutely no sense of direction.  Getting lost in the university or nearly supermarket is very common for him. We always worry about whether he can find his way back into our sweet base whenever he goes out alone for his class.  In general, if totalfrank get lost again, we need to check his starting point and destination just in order to find out where he could be (you know this task is very common for us).<br>Unfortunately, poor totalfrank sometimes forgot taking his mobile phone, when this situation happens, we can&#x2019;t get in touch with him. But it is so lucky that totalfrank can remember places where he had gone before in his trip from his starting point and destination at this trip so that he won&#x2019;t go to such place again (he can&#x2019;t remember places which he had gone during his previous trip). As we are all familiar with map, we can find out which place he couldn&#x2019;t be.<br>However, totalfrank can always get lost, doing this same boring work makes us sleepy. So we ask totalfrank for all possible starting point and destination for him, and try to find out how many places he wouldn&#x2019;t be when he chooses any pair of starting point and destination. Here comes the problem, since our university&#x2019;s map is so complex (there can be many buildings which can be considered as points in our university, some pair of these point has a way while others hasn&#x2019;t), we need a program to help us work out this problem.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains no more than 10 test cases. <br>For each test case: <br>The first line includes two integers N (1 &lt;= N &lt;= 100000) and M (0 &lt;= M &lt;= 200000). N is the total number of nodes. M is the number of edges.<br>The next M lines each describe an edge of this graph in the following format:<br>X (0 &lt;= X &lt; N) Y (0 &lt;= Y &lt; N)<br>It means that there is an edge from point X to point Y. Ways are bidirectional and there are no duplicates or self-loop edges.<br>The next line includes only one integer Q (1 &lt;= Q &lt;= 100000) which indicates the total number of queries.<br>The next Q lines are all in the following format:<br>A B, which means in this query totalfrank choose A as his starting point and B as his destination.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, first you should print &#x201C;Case #x:&#x201D; in a line, where x stands for the case number started with 1. Then for each query output a line contains a single integer indicating the number of places which he absolutely couldn&#x2019;t be during the simple path between his starting point and destination. If there is no simple path between the starting point and destination just output N.<br>Leave an empty line after each test case.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3\n0 1\n1 2\n1 3\n1\n0 2\n\n4 4\n0 1\n1 2\n1 3\n2 3\n1\n0 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n1\n\nCase #2:\n0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+4&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 4 </a> ","type":"source","format":"html"}]}