{"title":"The battle on X-Star","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4378","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4378&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4378","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4378"},"statement":[{"title":"Problem Description","content":"There is a special planet in universe called &quot;X-Star&quot;. The X-Star is a regular sphere with a radius of R meters. Unfortunately, a tremendous battle is in progress on &quot;X-Star&quot;. Many aliens were landed on X-Star and find their unique place to settle down. Each alien&apos;s place can be defined as latitude and longitude of the &quot;X-Star&quot;. These aliens have a special magical skill, which is extremely powerful. This skill can only be released by two different aliens. After it was released, there will occur a great circle on the plant&#x2019;s surface, which just through the place between the two aliens who have released it. That is to say, the great circle will pass the middle point between their places and have same distance to the two aliens.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C405-1009-1.jpg\"></center><br>The great circle will exert a special force, which will affect the general of X-Star. The general of X-Star now is governing the army, and he will have a velocity of h*k*v0 m/s (here k is a constant value and v0 is the general&apos;s normal speed) when his distance to the great circle is h due to the special force, in other words, h is the height of his current location to the plane of the great circle. The wise general will take this action when the great circle occurs: run away from the great circle as far as possible (here &quot;run&quot; means move on the X-Star&apos;s surface), no matter there will be some aliens or not. Now he need to know when two certain aliens released the skill, how many seconds does he needed to take his action from several certain location at least.<br>There will be n aliens landed on X-Star and the general will ask you m possible scenarios.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"Multiple test cases, process to the end of input.<br>For every case, there are several lines.<br>The first line is two integer n (1 &#x2264; n &#x2264; 10000) and m (1 &#x2264; m &#x2264; 1000) and a real number R (0 &lt; R &#x2264; 1e11) as described above.<br>The following n lines contain the aliens&apos; settled places. Each line have two real number, which represents the i-th (i started from 0) alien&apos;s latitude and longitude on the X-Star.<br>The following 3*m lines contain m possible scenarios. Each scenario contains three lines, the first line is two different aliens&apos; indices (started from 0) who will release the skill, and the second line is the general&apos;s current location&apos;s latitude and longitude, and the third line contains k (0 &#x2264; k &#x2264; 5) and v0 (0 &#x2264; v0 &#x2264; 5) described above.<br>All latitudes are between -90 and 90 inclusive, and all longitudes are between -180 and 180 inclusive. It is guaranteed that all the aliens&#x2019; locations are different from each other.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each possible scenario, output one line of a real number with 3 digits after decimal point, which is the shortest time for the general to take the action with that scenario.<br><strong>If the general can not take his action at some scenarios</strong> , you just need to output &quot;God Bless Him!&#x201D;. It means you needn&apos;t to output the time. See samples for more details.<br>Output an empty line after each test case.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3 6380000.0\n5.5 0.0\n-5.5 0.0\n0 1\n9.99 50.5\n0.5 0.5\n0 1\n10.0 99.0\n0.0 1.11\n0 1\n90.0 0.0\n1.0 1.0\n\n2 1 3450.0\n55.5 -77.8\n-44.4 140.6\n0 1\n12.3 -66.6\n1.0 1.0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9.749\nGod Bless Him!\n0.000\n\n0.766</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+8&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 8 </a> ","type":"source","format":"html","require":["katex"]}]}