{"title":"Moving Bricks","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4385","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4385&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4385","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4385"},"statement":[{"title":"Problem Description","content":"Brickgao used to be a real tall, wealthy, handsome man and you might know him well. If you don&apos;t, please draw attention to the details below.<br>Brickgao tried his fortune in investment of golden bricks with his two partners LS and Jne. Because he knew little about investment he gave his total trust and bank savings to his two partners who looked smart. <br>However, due to the bad luck and lack of business skills, LS and Jne used up Brickgao&apos;s fund, and nothing in return. Their investment failed and the three become diaosi. <br>Brickgao had no other choice but to earn a living as a construction worker and he found his place on a building site moving bricks which of course was not golden ones. There were many brick fragment scattered on the site and workers had to move them to the building that under construction. Brickgao was made to cope with the task.<br>The problem is that the Brickgao couldn&#x2019;t carry more than two bricks at a time since they were too heavy. Also, if he had taken a brick, he couldn&#x2019;t put it anywhere except the goal building &#x2014; his inherent sense of order does not let him do so.<br>You are given N pairs of coordinates of the bricks and the coordinates of the goal building. It is known that the Brickgao covers the distance between any two points in the time equal to the squared length of the segment between the points. It is also known that initially the coordinates of the Brickgao and the goal building are the same. You are asked to find such an order of bricks, that the Brickgao could move all the bricks to the building in a minimum time period. You can assume the no two bricks shared the same coordinates. If more than one optimum moving sequence Brickgao could find, he would choose the smallest lexicographic one because of the inherent sense of order.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input file contains an integer T which indicates the number of test cases. The first line of each case contains the building&apos;s coordinates x ,y. The second line contains number N (1&lt;= N &lt; 20) &#x2014; the amount of bricks on the building site. The following N lines contain the bricks&apos; coordinates. All the coordinates do not exceed 100 in absolute value. All the given positions are different. All the numbers are integer.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, first you should print &quot;Case x:&quot; in a line, where x stands for the case number started with 1. Then two lines follow: the first line output the only number &#x2014; the minimum time Brickgao needed to move the bricks to building, and the second line output the optimum order for Brickgao to move the bricks. Each brick in the input is described by its index number (from 1 to N).<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0 0\n2\n1 1\n-1 1\n1 1\n3\n4 3\n3 4\n0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n8\n1 2\nCase 2:\n32\n1 2 3\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first test, Brickgao gets brick 1 and brick 2 and returns to the building.\nIn the second test, Brickgao first moves brick 1 and brick 2 to the building and then gets the third and returns to the building.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"WHU","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Multi-University+Training+Contest+9&amp;source=1&amp;searchmode=source\"> 2012 Multi-University Training Contest 9 </a> ","type":"source","format":"html","require":["katex"]}]}