{"title":"Magic Board","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4402","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4402&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4402","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4402"},"statement":[{"title":"Problem Description","content":"Sths is a happy boy~<br><br>Sths has got a Magic Board for his birthday gift! A Magic board is an N*M sized grids which were painted by black and white. According to the parity of N and M, the Magic Board would be a little different, but it can be guaranteed that any two adjacent grids are painted by different colors, and the amount of black grid is not less than white ones.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C417-1003-1.jpg\"></center> <br>The Magic Board is called MAGIC because it is formed by a Chain. A Chain is a set of grids in which a grid has at most 2 adjacent grids and there are only 2 grids which has only 1 adjacent grid. Those two special grids are called the endpoints of the Chain.<br><br>The joint between two adjacent grids is very flexible. It can be rotate by any angle. Here&#x2019;s an example of transforming a Chain into a Magic Board<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C417-1003-2.jpg\"></center> <br><br>The Chain was connected by a Magic String. The existence of Magic String relies on the power of fengshui. But recently the fengshui in Beijing was ruined because there is a university installing air-conditionor (which also cause the HUGE RAIN in Beijing).So the Magic String disappears, and the Magic Board is totally fell apart.<br><br>Sths feels upset, because he really likes the Magic Board (since it can form a lot of things). So he is thinking about how to reconstruct it. The only thing Sths has got now is the separated grids. But surprisingly, Sths finds out that there are differences between these grids.<br><br>1. There are black grids and white grids.<br>2. There are three different grids in the same color because the Magic String goes through it in 3 different ways shown below:<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C417-1003-3.jpg\"></center> <br>So there are 6 different kinds of grids. Now Sths has counted the amount of each kind of grids, he wants to know: by using the grids in his hand, how many kinds of legal Chains (which can form an N*M sized Magic Board) can be constructed.<br>&#x3000;&#x3000;<br><b>We shall say two Chains is the same if and only if the standard expression of these two Chains is the same.</b><br><br>The standard expression is a set of numbers which decided by following method:<br><br>1. Starting from one of a Chain&apos;s endpoint.<br>2. Write down the color of the grids (1 for black and 0 for white) before direction changing.<br>3. Write down 2 then change direction and repeat Step 2 until reaching another endpoint of the Chain.<br>4. Choose the expression which lexicographical lower between the two expressions just generated since there are two endpoints.<br><br>For example, the standard expression of the example of &#x201C;N=M=3&#x201D; is &#x201C;10120120120212&#x201D; (another expression is &#x201C;10212012012012&#x201D;, which is lexicographical greater than standard expression). And the standard expression of the example of &#x201C;N=M=4&#x201D; is &#x201C;01012010210120120120212&#x201D;.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are Multiple Test Cases<br>For each case, there will be six integer numbers in one line, N, M, BO, BA, WO, and WA, indicating the number of rows and columns, the amount of &#x201C;Black and Opposite&#x201D; grids, the amount of &#x201C;Black and Adjacent&#x201D; grids, the amount of &#x201C;White and Opposite&#x201D; grids, the amount of &#x201C;White and Adjacent&#x201D; grids.<br><br>2&lt;=N*M&lt;=30<br><br>The input end with a line of 0 0 0 0 0 0.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output the kinds of legal Chains that can be constructed by given grids.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3 1 2 2 2\n3 3 0 3 3 1\n5 5 5 6 5 7\n0 0 0 0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n1\n4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Jinhua+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Jinhua Online </a> ","type":"source","format":"html","require":["katex"]}]}