{"title":"Family Name List","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4409","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4409&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4409","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4409"},"statement":[{"title":"Problem Description","content":"Kong belongs to a huge family. Recently he got a family name list which lists all men (no women) in his family over many generations. <br><br>The list shows that the whole family has a common ancestor, let&apos;s call him Mr. X. Of course, everybody except Mr.X in the list is Mr. X&apos;s descendant. Everybody&apos;s father is shown in the list except that Mr. X&apos;s father is not recorded. We define that Mr. X&apos;s generation number is 0. His son&apos;s generation number is 1.His grandson&apos;s generation number is 2, and so on. In a word, everybody&apos;s generation number is 1 smaller than his son&apos;s generation number. Everybody&apos;s generation number is marked in some way in the list.<br><br>Now Kong is willing to pay a lot of money for a program which can re-arrange the list as he requires ,and answer his questions such as how many brothers does a certain man have, etc. Please write this program for him.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are no more than 15 test cases. <br>For each test case:<br>The first line is an integer N( 1 &lt;= N &lt;= 30,000), indicating the number of names in the list.<br>The second line is the name of Mr. X.<br>In the next N-1 lines, there is a man&apos;s name in each line. And if the man&apos;s generation number is K, there are K dots( &apos;.&apos;) before his name.<br><br>Please note that :<br>1) A name consists of only letters or digits( &apos;0&apos;-&apos;9&apos;).<br>2) All names are unique.<br>3) Every line&apos;s length is no more than 60 characters.<br>4) In the list, a man M&apos;s father is the closest one above M whose generation number is 1 less than M.<br>5) For any 2 adjacent lines in the list, if the above line&apos;s generation number is G1 and the lower line&apos; s generation number is G2, than G2 &lt;= G1 +1 is guaranteed. <br><br>After the name list, a line containing an integer Q(1&lt;=Q&lt;=30,000) follows, meaning that there are Q queries or operations below.<br><br>In the Next Q lines, each line indicates a query or operation. It can be in the following 3 formats:<br>1) L<br>Print the family list in the same format as the input, but in a sorted way. The sorted way means that: if A and B are brothers(cousins don&#x2019;t count), and A&apos;s name is alphabetically smaller than B&apos;s name, then A must appear earlier than B. <br>2) b name<br>Print out how many brothers does &quot;name&quot; have, including &quot;name&quot; himself.<br>3) c name1 name2<br>Print out the closest common ancestor of &quot;name1&quot; and &quot;name2&quot;. &quot;Closest&quot; means the generation number is the largest. Since Mr. X has no ancestor in the list, so it&apos;s guaranteed that there is no question asking about Mr. X&apos;s ancestor. <br><br>The input ends with N = 0.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Already mentioned in the input.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9\nKongs\n.son1\n..son1son2\n..son1son1\n...sonkson2son1\n...son1son2son2\n..son1son3\n...son1son3son1\n.son0\t\n7\nL\nb son1son3son1\nb son1son2\nb sonkson2son1\nb son1\nc sonkson2son1 son1son2son2\nc son1son3son1 son1son2\n0 </div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Kongs\n.son0\n.son1\n..son1son1\n...son1son2son2\n...sonkson2son1\n..son1son2\n..son1son3\n...son1son3son1\n1\n3\n2\n2\nson1son1\nson1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Jinhua+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Jinhua Online </a> ","type":"source","format":"html","require":["katex"]}]}