{"title":"Arrest","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4411","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4411&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4411","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4411"},"statement":[{"title":"Problem Description","content":"There are (N+1) cities on TAT island. City 0 is where police headquarter located. The economy of other cities numbered from 1 to N ruined these years because they are all controlled by mafia. The police plan to catch all the mafia gangs in these N cities all over the year, and they want to succeed in a single mission. They figure out that every city except city 0 lives a mafia gang, and these gangs have a simple urgent message network: if the gang in city i (i&gt;1) is captured, it will send an urgent message to the gang in city i-1 and the gang in city i -1 will get the message immediately. <br>The mission must be carried out very carefully. Once a gang received an urgent message, the mission will be claimed failed.<br>You are given the map of TAT island which is an undirected graph. The node on the graph represents a city, and the weighted edge represents a road between two cities(the weight means the length). Police headquarter has sent k squads to arrest all the mafia gangs in the rest N cities. When a squad passes a city, it can choose to arrest the gang in the city or to do nothing. These squads should return to city 0 after the arrest mission.<br>You should ensure the mission to be successful, and then minimize the total length of these squads traveled.<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases.<br>Each test case begins with a line with three integers N, M and k, here M is the number of roads among N+1 cities. Then, there are M lines. Each of these lines contains three integers X, Y, Len, which represents a Len kilometer road between city X and city Y. Those cities including city 0 are connected. <br>The input is ended by &#x201C;0 0 0&#x201D;.<br>Restrictions: 1 &#x2264; N &#x2264; 100, 1 &#x2264; M &#x2264; 4000, 1 &#x2264; k &#x2264; 25, 0 &#x2264; Len &#x2264; 1000<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case,output a single line with a single integer that represents the minimum total length of these squads traveled.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 4 2\n0 1 3\n0 2 4\n1 3 2\n2 3 2\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">14</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html"}]}