{"title":"Sky Soldiers","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4412","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4412&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4412","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4412"},"statement":[{"title":"Problem Description","content":"An airplane carried k soldiers with parachute is plan to let these soldiers jump off the plane along a straight air route. The landing point of these soldiers is undetermined because of various weather conditions. However, the statisticians of the army can analysis the probability of landing in a certain place through landing history records. To make it simple, the statistician suggests that these sky soldiers will land on finite discrete points of a straight line.<br><br>This mission plans to place m provisions for the soldiers on the line for landing. These soldiers will be informed the direction of the nearest provision point by a special device after landing, and then walk to the point. The manager of this mission is asking you for help: to determine m points for provisions so that the expected sum of walking distance should be minimized. You can put provisions on any point of the landing line.<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. For each case, the first line contains two integers k and m (1 &#x2264; k &#x2264; 1,000, 1 &#x2264; m &#x2264; 50), which represent the number of sky soldiers and the number of positions to place provisions separately.<br><br>The following k lines contain descriptions of landing parameters for the soldiers numbered from 1 to k. Each description consists of an integer L followed by L pairs of (x, p), which indicates that the probability of the soldier&apos;s landing on integer coordination x is p. It is guaranteed that all the p values are positive real numbers, and the sum of p in a single line is exactly 1. The same x may appear more than once on the same line which you should simply add up all the probability p of the pairs with equal x.<br>The number of places on which all the soldiers could land is no more than 1000 and it can not be less than m.<br>The input ends with k=m=0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a line containing only one real number which indicates the minimum expected sum of distance these soldiers will move and should be rounded to two digits after the decimal point.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1\n2 0 0.5 1 0.5\n2 1 0.1 3 0.9\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.30</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html"}]}