{"title":"Logical Expression","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4413","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4413&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4413","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4413"},"statement":[{"title":"Problem Description","content":"Happy birthday to you!<br><br>Your professor gives you a strange device as your birthday gift. But your experience tells you, it is a trap.<br><br>Just as expected, he smirks, and then says slowly: &quot;This device is my new invention. Only you, my most brilliant student, deserve to have it.&quot;<br><br>&quot;Thanks, I will keep it up.&quot; You reply.<br><br>&quot;However,&quot; silent for a while, he starts again: &quot;unfortunately, I have lost its original circuit diagram. So I need you to do some researches on it and use a simple logical expression to describe its characteristics. You won&apos;t let me down, will you?&quot;<br><br>He laughs, pats you on the back, then turns and stalks off, leaves you, the poor guy, with the &quot;gift&quot; on your hands.<br><br>You collect yourself, and start looking at the &quot;lovely&quot; thing. It is a black box, with n inputs labeled from the first capital letter (A) to the n-th capital letter, as well as one unique output. All the inputs and the output are one-bit binary numbers (either 0 or 1).<br><br>Then you sit down, put the device on the desk, take out the tools, examine all possible combinations of input values and record the output on the paper.<br><br>After everything gets ready, now it is just a piece of cake for you to give a correct logical expression for it.<br><br>A correct logical expression should be:<br>1. A <b>not null</b> string only contains &apos;+&apos;, &apos;-&apos; and capital letters from the first (A) to the n-th;<br>2. A single capital letter in range is a legal logical expression, and its output equals to the value of the input labeled by this letter;<br>3. If E is a legal logical expression, then NOT operation -E is a legal logical expression;<br>4. If E and F are legal logical expressions, then AND operation EF is a legal logical expression;<br>5. If E and F are legal logical expressions, then OR operation E+F is a legal logical expression;<br>6. In a legal logical expression, you should first do NOT operations from the left to the right, then AND operations from the left to the right, and finally the OR operations from the left to the right;<br>7. A logical expression is correct if and only if with any possible combinations of input values, its output is the same as which the device outputs.<br><br>But as a down-to-earth idealist, you are never satisfied with this. You want to give the most beautiful logical expression like this:<br>1. It is a correct logical expression;<br>2. It is the shortest one (<b>not null</b>) among all correct logical expressions;<br>3. If there are still many available logical expressions, choose the lexicographically least one.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases in the input.<br><br>Each test case begins with one integer n (1 &lt;= n &lt;= 5), indicating the number of inputs of the device.<br>Then 2<sup>n</sup> lines follow. Each line contains (n + 1) one-bit binary numbers, separated by spaces. The first n numbers indicate the value of the n inputs in order, and the last one is the corresponding output.<br>The 2<sup>n</sup> sets of inputs are different with each other.<br>The input ends with n = 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output only one line -- the most beautiful logical expression.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n0 0 0 0\n0 0 1 1\n0 1 0 1\n0 1 1 0\n1 0 0 0\n1 0 1 1\n1 1 0 0\n1 1 1 1\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-A-CB+-BC+AC\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn ASCII table, &apos;+&apos; &lt; &apos;-&apos; &lt; &apos;A&apos; &lt; &apos;B&apos; &lt; &apos;C&apos; &lt; &apos;D&apos; &lt; &apos;E&apos;.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html"}]}