{"title":"Time travel","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4418","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4418&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4418","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4418"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../data/images/C416-1009-1.jpg\"></center> <br>Agent K is one of the greatest agents in a secret organization called Men in Black. Once he needs to finish a mission by traveling through time with the Time machine. The Time machine can take agent K to some point (0 to n-1) on the timeline and when he gets to the end of the time line he will come back (For example, there are 4 time points, agent K will go in this way 0, 1, 2, 3, 2, 1, 0, 1, 2, 3, 2, 1, ...). But when agent K gets into the Time machine he finds it has broken, which make the Time machine can&apos;t stop (Damn it!). Fortunately, the time machine may get recovery and stop for a few minutes when agent K arrives at a time point, if the time point he just arrive is his destination, he&apos;ll go and finish his mission, or the Time machine will break again. The Time machine has probability Pk% to recover after passing k time points and k can be no more than M. We guarantee the sum of Pk is 100 (Sum(Pk) (1 &lt;= k &lt;= M)==100). Now we know agent K will appear at the point X(D is the direction of the Time machine: 0 represents going from the start of the timeline to the end, on the contrary 1 represents going from the end. If x is the start or the end point of the time line D will be -1. Agent K want to know the expectation of the amount of the time point he need to pass before he arrive at the point Y to finish his mission.<br>If finishing his mission is impossible output &quot;Impossible !&quot; (no quotes )instead.<br>","type":"description","format":"html"},{"title":"Input","content":"There is an integer T (T &lt;= 20) indicating the cases you have to solve. The first line of each test case are five integers N, M, Y, X .D (0&lt; N,M &lt;= 100, 0 &lt;=X ,Y &lt; 100 ). The following M non-negative integers represent Pk in percentile.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each possible scenario, output a floating number with 2 digits after decimal point<br>If  finishing his mission is impossible output one line &quot;Impossible !&quot; <br>(no quotes )instead.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4 2 0 1 0\n50 50\n4 1 0 2 1\n100</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8.14\n2.00</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2012 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html"}]}