{"title":"The Little Girl who Picks Mushrooms","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4422","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4422&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4422","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4422"},"statement":[{"title":"Problem Description","content":"         It&apos;s yet another festival season in Gensokyo. Little girl Alice planned to pick mushrooms in five mountains. She brought five bags with her and used different bags to collect mushrooms from different mountains. Each bag has a capacity of 2012 grams. Alice has finished picking mushrooms in 0 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 5 mountains. In the i-th mountain, she picked 0 &#xFFFD;&#xFFFD; w<sub>i</sub> &#xFFFD;&#xFFFD; 2012 grams of mushrooms. Now she is moving forward to the remained mountains. After finishing picking mushrooms in all the five mountains, she want to bring as much mushrooms as possible home to cook a delicious soup.<br>         Alice lives in the forest of magic. At the entry of the forest of magic, live three mischievous fairies, Sunny, Lunar and Star. On Alice&apos;s way back home, to enter the forest, she must give them exactly three bags of mushrooms whose total weight must be of integral kilograms. If she cannot do so, she must leave all the five bags and enter the forest with no mushrooms.<br>         Somewhere in the forest of magic near Alice&apos;s house, lives a magician, Marisa. Marisa will steal 1 kilogram of mushrooms repeatedly from Alice until she has no more than 1 kilogram mushrooms in total. So when Alice gets home, what&apos;s the maximum possible amount of mushrooms Alice has? Remember that our common sense doesn&apos;t always hold in Gensokyo. People in Gensokyo believe that 1 kilogram is equal to 1024 grams.<br>","type":"description","format":"html"},{"title":"Input","content":"         There are about 8192 test cases. Proceed to the end of file.<br>         The first line of each test case contains an integer 0 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 5, the number of mountains where Alice has picked mushrooms. The second line contains n integers 0 &#xFFFD;&#xFFFD; w<sub>i</sub> &#xFFFD;&#xFFFD; 2012, the amount of mushrooms picked in each mountain.<br>","type":"input_format","format":"html"},{"title":"Output","content":"          For each test case, output the maximum possible amount of mushrooms Alice can bring home, modulo 20121014 (this is NOT a prime).","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n9\n4\n512 512 512 512\n5\n100 200 300 400 500\n5\n208 308 508 708 1108</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1024\n1024\n0\n792\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the second sample, if Alice doesn&apos;t pick any mushrooms from the 5-th mountain. She can give (512+512+0) =1024 grams of mushrooms to Sunny, Lunar and\nStar. Marisa won&apos;t steal any mushrooms from her as she has exactly 1 kilogram of mushrooms in total.\nIn the third sample, there are no three bags whose total weight is of integral kilograms. So Alice must leave all the five bags and enter the forest with no mushrooms.\nIn the last sample:\n1.Giving Sunny, Lunar and Star: (208+308+508)=1024\n2.Stolen by Marisa: ((708+1108)-1024)=792\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+ChangChun+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia ChangChun Regional Contest </a> ","type":"source","format":"html"}]}