{"title":"Fantastic Necklace","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4425","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4425&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4425","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4425"},"statement":[{"title":"Problem Description","content":"         Alice is one of the most famous necklace designers. She is designing a fantastic necklace of new styles. Like other necklaces, this necklace consists of n beads and n strings connecting the bead together. The most significant difference is that the beads are not connected one by one but has many branches. The branches connecting to the same bead can be arranged arbitrarily. The shaking of the branches makes the necklace more glaring. Another difference is that the beads are not connected with ordinary strings. The two ends of each string differ, which makes the necklace more unique.<br>         She has finished the structure of the new necklace. However, she is hesitating what color of bead should be used for each position. As a famous designer, she has beads of m colors and each type has infinite number of beads. She wants to make a necklace that any pair of adjacent beads has different colors. Now can you tell her how many different necklaces can she make with the colorful beads? Two necklaces are counted as one if each bead coincides after rotating the necklace or rearranging the braches. But because of the special strings, two necklaces with mirroring arrangements are not considered the same.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"          The input consists of about 50 test cases. The first line of each test case contains two integers, n and m, the number of beads of the necklace and the number of colors of beads Alice has (2 &lt; n &#x2264; 100000, 1 &#x2264; m &#x2264; 100000). The second line contains n integers, the i-th of which, named pi, means that there is a string from the i-th bead to the pi-th bead (1 &#x2264; p<sub>i</sub> &#x2264; n and p<sub>i</sub> does not equal to i). The necklace is always valid and there is no duplicated string connecting the same pair of beads.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"          For each test case, output the number of different necklaces that Alice can make in one line. For the answer is large, so please give the result of answer module 1,000,000,007.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n2 3 1\n3 2\n2 3 1\n6 3\n2 3 1 1 2 3\n6 2\n2 3 4 1 1 3\n6 3\n2 3 1 1 4 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0\n16\n2\n36</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+ChangChun+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia ChangChun Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}