{"title":"Polaris of Pandora","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4428","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4428&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4428","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4428"},"statement":[{"title":"Problem Description","content":"        Polaris is a star. It is the most magnificent scene in the sky, and the most important navigation star of planet Pandora<sup>[1]</sup>. People live in Pandora call themselves as &quot;Na&apos;vi&quot;<sup>[2]</sup>, and they all love to fly in the sky with their ikran<sup>[3]</sup>. When they are flying in the sky, they use Polaris to navigate. Polaris could be used to navigate because that it is always staying in the straight line linking the North Pole and the South Pole of Pandora. That straight line could also be called as &quot;axis of Pandora&quot;, and Polaris stays on the North Pole side.<br>         Polaris is too far away from Pandora, so in every place near Pandora, light from Polaris could be regarded as parallel to axis of Pandora. Now several Na&apos;vi ikran riders are flying in the sky of Pandora, they want to know the percentage of their whole flying distance that Polaris is visible. Polaris&apos;s light is quite bright, so Polaris is visible even when it is just on the skyline.<br>         To simplify the problem, Na&apos;vi riders assume that Pandora is a perfect sphere, which have an R radius. A rider starts flying from a point on the Pandora&apos;s surface and lands at another point, the flying height is given as H. Ikran is so powerful that flying time between the surface of Pandora and the flying height could be ignored, and ikran will always fly straight up and down between surface and flying height. Both the starting point and the landing point could be described using latitude and longitude <sup>[4]</sup> of Pandora. And riders will always choose the shortest path to fly.<br>","type":"description","format":"html"},{"title":"Input","content":"          There are several test cases. Process to the end of file.<br>          The only line of each test case contains 6 real numbers R (1000 &#xFFFD;&#xFFFD; R &#xFFFD;&#xFFFD; 10000), H (1 &#xFFFD;&#xFFFD; H &#xFFFD;&#xFFFD; R), lat0 (-&#xFFFD;&#xFFFD;/2 &lt; lat0 &lt; &#xFFFD;&#xFFFD;/2), lng0 (-&#xFFFD;&#xFFFD; &lt; lng0 &lt; &#xFFFD;&#xFFFD;), lat1 (-&#xFFFD;&#xFFFD;/2 &lt; lat1 &lt; &#xFFFD;&#xFFFD;/2), lng1 (-&#xFFFD;&#xFFFD; &lt; lng1 &lt; &#xFFFD;&#xFFFD;). R is radius of planet Pandora, H is Na&apos;vi ikran rider&apos;s flying height, lat0 and lng0 are latitude and longitude of starting point, lat1 and lng1 are latitude and longitude of landing point.<br>           We guarantee that starting point and landing point will not be the same, and they also will not be &quot;opposite&quot; (Starting point, landing point and Pandora&apos;s center will not be in the same line.)<br>","type":"input_format","format":"html"},{"title":"Output","content":"            For each test case, output one line with the percentage of the flying distance that Polaris is visible. Round to 3 decimal places.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1000 10 0 0 0 0.5\n4000 1000 0 0.618 1.0 0.618</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">100.000\n64.350\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nReference\n[1] Pandora is the fifth moon of the gas giant Polyphemus (both are figures in Greek mythology), which orbits the closest star to the sun, Alpha \nCentauri A.\n[2] The Na&apos;vi (English: The People) are a race of sentient extraterrestrial humanoids who inhabit the lush jungle moon of Pandora.\n[3] Ikran (English: Mountain banshees) are large, bird-like aerial predators that are native to Pandora. They are used by the Na&apos;vi for hunting from the \nair and traveling larger distances.\n[4] To define latitude and longitude of Pandora, we need to know equator of the planet. The equator is the intersection of Pandora&apos;s surface with the \nplane perpendicular to axis of Pandora and containing the planet&apos;s center. Latitude is a geographic coordinate that specifies the north-south position of a point on the \nPandora&apos;s surface, it is the angle between the equator and the line connected point on the surface with the planet&apos;s center. Latitude is an angle which ranges from -&#xFFFD;&#xFFFD;/2 \nat the North pole to &#xFFFD;&#xFFFD;/2 at the South pole. Longitude is a geographic coordinate that specifies the east-west position of a point on the Earth&apos;s surface. Points with the \nsame longitude lie in lines running from the North Pole to the South Pole. The longitude of a point on the surface is measured as an angle east or west from the \nHometree [5], ranging from 0 at the Hometree to &#xFFFD;&#xFFFD; eastward and -&#xFFFD;&#xFFFD; westward. Specifically, it is the angle between a plane \ncontaining the Hometree and a plane containing the North Pole, South Pole and the point on the surface.\n[5] Hometrees (Na&apos;vi name: Kelutral) are massive trees that can be found throughout Pandora. Many Na&apos;vi clans make these enormous plants their \nhome.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+ChangChun+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia ChangChun Regional Contest </a> ","type":"source","format":"html"}]}