{"title":"Hunters","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4438","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4438&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4438","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4438"},"statement":[{"title":"Problem Description","content":"Alice and Bob are the topmost hunters in the forest, so no preys can escape from them. However, they both think that its hunting skill is better than the other. So they need a match.<br>In their match, the targets are two animals, a tiger and a wolf. They both know that the tiger is living in the south of the forest and the wolf is living in the north of the forest. They decide that the one who kills the tiger scores X points and who kills the wolf scores Y points. If the one who kills both tiger and wolf scores X+Y points.<br>Before the match starts, Alice is in the east of the forest and Bob is in the west of the forest. When the match starts, Alice and Bob will choose one of the preys as targets. Because they haven&apos;t known the other&apos;s choice, maybe they choose the same target. There will be two situations:<br>(1) If they choose different targets, they both are sure of killing their respective targets.<br>(2) If they choose the same target, the probability of Alice killing the target is P, and the probability of Bob killing it is 1-P. Then they will hunt for the other prey, also the probability of Alice killing it is P and the probability of Bob killing it is 1-P.<br>But Alice knows about Bob. She knows that the probability of Bob choosing tiger as his first target is Q, and the probability of choosing wolf is 1-Q. So that Alice can decide her first target to make her expected score as high as possible.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains an integer T (1&#x2264;T&#x2264;10000), the number of test cases.<br>Then T test cases follow. Each test case contains X, Y, P, Q in one line. X and Y are integers and 1&#x2264;X, Y&#x2264;1000000000. P and Q are decimals and 0&#x2264;P, Q&#x2264;1, and there are at most two digits after decimal point.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the target Alice should choose and the highest expected score she can get, in one line, separated by a space. The expected score should be rounded to the fourth digit after decimal point. It is guaranteed that Alice will have different expected score between choosing tiger and wolf.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 1 0.5 0.5\n2 1 0 1\n7 7 0.32 0.16</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">tiger 1.7500\nwolf 1.0000\ntiger 6.5968</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+Tianjin+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia Tianjin Regional Contest </a> ","type":"source","format":"html"}]}