{"title":" No place to hide","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4439","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4439&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4439","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4439"},"statement":[{"title":"Problem Description","content":"It was in a dark daybreak. Dr. Gneh, who was a crazy scientist once trying to dominate the whole humankind by deploying a powerful AI network, had been discovered in a mansion on the grand field outside city of ACM. This time, he got no place to hide. <br>To help specify the capture operation, let&apos;s assume the grand field had nothing else but the mansion on coordinate (X<sub>m</sub>, Y<sub>m</sub>). N interpol elites had been assigned to N different positions around the mansion. The i-th interpol on initial position (X<sub>i</sub>, Y<sub>i</sub>) could move at a maximum speed rate V<sub>i</sub> m/s. It was said that Dr. Gneh had invent a rocket motorbike to escape this operation. According to our information, his ride could not change any direction, and ran at a maximum speed rate V<sub>m</sub> m/s. For the human future, any failure in this operation was not acceptable. We had to make sure that Dr. Gneh would be captured no matter which way (a particular speed and direction) to flee. It was assumed that our interpols would take action from their positions immediately after Dr. Gneh left his hideout, and be informed of his flee direction at the same time. <br>Apparently, this was an interesting algorithm problem. Could you tell us whether this operation would be success by our given layout? If yes, what was the minimum number of interpols needed to achieve this success?<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases.<br>The first line contains a number T (1 &#x2264; T &#x2264; 100) indicating the number of test cases.<br>In each test case, there is an integer N (1 &#x2264; N &#x2264; 1000) indicating the number of interpols on the first line. <br>In the following N+1 lines, describe the specification of Dr. Gneh and our N interpols, and the first line for Dr. Gneh and the next N lines for interpols. <br>On each line, three float numbers (range [-1e5, 1e5]) represent the speed rate in m/s(which is none negative), x and y coordinate in meters.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, you only need to output one single number, the minimum number of interpols to capture Dr. Gneh. If it wouldn&apos;t be success with all our interpols, output number 0 instead.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\n1.0 0 0\n1.0 1 0\n1.0 0 1\n1.0 -1 0\n1.0 0 -1\n4\n2.0 0 0\n1.0 1 0\n1.0 0 1\n1.0 -1 0\n1.0 0 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>If the distance between interpol and Dr. Gneh can be infinitely small, Dr. Gneh is considered to be captured.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+Tianjin+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia Tianjin Regional Contest </a> ","type":"source","format":"html"}]}