{"title":"Spade 7","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4448","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4448&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4448","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4448"},"statement":[{"title":"Problem Description","content":"      Spade 7, or &#x201C;Bie Qi&#x201D; in Chinese, is a popular card game using a standard deck of fifty-two cards - The deck consists of four suits of thirteen cards each, coded and sequenced as A (regarded as 1), 2, 3, 4, 5, 6, 7, 8, 9, 10, J (regarded as 11), Q (regarded as 12), and K (regarded as 13). The four suits are club (C), heart (H), spade (S), and diamond (D).<br>      Spade 7 is so easy and funny that can be well suited for any ages, No matter a primary school student or a card game expert, even professional bridge masters are addicted to the spade7. And it allows three to seven players playing together.<br>      These are the rules of Spade 7 in a four-player game:<br>      1.Each player receives thirteen cards.<br>      2.The owner of Spade 7 begins by discarding it. Then the players take turns in anti-clockwise order.<br>      3.In each turn, the player needs to discard one valid card, or fold one card when and only when he does not have any valid cards. A valid card is either a 7 of any suits, or touching another card (with the same suit and the difference between their codes is exactly one) which has been discarded by any player in previous turns.<br>      4.The game ends when nobody has cards in his hands.<br>      Every time someone folds a card, he receives penalty points equals to the code of this card. The goal for each player is, to minimize his penalty points.<br>      As pacifists, Alice and three of her best friends are tired of fighting with each other. So they want to try their best to minimize the sum of all four players&#x2019; penalty points. Can you help her figure out the best result?","type":"description","format":"html"},{"title":"Input","content":"      The input begins with a line containing an integer T (1 &#x2264; T &#x2264; 20), the number of test cases.<br>      Each test case contains four lines, describing the cards owned by four players at the beginning, one player per line. The four players are given in anti-clockwise order.<br>      Each line contains thirteen strings, separated by spaces. Each string describes one card in the follow format:<br>      1.The string is represented as &#x201C;suit&#x201D; + &#x201C;code&#x201D;.<br>      2.The &#x201C;suit&#x201D; is a character C (for club) or H (for heart) or S (for spade) or D (for diamond).<br>      3.The &#x201C;code&#x201D; can be A (regarded as 1), 2, 3, 4, 5, 6, 7, 8, 9, 10, J (regarded as 11), Q (regarded as 12), or K (regarded as 13).<br>      4.NO SPACE between the &#x201C;suit&#x201D; and the &#x201C;code&#x201D;.","type":"input_format","format":"html"},{"title":"Output","content":"      For each test case, output only one line -- the minimum sum of all four players&#x2019; penalty points.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\nHA H2 H3 H4 H5 H6 H7 H8 H9 H10 HJ HQ HK\nCA C2 C3 C4 C5 C6 C7 C8 C9 C10 CJ CQ CK\nSA S2 S3 S4 S5 S6 S7 S8 S9 S10 SJ SQ SK\nDA D2 D3 D4 D5 D6 D7 D8 D9 D10 DJ DQ DK</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+JinHua+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia JinHua Regional Contest </a> ","type":"source","format":"html"}]}