{"title":"Running Rabbits","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4452","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4452&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4452","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4452"},"statement":[{"title":"Problem Description","content":"      Rabbit Tom and rabbit Jerry are running in a field. The field is an N&#xFFFD;&#xFFFD;N grid. Tom starts from the up-left cell and Jerry starts from the down-right cell. The coordinate of the up-left cell is (1,1) and the coordinate of the down-right cell is (N,N)&#xFFFD;&#xFFFD;A 4&#xFFFD;&#xFFFD;4 field and some coordinates of its cells are shown below:<br><center><img style=\"max-width:100%;\" src=\"../../data/images/4452-1.jpg\"></center><br>      The rabbits can run in four directions (north, south, west and east) and they run at certain speed measured by cells per hour. The rabbits can&apos;t get outside of the field. If a rabbit can&apos;t run ahead any more, it will turn around and keep running. For example, in a 5&#xFFFD;&#xFFFD;5 grid, if a rabbit is heading west with a speed of 3 cells per hour, and it is in the (3, 2) cell now, then one hour later it will get to cell (3,3) and keep heading east. For example again, if a rabbit is in the (1,3) cell and it is heading north by speed 2,then a hour latter it will get to (3,3). The rabbits start running at 0 o&apos;clock. If two rabbits meet in the same cell at k o&apos;clock sharp( k can be any positive integer ), Tom will change his direction into Jerry&apos;s direction, and Jerry also will change his direction into Tom&apos;s original direction. This direction changing is before the judging of whether they should turn around.<br>      The rabbits will turn left every certain hours. For example, if Tom turns left every 2 hours, then he will turn left at 2 o&apos;clock , 4 o&apos;clock, 6 o&apos;clock..etc. But if a rabbit is just about to turn left when two rabbit meet, he will forget to turn this time. Given the initial speed and directions of the two rabbits, you should figure out where are they after some time.","type":"description","format":"html"},{"title":"Input","content":"      There are several test cases.<br>      For each test case:<br>      The first line is an integer N, meaning that the field is an N&#xFFFD;&#xFFFD;N grid( 2&#xFFFD;&#xFFFD;N&#xFFFD;&#xFFFD;20).<br>      The second line describes the situation of Tom. It is in format &quot;c s t&quot;&#xFFFD;&#xFFFD;c is a letter indicating the initial running direction of Tom, and it can be &apos;W&apos;,&apos;E&apos;,&apos;N&apos; or &apos;S&apos; standing for west, east, north or south. s is Tom&apos;s speed( 1&#xFFFD;&#xFFFD;s&lt;N). t means that Tom should turn left every t hours( 1&#xFFFD;&#xFFFD; t &#xFFFD;&#xFFFD;1000).<br>      The third line is about Jerry and it&apos;s in the same format as the second line.<br>      The last line is an integer K meaning that you should calculate the position of Tom and Jerry at K o&apos;clock( 1 &#xFFFD;&#xFFFD; K &#xFFFD;&#xFFFD; 200).<br>      The input ends with N = 0.","type":"input_format","format":"html"},{"title":"Output","content":"      For each test case, print Tom&apos;s position at K o&apos;clock in a line, and then print Jerry&apos;s position in another line. The position is described by cell coordinate.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\nE 1 1\nW 1 1\n2\n4\nE 1 1\nW 2 1\n5\n4\nE 2 2\nW 3 1\n5\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2\n3 3\n2 1\n2 4\n3 1\n4 1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+JinHua+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia JinHua Regional Contest </a> ","type":"source","format":"html"}]}