{"title":"Shoot the Airplane","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4458","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4458&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4458","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4458"},"statement":[{"title":"Problem Description","content":"XXX is playing an interesting game which is based on a 2D plane. In this game, he is required to shoot an airplane. The airplane flies horizontally. The shape of it can be regarded as a simple polygon. Player has to shoot at point (0, 0) upward vertically. Because the bullet is very small, it can be regarded as a point. The airplane is hit only if the bullet goes into the airplane. The airplane is not hit if the bullet only touches the edge of the airplane. The gravity should be considered. The acceleration of gravity is g and its direction is downward vertically. So the speed of the bullet may be change during flying. But the speed of airplane is constant because it has engines. XXX wants to know the time it takes the bullet to hit the airplane after shooting.","type":"description","format":"html"},{"title":"Input","content":"There are multiple cases.<br>In each case, there are three integers v (-10&lt;= v &lt;= 10), b (1 &lt;= b &lt;= 10), g (0 &lt;= g &lt;= 10) in the first line. v denotes the speed of airplane. The flying direction is from left to right if v is positive and the direction is from right to left if v is negative. b denotes the initial speed of bullet. g is the acceleration of gravity. Then the input will describe the position of the airplane when XXX shoots. In the second line, there is one integer n (3 &lt;= n &lt;= 20) which represents the number of vertexes of the airplane (polygon). In each of the next n lines, there are two integers x (-100 &lt;= x &lt;= 100), y (0 &lt;y&lt;= 100) which give the position of a vertex in order. There is a blank line after each case. The input ends with 0 0 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"If the airplane is hit, then output the time it takes the bullet to hit it after shooting in one line. The answer should be rounded to 2 digits after decimal point. If the airplane is not hit, then output &#xFFFD;&#xFFFD;Miss!&#xFFFD;&#xFFFD; in one line.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-10 10 2\n9\n6 9\n10 9\n10 16\n25 16\n25 20\n10 20\n10 27\n6 27\n-10 18\n\n-10 10 2\n9\n6 9\n10 9\n10 16\n20 16\n20 20\n10 20\n10 27\n6 27\n-10 18\n\n0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.00\nMiss!</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+Hangzhou+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia Hangzhou Regional Contest </a> ","type":"source","format":"html"}]}