{"title":"Homework","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4459","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4459&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4459","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4459"},"statement":[{"title":"Problem Description","content":"XXX always procrastinate over his homework. This time, he is wondering that if he can finish all his projects before deadline. There are n (2&lt;=n&lt;=5) projects to do. Each projects has a deadline d (1&lt;=d&lt;=1000) which means that this project must be finished no later than d o&apos;clock.<br>For each project, there is an interval [s1, s2] (1&lt;=s1&lt;=s2&lt;=200) meaning that XXX will spend at least s1 hours and at most s2 hours to finish it. <br>Let random variable t denotes that it takes t hours to finish the project. (Note that t may take real values). <br>If s1&lt;s2, variable t obeys a continuous uniform distribution. Its probability density function is:<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/4459-1.jpg\"></center> <br><br>If s1=s2, variable t takes constant value s1.<br>In probability theory, a probability density function (pdf), or density of a continuous random variable, is a function that describes the relative likelihood for this random variable to take on a given value. The probability for the random variable to fall within a particular region is given by the integral of this variable&#xFFFD;&#xFFFD;s density over the region. The probability density function is nonnegative everywhere, and its integral over the entire space is equal to one.<br>XXX cannot engage in different projects at the same time. He wants to arrange the order of his projects to be done properly, so that the probability that all projects are finished before or just meet the deadline is maximized.<br>","type":"description","format":"html"},{"title":"Input","content":"There are no more than 3000 cases. <br>For each case, the first line begins with an integer n --- the number of projects. <br>Each of the following n lines describes one project which contains three integers --- the above mentioned s1, s2 and d. <br>The input ends by n=0.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the answer in one line. <br>If the probability is 0, then output &#xFFFD;&#xFFFD;Poor boy!&#xFFFD;&#xFFFD; without quotes.<br>If the probability is 1, then output &#xFFFD;&#xFFFD;Congratulations!&#xFFFD;&#xFFFD; without quotes. <br>If the probability is between 0 and 1 exclusive, then output a fraction to represent the probability. The numerator and the denominator should be positive and co-prime.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 1 3\n1 3 3\n2\n1 1 3\n2 2 2\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1/2\nCongratulations!</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+Hangzhou+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia Hangzhou Regional Contest </a> ","type":"source","format":"html"}]}