{"title":"The Power of Xiangqi","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4461","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4461&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4461","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4461"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../data/images/4461-1.jpg\"></center> <br>Xiangqi is one of the most popular two-player board games in China. The game represents a battle between two armies with the goal of capturing the enemy&#xFFFD;&#xFFFD;s &#xFFFD;&#xFFFD;general&#xFFFD;&#xFFFD; piece.<br>Now we introduce some basic rules of Xiangqi. Xiangqi is played on a 10&#xFFFD;&#xFFFD;9 board and the pieces are placed on the intersections (points). There are two groups of pieces marked by black or red Chinese characters, belonging to the two players separately. During the game, each player in turn moves one piece from the point it occupies to another point. No two pieces can occupy the same point at the same time. A piece can be moved onto a point occupied by an enemy piece, in which case the enemy piece is &quot;captured&quot; and removed from the board. When the general is in danger of being captured by the enemy player on the enemy player&#xFFFD;&#xFFFD;s next move, the enemy player is said to have &quot;delivered a check&quot;. If the general&apos;s player can make no move to prevent the general&apos;s capture by next enemy move, the situation is called &#xFFFD;&#xFFFD;checkmate&#xFFFD;&#xFFFD;. <br>Each player has 7 kinds of pieces in this game. Their names, offense power and symbol letters are shown in the table below:<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/4461-2.jpg\"></center> <br><br>Now show you the pieces of red player and black player, you are going to find out which player has the larger total offense power. Since Ma and Pao working together can have good effect, if a player has no Ma or no Pao, or has neither, his total offense power will be decreased by one. But the total offense power can&apos;t be decreased to zero, it is at least one.","type":"description","format":"html"},{"title":"Input","content":"The first line is an integer T ( T &lt;= 20) meaning there are T test cases. <br>For each test case: The first line shows which pieces the red player has. It begins with an integer n ( 0 &lt; n &lt;= 16) meaning the number of pieces. <br>Then n letters follows, all separated by one or more blanks. Each letter is a symbol letter standing for a piece, as shown in the table above. <br>The second line describes the situation of the black player, in the same format as the first line.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, if the red player has more offense power, then print &quot;red&quot;. If the black player has more offense power, then print &quot;black&quot;. If there is a tie, print &quot;tie&quot;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 A B\n2 A B\n7 A A B C D D F \n7 A A B B C C F\n5 A A B B F\n3 A B F</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">tie\nblack\nred</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+Hangzhou+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia Hangzhou Regional Contest </a> ","type":"source","format":"html"}]}