{"title":"Outlets","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4463","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4463&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4463","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4463"},"statement":[{"title":"Problem Description","content":"In China, foreign brand commodities are often much more expensive than abroad. The main reason is that we Chinese people tend to think foreign things are better and we are willing to pay much for them. The typical example is, on the United Airline flight, they give you Haagendazs ice cream for free, but in China, you will pay $10 to buy just a little cup.<br>So when we Chinese go abroad, one of our most favorite activities is shopping in outlets. Some people buy tens of famous brand shoes and bags one time. In Las Vegas, the existing outlets can&apos;t match the demand of Chinese. So they want to build a new outlets in the desert. The new outlets consists of many stores. All stores are connected by roads. They want to minimize the total road length. The owner of the outlets just hired a data mining expert, and the expert told him that Nike store and Apple store must be directly connected by a road. Now please help him figure out how to minimize the total road length under this condition. A store can be considered as a point and a road is a line segment connecting two stores.<br>","type":"description","format":"html"},{"title":"Input","content":"There are several test cases. For each test case: The first line is an integer N( 3 &lt;= N &lt;= 50) , meaning there are N stores in the outlets. These N stores are numbered from 1 to N. The second line contains two integers p and q, indicating that the No. p store is a Nike store and the No. q store is an Apple store. Then N lines follow. The i-th line describes the position of the i-th store. The store position is represented by two integers x,y( -100&lt;= x,y &lt;= 100) , meaning that the coordinate of the store is (x,y). These N stores are all located at different place. The input ends by N = 0.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print the minimum total road length. The result should be rounded to 2 digits after decimal point.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n2 3\n0 0\n1 0\n0 -1 \n1 -1\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3.41</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2012+Asia+Hangzhou+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2012 Asia Hangzhou Regional Contest </a> ","type":"source","format":"html"}]}