{"title":"Mad Veterinarian","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4490","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4490&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4490","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4490"},"statement":[{"title":"Problem Description","content":"<i>Mad Veterinarian</i> puzzles have a mad veterinarian, who has developed several machines  that  can  transform an animal into one or more animals and back again. The puzzle is  then  to determine if it  is possible  to change one collection of animals into another by applying  the machines in some order (forward or reverse). For example: <br><br>Machine A turns one ant into one beaver.<br>Machine B turns one beaver into one ant, one beaver and one cougar.<br>Machine C turns one cougar into one ant and one beaver.<br><br>Can we convert a beaver and a cougar into 3 ants?<br><img style=\"max-width:100%;\" src=\"../../data/images/C426-1007-1.jpg\"> <br><br>Can we convert one ant into 2 ants? NO<br><br>These puzzles have  the properties  that:  <br><br>1.  In forward mode, each machine converts one animal of a given species into a finite, non-empty collection of animals from  the species in the puzzle.<br>2.  Each machine can operate in reverse.<br>3.  There is one machine for each species in the puzzle and that machine (in forward mode) takes as input  one animal of  that  species.<br><br>Write a program  to find the shortest solution (if any)  to Mad Veterinarian puzzles.  For this problem we will restrict   to Mad Veterinarian puzzles with exactly  three machines, A, B, C.<br>","type":"description","format":"html"},{"title":"Input","content":"The first  line of input  contains a single integer P, (1&lt;= P &lt;= 1000 ), which is the number of data sets  that follow.  Each data set consists of several lines of input. Each data set  should be processed identically and independently.<br><br>The first line of each data set  consists of  two decimal integers separated by a single space.  The first integer is the data set  number.  The second integer is the number, N, of puzzle  questions.  The next three input lines contain the descriptions of machines A, B and C in that  order.  Each machine description line consists of  three decimal integers separated by spaces giving the number of animals of  type a, b and c output  for one input  animal.  The following N lines give  the puzzle questions for the Mad Veterinarian puzzle. Each contains seven decimal digits separated by single spaces:   the puzzle number,  the three starting animal counts for animals a, b and c followed by  the  three desired ending animal counts for animals a, b and c.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each input  data set   there are multiple lines of output. The first  line of output  for each data set contains  the data set  number, a space and the number of puzzle questions (N). For each puzzle question,  there is one line of output  which consists of  the puzzle question number followed by a space, followed by &#xFFFD;&#xFFFD;NO SOLUTION&#xFFFD;&#xFFFD;, (without  the quotes) if  there is no solution OR  the puzzle question number followed by  the shortest  number of machine steps used, a space and a sequence of letters [A B C a b c] with capital letters indicating applying the machine in the forward direction and lower case letters indicating applying  the machine in the reverse direction.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 2\n0 1 0\n1 1 1\n1 1 0\n1 0 1 1 3 0 0\n2 1 0 0 2 0 0\n2 2\n0 3 4\n0 0 5\n0 0 3\n1 2 0 0 0 0 5\n2 2 0 0 0 0 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2\n1 3 Caa\n2 NO SOLUTION\n2 2\n1 NO SOLUTION\n2 25 AcBcccBccBcccAccBccBcccBc</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=Greater+New+York+2012&amp;source=1&amp;searchmode=source\"> Greater New York 2012 </a> ","type":"source","format":"html"}]}