{"title":"Changsha Marathon","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4575","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4575&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4575","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4575"},"statement":[{"title":"Problem Description","content":"&#x3000;&#x3000;Changsha is a beautiful city surrounded by mountains and rivers, forming a charming scenery. There are many tourist attractions in Changsha: Yuelu Academy, the predecessor of Hunan University, which is one of the four most famous academies in China. It was established in 976A.D. in Northern Song Dynasty. Juzizhou Island (Orange Isle) is the world&apos;s longest inland river isle which lies in Xiangjiang River and it is famous for the famous poet Qinyuanchun-Changsha written by Chairman Mao. Mawangdui is a famous archaeological site that contains the tombs of three people from the Western Han Dynasty. The tomb of Xin Zhui is best preserved among the three with a complete cosmetic set, lacquered pieces and finely woven silk garments. Huogongdian represents the Huxiang culture and Chuwu culture, Hunan&#x2019;s geography culture and Hunan&#x2019;s distinctive food culture. Tourists can have a taste of typical Hunan cuisine in it.<br>&#x3000;&#x3000;Every year the city holds a marathon. When planning the route, the organizers wish to go pass some tourist attractions to make it more enjoyable to attract more athletes and audience. Changsha can be treated as a graph consisted of N intersections and many bidirectional roads. A road connects two intersections i and j with length Wi,j. However, to reduce the impact to the daily traffic, only N-1 roads specified by the local government which can connect all N intersections are allowed to be used as the route. And the intersections with only one adjacent intersection are on the west bank of Xiangjiang River and there are ferries only at these intersections. The marathon starts at the intersection called Red East Square (marked as S) in Hunan University by convention. The organizers do not want the route pass any road twice, so the marathon has to be separated into two sections, the first section and the second section. Two different points have to be selected from intersections on the bank to act as the half end point S1 and the half starting point S2. The first section starts from S and end in S1. The second section starts from S2 and end in S. The organizer will use ferryboats to transport athletes from S1 to S2 as required by the government.<br>&#x3000;&#x3000;Considering the safety, some supply points are to be set on some intersections on each half section and there must be a supply point set on S, S1 and S2.<br>According to scientific research, the most suitable distance between two adjacent supply points is L and the organizers want to minimize the evaluation of the route. For each section, the evaluation from the starting point to rest point i is marked as Ei, and <img style=\"max-width:100%;\" src=\"../../data/images/C468-1011-1.jpg\">where j is the previous supply point on the route,<img style=\"max-width:100%;\" src=\"../../data/images/C468-1011-2.jpg\">&#x3000;&#x3000;means the sum of the roads&#x2019; length on the route from intersection j to i. The evaluation of the starting point is zero. The evaluation of a section equals to the evaluation from its starting point to end point.<br>&#x3000;&#x3000;Your task is to select S1, S2, and the supply points to minimize the total evaluation of both sections.","type":"description","format":"html"},{"title":"Input","content":"&#x3000;&#x3000;There are multiple test cases.<br>&#x3000;&#x3000;For each test case the first line contains two integers, N, L. (1&lt;=N&lt;=20000, 1&lt;=L&lt;=10<sup>9</sup>)<br>&#x3000;&#x3000;The next N-1 lines with 3 integers, U, V, W, describes that a bidirectional road connects intersection U and V with distance W. (1&lt;=U, V&lt;=N, 1&lt;=W&lt;=10<sup>3</sup>)<br>Red East Square (S) is always numbered 1. The input will finish with the end of file.","type":"input_format","format":"html"},{"title":"Output","content":"&#x3000;&#x3000;For each case the output contains only one line, the evaluation of the best plan rounded to the second digit after the decimal point. If there is no solution, output -1.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 4\n1 2 2\n1 3 7\n1 4 3\n2 5 6\n2 6 5\n3 7 8</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7.00\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nThe sample solution:\n<center><img src=\"../../data/images/C468-1011-3.jpg\"><img src=\"../../data/images/C468-1011-4.jpg\"></center>\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM-ICPC%B3%A4%C9%B3%C8%FC%C7%F8%C8%AB%B9%FA%D1%FB%C7%EB%C8%FC%A1%AA%A1%AA%CC%E2%C4%BF%D6%D8%CF%D6&amp;source=1&amp;searchmode=source\"> 2013 ACM-ICPC&#x957F;&#x6C99;&#x8D5B;&#x533A;&#x5168;&#x56FD;&#x9080;&#x8BF7;&#x8D5B;&#x2014;&#x2014;&#x9898;&#x76EE;&#x91CD;&#x73B0; </a> ","type":"source","format":"html"}]}