{"title":"Eloh","time_limit":3000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4590","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4590&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4590","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4590"},"statement":[{"title":"Problem Description","content":"In 3201, The humans have conquered the whole universe. <br>During the conquest ,we found lots of magical phenomena overthrown our previous cognition.<br>For example, the Eloh is a hole like the black hole but has its own property. And if something is around the Eloh, there is a force between them, named &#xFFFD;&#xFFFD;EF&#xFFFD;&#xFFFD;(Eloh Force).<br>Every Eloh has a circle area around it, and the Eloh is the center of the circle area.<br>The circle is called &#xFFFD;&#xFFFD;EFL&#xFFFD;&#xFFFD; (Eloh Force Line).<br>If there is a thing that has the mass(m) and the volume(v), the EF will satisfy the following properties:<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;1. In the EFL, EF = v / m and the force performs as the gravitational force.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;2. Out the EFL, EF = m / v and the force performs as the repulsion force<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<br>One day, Farmer John was grazing his robot cows in the universe. The number of cows is N and every cow has its own mass(mi) and volume(vi).<br>Suddenly, he encountered such an Eloh. At first he and his cows are in the EFL.<br>Sadly, the Eloh is swept away some of his cows that stressed the most powerful EF from the Eloh. In other words, sort all the cows&#xFFFD;&#xFFFD;EF from large to small and choose some cows from the front to the back. Luckily, he and the rest of cows escaped to the external of the EFL. To leave the Eloh quickly, he put the reminding cows packaged as a connecting body, i.e, the overall performance of the mass M = sum(mi) (the cow[i] is not swept by the Eloh) and the volume V = sum(vi) (like the previous). Because of the panic, he don&#xFFFD;&#xFFFD;t know exactly how many cows were swept away, just know that not all been swept away, nor is the zero.<br>As a magical uncle grazing in the universe, Farmer John can create a wormhole through the Eloh center and the outside world. Farmer John can exchange some pair of the cows(pick some cows in the Eloh and choose the same number of cows outside the cave). The connecting body&#xFFFD;&#xFFFD;s M and V will calculator again after exchanging.<br>Now, Farmer John would like to know when how many cows were swept away in the beginning, there is an exchange scheme can make his EF bigger.<br>To ensure that no two cows have the same density(m/v).<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases.<br>The first line of the case contains a number  N(0 &lt; N &lt;= 200000)<br>The following N lines, each of two number m<sub>i</sub> and v<sub>i</sub>.(0 &lt; m<sub>i</sub>,v<sub>i</sub> &lt;= 100000),  the sequence will be in density ascending order.<br>The input is terminated by a line containing 0.","type":"input_format","format":"html"},{"title":"Output","content":"For each case of input,  the output should consist of one line giving the number Q of the exchange schemes, following Q lines that contain a number K meaning if in the beginning, there are K cows swept away, Farmer John can find an exchange program to help him. Of course, you should output them from small to big.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n1 3\n3 8\n4 10\n1 2\n5 9\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM-ICPC%C4%CF%BE%A9%C8%FC%C7%F8%C8%AB%B9%FA%D1%FB%C7%EB%C8%FC%A1%AA%A1%AA%CC%E2%C4%BF%D6%D8%CF%D6&amp;source=1&amp;searchmode=source\"> 2013 ACM-ICPC&#xFFFD;&#x3FE;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x22B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x13F;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}