{"title":"Robot","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4593","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4593&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4593","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4593"},"statement":[{"title":"Problem Description","content":"A robot is a mechanical or virtual artificial agent, usually an electro-mechanical machine that is guided by a computer program or electronic circuitry. Robots can be autonomous or semi-autonomous and range from humanoids such as Honda&apos;s Advanced Step in Innovative Mobility (ASIMO) and Tosy&apos;s TOSY Ping Pong Playing Robot (TOPIO) to industrial robots, collectively programmed &apos;swarm&apos; robots, and even microscopic nano robots. By mimicking a lifelike appearance or automating movements, a robot may convey a sense of intelligence or thought of its own.<br>Robots have replaced humans in the assistance of performing those repetitive and dangerous tasks which humans prefer not to do, or are unable to do due to size limitations, or even those such as in outer space or at the bottom of the sea where humans could not survive the extreme environments.<br>After many years, robots have become very intellective and popular. Glad Corporation is a big company that produces service robots. In order to guarantee the safety of production, each robot has an unique number (each number is selected from 1 to N and will be recorded when the robot is produced).<br>But one day we found that N+1 robots have been produced in the range of 1 to N , that&apos;s to say one number has been used for 2 times. Now the president of Glad Corporation hopes to find the reused number as soon as possible.","type":"description","format":"html"},{"title":"Input","content":"Multiple cases, end with EOF.<br>In each case, The first line has one number N, which represents the maximum number. The next line has N +1 numbers. (All numbers are between 1 to N, and only two of them are the same.) (1 &lt;= N &lt;= 10<sup>3</sup>)","type":"input_format","format":"html"},{"title":"Output","content":"Each case, output a line with the reused number.<br>There are no black lines between cases.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 2 1\n1\n1 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM-ICPC%C4%CF%BE%A9%C8%FC%C7%F8%C8%AB%B9%FA%D1%FB%C7%EB%C8%FC%A1%AA%A1%AA%CC%E2%C4%BF%D6%D8%CF%D6&amp;source=1&amp;searchmode=source\"> 2013 ACM-ICPC&#xFFFD;&#x3FE;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x22B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x13F;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}