{"title":"Harvest Moon","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4600","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4600&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4600","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4600"},"statement":[{"title":"Problem Description","content":"Harvest Moon (&#x7267;&#x5834;&#x7269;&#x8A9E; Bokuj&#x14D; Monogatari) is a virtual role playing game for the Super Nintendo Entertainment System developed and published by Pack-In-Video (now Marvelous AQL), first released in Japan in 1996, and 1997 in North America. This is the first game in the long-running Harvest Moon titles. A PAL version was released by Nintendo in early 1998 for Western Europe and Oceania, with language localizations for Germany and France.<br>-- wikipedia<br><br>Hard though, it&apos;s still an incorrigibly temptation for Moor. In the game, Moor&apos;s favorite is to cultivate in his own pasture. His pasture is large - we may consider it as a w&#xD7;h lattice.<br>The shop sells A kinds of seeds. The price of the ith seed is Q_i dollars, and it can be sowed to cover a 3&#xD7;3 lattice. Note that the cover area may contain the grids outside his pasture, but only the grids inside belong to him. Further more, although a grid may be sowed multiple times, the later sowing on this grid exert nothing if the corns are still growing in it.<br>After ploughing and weeding, the corns get ripe right after N_i days and Moor will go harvest. For instance, if Moor sows the seeds at the beginning of day x, they will get ripe at the beginning of the (x+N_i)th day(or you may consider it as the right end of the (x+N_i-1)th day). After harvest, some of the corns will disappear and the grids they belong to would become empty, while the others may stays and get ripe again and again, in a period of M_i days. For convenience, Moor always leaves the second kind of corns staying, but he will try to keep sowing in those new empty grids. Moor only sows seeds and harvest at the beginning or ending of some day, and you may assume it wastes no time for Moor to make operations.<br>Initially, Moor&apos;s got Y dollars. When selling a 1&#xD7;1 grid of corns, he will obtain P_i dollars back. Moor wonders the maximum dollars he will get at the end of the Dth day, if he buys only one kind of seeds? Certainly, he may do nothing and keep all dollars in his pocket.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases.<br>An integer T(T&#x2264;110) will exist in the first line of input, indicating the number of test cases.<br>Each test case begins with 5 integers w,h,A,D,Y(3&#x2264;w,h&#x2264;100,0&lt;A,D&#x2264;1000,0&lt;Y&#x2264;100000).<br>The following A lines, each with 4 integers Q_i,P_i,N_i,M_i (0&lt;Q_i,P_i&#x2264;1000;N_i,M_i&#x2264;10000), describe the property of the ith seed. M_i=0 denotes that the seed will not get ripe again after harvest.<br>","type":"input_format","format":"html"},{"title":"Output","content":"Output the maximum dollars he&apos;s able to obtain at the end of the Dth day, one per line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 3 2 3 100\n100 90 3 0\n100 90 2 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">810</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 1 </a> ","type":"source","format":"html"}]}