{"title":"Magic Ball Game","time_limit":5000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4605","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4605&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4605","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4605"},"statement":[{"title":"Problem Description","content":"When the magic ball game turns up, Kimi immediately falls in it. The interesting game is made up of N balls, each with a weight of w[i]. These N balls form a rooted tree, with the 1st ball as the root. Any ball in the game has either 0 or 2 children ball. If a node has 2 children balls, we may define one as the left child and the other as the right child.<br>The rules are simple: when Kimi decides to drop a magic ball with a weight of X, the ball goes down through the tree from the root. When the magic ball arrives at a node in the tree, there&apos;s a possibility to be catched and stop rolling, or continue to roll down left or right. The game ends when the ball stops, and the final score of the game depends on the node at which it stops.<br>After a long-time playing, Kimi now find out the key of the game. When the magic ball arrives at node u weighting w[u], it follows the laws below:<br><strong>1</strong>&#xA0;&#xA0;If X=w[u] or node u has no children balls, the magic ball stops.<br><strong>2</strong>&#xA0;&#xA0;If X&lt;w[u], there&apos;s a possibility of 1/2 for the magic ball to roll down either left or right.<br><strong>3</strong>&#xA0;&#xA0;If X&gt;w[u], the magic ball will roll down to its left child in a possibility of 1/8, while the possibility of rolling down right is 7/8.<br>In order to choose the right magic ball and achieve the goal, Kimi wonders what&apos;s the possibility for a magic ball with a weight of X to go past node v. No matter how the magic ball rolls down, it counts if node v exists on the path that the magic ball goes along.<br>Manual calculating is fun, but programmers have their ways to reach the answer. Now given the tree in the game and all Kimi&apos;s queries, you&apos;re required to answer the possibility he wonders.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases. An integer T(T&#x2264;15) will exist in the first line of input, indicating the number of test cases.<br>Each test case begins with an integer N(1&#x2264;N&#x2264;10<sup>5</sup>), indicating the number of nodes in the tree. The following line contains N integers w[i], indicating the weight of each node in the tree. (1 &#x2264; i &#x2264; N, 1 &#x2264; w[i] &#x2264; 10<sup>9</sup>, N is odd)<br>The following line contains the number of relationships M. The next M lines, each with three integers u,a and b(1&#x2264;u,a,b&#x2264;N), denotes that node a and b are respectively the left child and right child of node u. You may assume the tree contains exactly N nodes and (N-1) edges.<br>The next line gives the number of queries Q(1&#x2264;Q&#x2264;10<sup>5</sup>). The following Q lines, each with two integers v and X(1&#x2264;v&#x2264;N,1&#x2264;X&#x2264;10<sup>9</sup>), describe all the queries.<br>","type":"input_format","format":"html"},{"title":"Output","content":"If the magic ball is impossible to arrive at node v, output a single 0. Otherwise, you may easily find that the answer will be in the format of 7<sup>x</sup>/2<sup>y</sup> . You&apos;re only required to output the x and y for each query, separated by a blank. Each answer should be put down in one line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\n2 3 1\n1\n1 2 3\n3\n3 2\n1 1\n3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n0 0\n1 3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 1 </a> ","type":"source","format":"html"}]}