{"title":"Occupy Cities","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4606","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4606&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4606","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4606"},"statement":[{"title":"Problem Description","content":"The Star Wars is coming to an end as the Apple Planet is beaten by the Banana Planet. Captain Chen, the glorious leader of the Army of Banana Planet, has drawn up a plan to occupy all the cities on the Apple Planet. The Army of Banana Planet totally has P soldiers, and thus, Captain Chen can only conduct at most P soldiers to occupy the cities.<br>The cities on the planet can be regarded as points on a 2D plane. What&apos;s more, there are some barriers on the planet, which can be seen as segments on the plane. When a soldier moves from city to city, he&apos;s not allowed to cross or touch the barriers. However, the soldiers are smart enough to go along the shortest paths between cities.<br>But these soldiers are just soldiers, whereupon they also need food to replenish their energy. A soldier needs one unit of food to move one unit of distance forward. Fortunately, all the cities have sufficient food supplies. When a soldier steps in a city, he will fill up his food bag. Invaders as they are, the soldiers will burn up all the food after filling his bag. And thus, each city can supply only one soldier.<br>When a soldier steps in a city, this city is occupied by the Army of Banana Planet immediately. Soldiers can also just pass by a city but not step in. In this case, this city is not occupied yet, and the food in the city would not be burned.<br>Captain Chen has an occupying schedule for his soldiers. If city A is arranged before city B on the schedule, city A must be occupied before city B. All the soldiers will strictly follow this schedule. During the occupying process, soldiers can be air-dropped to any positions on the plane as needed. After a soldier lands on the ground, he can only move on foot, and replenish his energy by the food in his bag. Note that their bags are full of food initially, and all bags have the same volume for soldiers.<br>You, the logistics minister of the army, are required to help the Captain to cut down the cost and determine the minimal volume of all P soldiers&apos; food bags to finish occupying. All the requirements above should be fulfilled for sure.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T(T&#xFFFD;&#xFFFD;50), indictaing the number of test cases.<br>Each test case begins with three integers n(0&lt;n&#xFFFD;&#xFFFD;100), m(0&#xFFFD;&#xFFFD;m&#xFFFD;&#xFFFD;100) and p(0&lt;p&#xFFFD;&#xFFFD;100), which respectively denotes the number of cities, barriers and soldiers.<br>The following n lines describe the cities&apos; coordinates (x_i,y_i).<br>The next m lines, each with two pairs of integers (sx<sub>i</sub>,sy<sub>i</sub>) and (ex<sub>i</sub>,ey<sub>i</sub>), describe the two endpoints of each barrier.<br>The last line of each test case consists of n integers, describing the occupying schedule in order.<br>All the coordinates range from -10000 to 10000, and cities are labeled from 1 to n. You may assume that any two barriers will not have common points and cities will not be built on barriers.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the minimal volume of soldiers&apos; food bag, in accuracy of two decimal places. The answers should be printed one per line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n\n2 1 1\n0 0\n2 0\n1 1 1 -1\n2 1\n\n4 2 2\n0 1\n5 1\n8 0\n1 -1\n0 0 2 0\n6 0 6 3\n1 2 3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.83\n3.41\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nFor the second sample case, the best strategy is:\nstep 1: air-drop soldier 1 to city 1, city 1 occupied;\nstep 2: air-drop soldier 2 to city 2, city 2 occupied;\nstep 3: soldier 2 moves from city 2 to city 3, city 3 occupied, and 3.41 units of food needed;\nstep 4: soldier 1 moves from city 1 to city 4, city 4 occupied, and 2.41 units food needed.\nTherefore, the minimal volume of bags is 3.41.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 1 </a> ","type":"source","format":"html"}]}