{"title":"Cards","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4610","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4610&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4610","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4610"},"statement":[{"title":"Problem Description","content":"Given some cards each assigned a number, you&apos;re required to select EXACTLY K cards among them.<br>While you select a card, I will check the number assigned to it and see if it satisfies some of the following conditions:<br><strong>1.</strong>  the number is a prime number;<br><strong>2.</strong>  the amount of its divisors is a prime number;<br><strong>3.</strong>  the sum of its divisors is a prime number;<br><strong>4.</strong>  the product of all its divisors is a perfect square number. A perfect square number is such a kind of number that it can be written as a square of an integer.<br>The score you get from this card is equal to the amount of conditions that its number satisfies. The total score you get from the selection of K cards is equal to the sum of scores of each card you select.<br>After you have selected K cards, I will check if there&apos;s any condition that has never been satisfied by any card you select. If there is, I will add some extra scores to you for each unsatisfied condition. To make the game more interesting, this score may be negative.<br>After this, you will get your final score. Your task is to figure out the score of each card and find some way to maximize your final score.<br>Note that 1 is not a prime number. In this problem, we consider a number to be a divisor of itself. For example, considering the number 16, it is not a prime. All its divisors are respectively 1, 2, 4, 8 and 16, and thus, it has 5 divisors with a sum of 31 and a product of 1024. Therefore, it satisfies the condition 2, 3 and 4, which deserves 3 points.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains the number of test cases T.<br>Each test case begins with two integers N and K, indicating there are N kinds of cards, and you&apos;re required to select K cards among them.<br>The next N lines describes all the cards. Each of the N lines consists of two integers A and B, which denote that the number written on this kind of card is A, and you can select at most B cards of this kind.<br>The last line contains 4 integers, where the ith integer indicates the extra score that will be added to the result if the ith condition is not satisfied. The ABSOLUTE value of these four integers will not exceed 40000.<br>You may assume 0&lt;N&#x2264;10<sup>3</sup>,0&lt;K&#x2264;10<sup>4</sup>,1&#x2264;A&#x2264;10<sup>6</sup>,1&#x2264;B&#x2264;10<sup>4</sup>,T&#x2264;40 and the total N of all cases is no more than 20000. In each case there are always enough cards that you&apos;re able to select exact K cards among them.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output two lines for each test case.<br>The first line consists of N integers separated by blanks, where the ith integer is the score of the ith card.<br>The second line contains a single integer, the maximum final scores you can get.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5 3\n1 1\n2 1\n3 1\n4 1\n5 1\n1 2 3 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 3 2 2 2\n11</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 1 </a> ","type":"source","format":"html","require":["katex"]}]}