{"title":"Rain on your Fat brother","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4637","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4637&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4637","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4637"},"statement":[{"title":"Problem Description","content":"After retired form the ACM/ICPC competition, Fat brother starts his civil servant&#x2019;s life with his pretty girl friend Maze. As far as we known for this holy job, we can imagine how a decadent life they are dealing with!<br><br>But one day, Fat brother and Maze have a big quarrel because of some petty things and Maze just run away straight from him. It&#x2019;s raining cats and dogs outside, our hero Fat brother feel very worried about the little princess so he decide to chase her. As Maze is a tsundere girl, she would feel angry when she touches the rain until she meets the Fat brother.<br><br>To simplify this problem, we can just consider each person as a point running along the X coordinate from right to left and the rain as a combination of an isosceles triangle and a half round. The speed of Maze is v1 unit per second and the speed of Fat brother is v2 unit per second (v1 &lt; v2). The place where they have a quarrel is (x, 0) and Fat brother start to chase Maze after T second. You can assume that the rain is doing the uniform linear motion (drop with the same speed forever). Your task is calculating how long (time) the Maze is in the rain. The Maze is considered in the rain even if the point representing her is just touch the border. See the picture for more detail.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C457-1006-1.jpg\"></center><br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains only one integer T (T&lt;=200), which is the number of test cases. For each test case, first line comes five positive integer v<sub>1</sub>, v<sub>2</sub>, v, t, x (v<sub>1</sub>&lt;v<sub>2</sub>). v<sub>1</sub> is the speed of Maze, v<sub>2</sub> is the speed of Fat brother, v is the speed of the rain, you can assume that all rain is in a same speed, t means Fat brother starts to chase Maze after t second, x means they have a quarrel in (x, 0). Then a line with an integer n means that there is n rain begin to drop when Maze start running, 1&lt;=n&lt;=1000. Then n lines describe the rain. Each line contains four integers x<sub>0</sub>, y<sub>0</sub>, r, h. (x<sub>0</sub>, y<sub>0</sub>) is the center of the circle, r is the radius of the circle, h is the height of the triangle. All the number mentioned before except x<sub>0</sub> are positive and no large than 1000. x<sub>0</sub> is no large than 1000 and no less than -1000. Note that the point (x, 0) may in the rain in the beginning. Two rains may intersect with each other. See the picture for more detail.<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C457-1006-2.jpg\"></center>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the case number first, then output how long (time) Maze is in the rain, round to 4 digits after decimal point.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n1 2 1 100 1\n1\n1 1 1 1\n1 2 1 100 1\n1\n2 1 1 1\n1 2 1 100 1\n1\n-9 9 10 10\n2 3 1 100 1\n1\n-9 9 10 10</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1.0000\nCase 2: 0.0000\nCase 3: 12.0534\nCase 4: 8.0428</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+4&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 4 </a> ","type":"source","format":"html"}]}