{"title":"Finding string","time_limit":3000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4668","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4668&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4668","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4668"},"statement":[{"title":"Problem Description","content":"Richard is a smart data analyst in a famous company. One of his daily boring work is to find how many times does a pattern string occur in a very long string.<br>Luckily, Richard notices that there are many consecutive repeated substrings in this very long string, so he uses the following compression algorithm to make the string shorter:<br><br>a). Find a <strong>non-compressed</strong> consecutive repeated substring of the original string, e.g. &#xFFFD;&#xFFFD;ab&#xFFFD;&#xFFFD; in &#xFFFD;&#xFFFD;cabababd&#xFFFD;&#xFFFD;.<br>b). Replace the repeating part with the bracketed repetend, followed by the times the repetend appears in the original string. e.g. Write &#xFFFD;&#xFFFD;cabababd&#xFFFD;&#xFFFD; as &#xFFFD;&#xFFFD;c[ab]3d&#xFFFD;&#xFFFD;. Note she can also write it as &#xFFFD;&#xFFFD;c[ab]1ababd&#xFFFD;&#xFFFD; or &#xFFFD;&#xFFFD;ca[ba]2bd&#xFFFD;&#xFFFD; and so on, although these string are not compressed as well as the first one is.<br>c). Repeat a) and b) several times until the string is short enough.<br><br>However, Richard finds it still a bit hard for him to do his work after the compression. So he orders you to write a program to make his work easier. Can you help him?","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases, terminated by EOF. The number of test cases does not exceed 10000.<br>Each test case contains two lines, denote the compressed text and pattern string. The decompressed text and pattern string contain lowercase letter only. The first line contains only lowercase letters (a-z), square brackets ([]) and numbers (0-9), and the second line contains only lowercase letters (a-z). The brackets must be followed with an integer t(1&#xFFFD;&#xFFFD;t&#xFFFD;&#xFFFD;2<sup>31</sup>-1)indicating the times the string in the brackets repeat. The brackets <strong>won&apos;t</strong> be nested.<br>You can assume the length of the compressed string and pattern string won&apos;t exceed 500.<br>Please note that for most test cases, the length of the pattern string is relatively very small.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a single line containing the times this pattern string occurs in the very long string.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">[ab]10aaba\nba</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">11</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+7&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 7 </a> ","type":"source","format":"html"}]}