{"title":"Cube number on a tree","time_limit":10000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4670","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4670&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4670","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4670"},"statement":[{"title":"Problem Description","content":"The country Tom living in is famous for traveling. Every year, many tourists from all over the world have interests in traveling there.<br>There are n provinces in the country. According to the experiences from the tourists came before, every province has its own preference value. A route&#x2019;s preference value from one province to another is defined as the product of all the preference value of the provinces on the route. It&#x2019;s guaranteed that for each two provinces in the country there is a unique route from one to another without passing any province twice or more.<br>Tom is a boy crazy about cube number. A cube number is a positive integer whose cube root is also an integer. He is planning to travel from a province to another in the summer vacation and he will only choose the route with the cube number preference value. Now he want to know the number of routes that satisfy his strange requirement.","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases, terminated by EOF.<br>Each case begins with a number n ( 1 &#x2264; n &#x2264; 50000), the number of the provinces.<br>The second line begins with a number K (1 &#x2264; K &#x2264; 30), and K difference prime numbers follow. It&#x2019;s guaranteed that all the preference number can be represented by the product of some of this K numbers(a number can appear multiple times).<br>The third line consists of n integer numbers, the ith number indicating the preference value P<sub>i</sub>(0 &#x2264; P<sub>i</sub> &#x2264; 10<sup>15</sup>) of the i-th province.<br>Then n - 1 lines follow. Each line consists of two integers x, y, indicating there is a road connecting province x and province y.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a number indicating the number of routes that satisfy the requirement.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n3 2 3 5\n2500 200 9 270000 27\n4 2\n3 5\n2 5\n4 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Multi-University+Training+Contest+7&amp;source=1&amp;searchmode=source\"> 2013 Multi-University Training Contest 7 </a> ","type":"source","format":"html"}]}