{"title":"Weather","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4711","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4711&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4711","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4711"},"statement":[{"title":"Problem Description","content":"Hovey Chen is going to Azeroth! &quot;I have reached Darnassus.&quot; Hovey told Eliane Su, his girlfriend. Each day, Hovey called Eliane, and told her his feeling at Azeroth. &quot;It&apos;s a good day today. We are going to hunt some Goblin :)&quot; &quot;It&apos;s raining and raining. We can do nothing but sleeping :(&quot; <br>Several days later, Hovey was missing Eliane so much. So he came back to the Earth. He wants to write a travel note for his friends. However, he forgets where he had been! What&apos;s worse, he never told Eliane he route. Luckily, he told Eliane the weather in his everyday report, and Eliane wrote it down on her notebook. Hovey knows the probability he went from one place to another. Given the probability from Darnassus to Booty Bay be p, it means that if Hovey is at Darnassus today, the chance he is going to Booty Bay tomorrow is p. Eliane knows the probability of given place to be in given weather. Now given the first place, and the two probability matrices, can you help Hovey to figure out the route which has the greatest probablity.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line is an integer T&#xFF0C; the number of test cases.<br>In each test cases, the first is three positive integers n, m, w (1 &#x2264; n &#x2264; 1000, 1 &#x2264; m, w &#x2264; 100). Hovey has stayed in Azeroth for n + 1 days. Days are labeled from 0 to n. The number of places in Azeroth is m. The number of weather conditions in Azeroth is w. Hovey was always at Darnassus in day 0, which is place 0.<br>Then n integers follow, each is in the range of [0, w - 1]. They are weather conditions from day 1 to n.<br>Then m lines follow, each containing m numbers. The jth number in the ith line is the probabilty from place i to place j. Places are numbered from 0.<br>Then m lines follow, each containing w numbers. The jth number in the ith line is the probabilty that place i is in weather condition j. Weather conditions are numbered from 0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test cases, output n intergers in the range of [0, m - 1] in a line, seperated by a single space, representing the route which has the greatest probability. If there is a tie, output the one with the least lexicographic order, e.g. 2 1 3 is less than 2 3 1.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 3 2\n1 1 0\n0.3 0.5 0.2\n0.1 0.2 0.7\n0.3 0.3 0.4\n0.6 0.4\n0.4 0.6\n0.3 0.7</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1 2 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Online+%A1%AA%A1%AA+Warmup&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Online &#x2014;&#x2014; Warmup </a> ","type":"source","format":"html","require":["katex"]}]}