{"title":"Zhuge Liang's Mines","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4739","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4739&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4739","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4739"},"statement":[{"title":"Problem Description","content":"In the ancient three kingdom period, Zhuge Liang was the most famous and smartest military leader. His enemy was Shima Yi,  who always looked stupid when fighting against Zhuge Liang. But it was Shima Yi who laughed to the end. <br><br>Once, Zhuge Liang sent the arrogant Ma Shu to defend Jie Ting, a very important fortress. Because Ma Shu is the son of Zhuge Liang&apos;s good friend Ma liang, even Liu Bei, the Ex. king, had warned Zhuge Liang that Ma Shu was always bragging and couldn&apos;t be used, Zhuge Liang wouldn&apos;t listen. Shima Yi defeated Ma Shu and took Jie Ting. Zhuge Liang had to kill Ma Shu and retreated. To avoid Shima Yi&apos;s chasing, Zhuge Liang put some mines on the only road. Zhuge Liang deployed the mines in a Bagua pattern which made the mines very hard to remove. If you try to remove a single mine, no matter what you do ,it will explode. Ma Shu&apos;s son betrayed Zhuge Liang , he found Shima Yi, and told Shima Yi the only way to remove the mines: If you remove four mines which form the four vertexes of a square at the same time, the removal will be success. In fact, Shima Yi was not stupid. He removed as many mines as possible. Can you figure out how many mines he removed at that time?<br><br>The mine field can be considered as a the Cartesian coordinate system. Every mine had its coordinates. To simplify the problem, please only consider the squares which are parallel to the coordinate axes. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are no more than 15 test cases.<br>In each test case:<br><br>The first line is an integer N, meaning that there are N mines( 0 &lt; N &lt;= 20 ).<br><br>Next N lines describes the coordinates of N mines. Each line contains two integers X and Y, meaning that there is a mine at position (X,Y). ( 0 &lt;= X,Y &lt;= 100)<br><br>The input ends with N = -1.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case ,print the maximum number of mines Shima Yi removed in a line.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 1\n0 0\n2 2\n8\n0 0\n1 0\n2 0\n0 1\n1 1\n2 1\n10 1\n10 0\n-1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html","require":["katex"]}]}