{"title":"The Donkey of Gui Zhou","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4740","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4740&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4740","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4740"},"statement":[{"title":"Problem Description","content":"There was no donkey in the province of Gui Zhou, China. A trouble maker shipped one and put it in the forest which could be considered as an N&#xFFFD;&#xFFFD;N grid. The coordinates of the up-left cell is (0,0) , the down-right cell is (N-1,N-1) and the cell below the up-left cell is (1,0)..... A 4&#xFFFD;&#xFFFD;4 grid is shown below:<br><center><img style=\"max-width:100%;\" src=\"../../data/images/C478-1003-1.jpg\"></center> <br>The donkey lived happily until it saw a tiger far away. The donkey had never seen a tiger ,and the tiger had never seen a donkey. Both of them were frightened and wanted to escape from each other. So they started running fast. Because they were scared, they were running in a way that didn&apos;t make any sense. Each step they moved to the next cell in their running direction, but they couldn&apos;t get out of the forest. And because they both wanted to go to new places, the donkey would never stepped into a cell which had already been visited by itself, and the tiger acted the same way. Both the donkey and the tiger ran in a random direction at the beginning and they always had the same speed. They would not change their directions until they couldn&apos;t run straight ahead any more. If they couldn&apos;t go ahead any more ,they changed their directions immediately. When changing direction, the donkey always turned right and the tiger always turned left. If they made a turn and still couldn&apos;t go ahead, they would stop running and stayed where they were, without trying to make another turn. Now given their starting positions and directions, please count whether they would meet in a cell. ","type":"description","format":"html"},{"title":"Input","content":"There are several test cases.<br><br>In each test case:<br>First line is an integer N, meaning that the forest is a N&#xFFFD;&#xFFFD;N grid.<br><br>The second line contains three integers R, C and D, meaning that the donkey is in the cell (R,C) when they started running, and it&apos;s original direction is D. D can be 0, 1, 2 or 3. 0 means east, 1 means south , 2 means west, and 3 means north.<br><br>The third line has the same format and meaning as the second line, but it is for the tiger.<br><br>The input ends with N = 0.  ( 2 &lt;= N &lt;= 1000, 0 &lt;= R, C &lt; N)","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, if the donkey and the tiger would meet in a cell, print the coordinate of the cell where they meet first time.  If they would never meet, print -1 instead.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0 0 0\n0 1 2\n4\n0 1 0\n3 2 0\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1\n1 3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html"}]}