{"title":"Pinball Game 3D","time_limit":5000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4742","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4742&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4742","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4742"},"statement":[{"title":"Problem Description","content":"RD is a smart boy and excel in pinball game. However, playing common 2D pinball game for a great number of times results in accumulating tedium. <br><br>Recently, RD has found a new type of pinball game, a 3D pinball game. The 3D pinball game space can be regarded as a three dimensional coordinate system containing N balls. A ball can be considered as a point. At the beginning, RD made a shot and hit a ball. The ball hit by RD will move and may hit another ball and the &#x201C;another ball&#x201D; may move and hit another another ball, etc. But once a ball hit another ball, it will disappear.<br><br>RD is skilled in this kind of game, so he is able to control every ball&apos;s moving direction. But there is a limitation: if ball A&apos;s coordinate is (x1,y1,z1) and ball B&apos;s coordinate is (x2,y2,z2), then A can hit B only if x1 &lt;= x2 and y1 &lt;= y2 and z1 &lt;= z2.<br> <br>Now, you should help RD to calculate the maximum number of balls that can be hit and the number of different shooting schemes that can achieve that number. Two schemes are different if the sets of hit balls are not the same. The order doesn&apos;t matter.","type":"description","format":"html"},{"title":"Input","content":"The first line contains one integer T indicating the number of cases.<br>In each case, the first line contains one integer N indicating the number of balls. <br>The next N lines each contains three non-negative integer (x, y, z), indicating the coordinate of a ball. <br>The data satisfies T &lt;= 3, N &lt;= 10<sup>5</sup>, 0 &lt;= x, y, z &lt;= 2<sup>30</sup>, no two balls have the same coordinate in one case.","type":"input_format","format":"html"},{"title":"Output","content":"Print two integers for each case in a line, indicating the maximum number of balls that can be hit and the number of different shooting schemes. As the number of schemes can be quite large, you should output this number mod 2<sup>30</sup>. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n2 0 0\n0 1 0\n0 1 1\n5\n3 0 0\n0 1 0\n0 0 1\n0 2 2\n3 3 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1\n3 2\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first case, RD can shoot the second ball at first and hit the third ball indirectly.\nIn the second case, RD can shoot the second or the third ball initially and hit the fourth ball as well as the fifth ball. Two schemes are both the best.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Hangzhou+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Hangzhou Online </a> ","type":"source","format":"html"}]}