{"title":"Divide Groups","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4751","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4751&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4751","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4751"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../data/images/C479-1004-1.jpg\"></center> <br>&#xA0;&#xA0;This year is the 60th anniversary of NJUST, and to make the celebration more colorful, Tom200 is going to invite distinguished alumnus back to visit and take photos.<br>&#xA0;&#xA0;After carefully planning, Tom200 announced his activity plan, one that contains two characters:<br>&#xA0;&#xA0;1. Whether the effect of the event are good or bad has nothing to do with the number of people join in.<br>&#xA0;&#xA0;<b>2. The more people joining in one activity know each other, the more interesting the activity will be. Therefore, the best state is that, everyone knows each other.</b><br>&#xA0;&#xA0;The event appeals to a great number of alumnus, and Tom200 finds that they may not know each other or may just unilaterally recognize others. To improve the activities effects, Tom200 has to divide all those who signed up into groups to take part in the activity at different time. As we know, one&apos;s energy is limited, and Tom200 can hold activity twice. Tom200 already knows the relationship of each two person, but he cannot divide them because the number is too large.<br>&#xA0;&#xA0;Now Tom200 turns to you for help. Given the information, can you tell if it is possible to complete the dividing mission to make the two activity in best state. ","type":"description","format":"html"},{"title":"Input","content":"&#xA0;&#xA0;The input contains several test cases, terminated by EOF.<br>&#xA0;&#xA0;Each case starts with a positive integer n (2&lt;=n&lt;=100), which means the number of people joining in the event.<br>&#xA0;&#xA0;N lines follow. The i-th line contains some integers which are the id<br>of students that the i-th student knows, terminated by 0. And the id starts from 1.","type":"input_format","format":"html"},{"title":"Output","content":"&#xA0;&#xA0;If divided successfully, please output &quot;YES&quot; in a line, else output &quot;NO&quot;.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3 0\n1 0\n1 2 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">YES</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Nanjing+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Nanjing Online </a> ","type":"source","format":"html"}]}