{"title":"Heroes of Might and Magic","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4755","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4755&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4755","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4755"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../data/images/C479-1008-1.jpg\"></center> <br>&#xA0;&#xA0;&#x300A;Heroes of Might and Magic III: The Restoration of Erathia&#x300B; is one of the most classic SLG game in recent years. Its powerful strategies and tactics to attract the players is enduring. Everyone controls his own combat arms to battle. Decide the outcome of a battle, in addition to a hero&apos;s magic, level, character action good or bad, the layout of soldiers to walk, the most important thing is one&apos;s own quantity and quality of all kinds of arms.<br>&#xA0;&#xA0;Jerry404 likes this game so much and later, in order to improve efficiency, his favorite is the automatic battle function inside.<br>&#xA0;&#xA0;Tom200 knows that and wonders what algorithm the system is through to calculate its automatically fight.<br>&#xA0;&#xA0;After a long time of YY, Tom200 finally speculated the automatic fighting rules:<br><br>1. Each hero can take up to seven arms, and the hero&apos;s attack power, defense power bonus to each of the upper arms. For example, the hero&apos;s attack power and defense power are respectively Ha and Hd, and the arms&apos; original attack power and defense power are Aa and Ad. After addition, Aa = Aa+Ha , Ad =Ad+Hd, and Aa is greater than 0.<br><br>2. Hero&apos;s magic value equals its intelligence number * 10.<br>  Hero&apos;s magic injury equals its strength number * 50.<br>  Heroes&#x2019; single cast magic consumption is fixed at 12, during the battle the hero cannot be attacked.<br>3. Each arms have five attributes: attack power, defense power, the value of life, the number of units and attack speed. Assume that A arms attack B arms, A arms of the attribute were Aa, Ad, Ab, Am, As and correspondingly B arms&apos; five attributes were Ba, Bd, Bb, Bm, Bs. Therefore, the total injury of A arms equals Am*Aa. At that time, B arms will bear that hurt unit by unit: <br> if Am*Aa is not greater than Bd, then one unit of B arms will deduct one value of life;<br> if Am*Aa is greater than Bd, then the excess part of the attack force will be considered as the deduction of current unit&apos;s value of life of B arms;<br> if one unit&apos;s current life of value cannot afford, then it dies and we will take the remainder of the attack force into the next unit settlement. Also at this time, you should calculate if attack power is greater than defense power. <br> if all units of the current arms are dead, injury will no longer be calculated.<br>For example, assume Aa = 5&#xFF0C;Am = 2&#xFF0C;Bd = 3&#xFF0C;Bb = 4&#xFF0C;Bm = 2, and A&apos;s total injury is 10, greater than Bd by 7, and Bb is 4 which cannot afford. Then one unit dies and the left attack power is 3, not greater than Bd, so the second unit deduct one value of life. Finally, the end result is that B arms left 1 unit whose life is 3.<br><br>4. For brevity, the arms in left and right attack each other in turn every round (the arms in the left attacks first. Hero A is always on the left, B right, each round can only attack once per arms, if the current round of a party has no arms to attack, then the side bye). Attack speed determines the arms of the side order of attack and the arms appear first move first in case of the same attack speed. Heroes always turn to attack at the beginning of each round and its attack effects can be calculated in the same way as (3) describes. In every round, the hero cannot attack if it has no magic value and in this case it is seen as an attack without injury. A single round ends when heroes and arms of both sides attacked. The fourth rule can also look at the following schematic attack per round&#xFF1A;<br> A hero magic attack -&gt; B hero magic attack -&gt; A fastest attack speed arms that are alive -&gt; B fastest attack speed arms that are alive -&gt; A second fastest attack speed arms that are alive -&gt; B fastest attack speed arms that are alive...<br><br> 5. Assuming that each arms&apos; attack range if full screen and can be attacked by every other arms. <br><br> 6. The hero can equip treatment tent, which can get back 20 points of life value in each round. The treatment tent will choose the arms in which an individual unit has the maximum difference between remaining life value and original life value. In case of the same maximum difference, the tent will choose the arms that appear first (The amount of one unit&apos;s life value will not exceed its original value and the tent cannot bring back those who are already dead.)<br><br> 7. Every round all the arms (including the hero) will attack the enemy arms which has the most number of units. In case of the same number, it will attack the arms that appear first.<br><br><br> 8. Every round each arms will have a chance of counter attack and it will counter attack immediately if it is able to. (If attacked by a hero, it cannot counter attack.)<br><br>9. A round ends after all the arms&apos; movement.<br><br>10. All the numbers are integers and the single number value is no greater than 100 and no less than 0. Calculations are integer calculations (rounded down is all right.)<br><br>11. The game comes to end when every single unit of all the arms on one side are dead.<br><br>Tom200 wants you to tell the final ending according to these crazy rules.<br>","type":"description","format":"html"},{"title":"Input","content":"&#xA0;&#xA0;The first line contains a number T denoting the number of the test cases.<br>&#xA0;&#xA0;The fisrt line of each case are six integers Aa,Ad,Ae,As,An(1&lt;=An&lt;=7),Azp, indicating one&apos;s own hero&apos;s attack power, defense power, intelligence, strength, the number of arms the hero takes. If Azp=1 ,it means there is a treatment tent; else if Azp=0, there is no tent.<br>&#xA0;&#xA0;Five lines follow and each line contains An integers , respectively indicating An arms&apos; attack power, defense power, the value of life, the number of units and attack speed.<br>&#xA0;&#xA0;The next line is the corresponding data of the enemy hero :Ba,Bd,Be,Bs,Bn,Bzp.<br>&#xA0;&#xA0;Five lines follow and each line contains Bn integers , respectively indicating Bn arms&apos; attack power, defense power, the value of life, the number of units and attack speed.<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#xA0;&#xA0;If one&apos;s own side (A hero) wins, output &quot;Win!&quot; in a line, else output &quot;Lose!&quot;.<br>&#xA0;&#xA0;The next two lines output the number of dead units of each arms in order of arms appearance.<br>&#xA0;&#xA0;We ensure that one side&apos;s arms will all die, in other words endless draw does not exist.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n1 1 4 3 5 1\n5 4 3 2 1\n3 2 1 0 0\n4 3 2 2 1\n2 3 4 5 6\n5 3 2 1 1\n2 1 2 1 4 0\n3 3 2 4\n4 3 5 2\n2 1 1 2\n4 3 2 1\n3 2 4 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Win!\n0 0 0 2 6\n4 3 2 1</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Nanjing+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Nanjing Online </a> ","type":"source","format":"html"}]}