{"title":"Good Firewall","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4760","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4760&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4760","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4760"},"statement":[{"title":"Problem Description","content":"Professor X is an expert in network security. These days, X is planning to build a powerful network firewall, which is called Good Firewall (a.k.a., GFW). Network flows enter in the GFW will be forwarded or dropped according to pre-established forwarding policies.<br><br>Basically, a forwarding policy P is a list of IP subnets, {ip_subnet_1, &#x2026;, ip_subnet_n}. If P is enabled in GFW, a network flow F with source and destination IP address both located in P can be accepted and forwarded by GFW, otherwise F will be dropped by GFW.<br><br>You may know that, an IP address is a 32-bit identifier in the Internet, and can be written as four 0~255 decimals. For example, IP address <b>01111011.00101101.00000110.01001110</b> can be expressed as <b>123.45.6.78</b>. An IP subnet is a block of adjacent IP address with the same binary prefix, and can be written as the first IP address in its address block together with the length of common bit prefix. For example, IP subnet <b>01111011.00101101.00000100.00000000/22 (123.45.4.0/22)</b> is an IP subnet containing 1024 IP addresses, starting from 123.45.4.0 to 123.45.7.255. If an IP address is in the range of an IP subnet, we say that the IP address is located in the IP subnet. And if an IP address is located in any IP subnet(s) in a policy P, we say that the IP address is located in the policy P.<br><br>How will you design the GFW, if you take charge of the plan?<br>","type":"description","format":"html"},{"title":"Input","content":"The input file contains no more than 32768 lines. Each line is in one of the following three formats:<br><br>  <i>E id n ip_subnet_1 ip_subnet_2 &#x2026; ip_subnet_n<br>  D id<br>  F ip_src ip_dst</i><br><br>The first line means that a network policy P<sub>id</sub> (1&lt;=id&lt;=1024) is enabled in GFW, and there are n (1&lt;=n &lt;=15) IP subnets in P<sub>id</sub>. The second line means that policy P<sub>id</sub> (which is already enabled at least once) is disabled in GFW. The last line means that a network flow with source and destination IP address is entered in GFW, and you need to figure out whether GFW is going to forward (F) or drop (D) this flow:<br><br>1. If the source and destination IP address both are located in one of enabled policy group P<sub>id</sub>, GFW will forward this flow.<br><br>2. Otherwise GFW will drop this flow. That is, if the source or destination IP address is not located in any of enabled policy group, or they are only located in different enabled policy group(s), GFW will drop it.<br><br>IP subnets can be overlapped. An IP address may or may not be located in any policy group, and can also be located in multiple policy groups.<br><br>In the global routing table, most of the IP subnets have at least 2^8 IP addresses, and at most 2^24 IP addresses. In our dataset, every IP subnet has a prefix length between 8 and 24.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each &#x2018;F&#x2019; operation, output a single &#x2018;F&#x2019; (forward) or &#x2018;D&#x2019; (drop) in a single line. Just see the sample output for more detail.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">E 1 2 123.45.4.0/22 123.45.8.0/22\nF 123.45.4.1 123.45.8.1\nF 123.45.8.1 123.45.4.1\nE 2 1 123.45.6.0/24\nD 1\nF 123.45.6.123 123.45.6.234\nF 123.45.8.1 123.45.4.1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">F\nF\nF\nD</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Changchun+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Changchun Online </a> ","type":"source","format":"html"}]}