{"title":"Network","time_limit":4000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4766","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4766&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4766","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4766"},"statement":[{"title":"Problem Description","content":"With the help of the Ares L, the Emperor of Law and some stars of the future, General M succeeded in setting foot on the mountain, and had set up a kingdom, known as ACMSYSU. In order to reward these founding heroes, General M decided to share her network.<br>General M has manufactured a router. One can use this network if the Euclidean distance between his/her house and the router is not greater than d. Because of General M&apos;s excellent technology, the distance between her house and the router can be infinite.<br>There are n heroes in the kingdom besides General M. General M is not an eccentric person, so she hopes everyone can use the network. Because the farther the router is away from her house, the worse the signal, General M wants the router being as close to her house as possible. Please help General M place the router so that the distance between her house and the router is minimized, and every one can use the router. You just need to tell General M the minimum distance.<br>","type":"description","format":"html"},{"title":"Input","content":"The input will consist of multiple test cases. <br>For each case, the first line contains 3 integers x, y and d, which represent that the General M&apos;s house locates at the point (x, y) and one can use the network if his/her distance to the router is not greater than d.<br>The second line is a positive integer n, the number of heroes of the kingdom.<br>Then n lines follow. Each line has 2 integers x_i and y_i, indicating that the i-th hero locates at point (x_i, y_i)&#x3002;<br><br>All integers in the input satisfy that their absolute values are less than or equal to 10^5, and 1&lt;=n&lt;=10^3.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output a real number which indicates the minimum distance between the General M&apos;s house and the router, to two decimal places.<br>If it is impossible to share a network which can cover everyone, output an &apos;X&apos; (without the single quote).<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0 0 5\n2\n5 3\n5 -3\n0 0 1\n2\n5 3\n5 -3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1.00\nX</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+ACM%2FICPC+Asia+Regional+Changchun+Online&amp;source=1&amp;searchmode=source\"> 2013 ACM/ICPC Asia Regional Changchun Online </a> ","type":"source","format":"html"}]}