{"title":"Stealing Harry Potter's Precious","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4771","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4771&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4771","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4771"},"statement":[{"title":"Problem Description","content":"&#x3000;&#x3000;Harry Potter has some precious. For example, his invisible robe, his wand and his owl. When Hogwarts school is in holiday, Harry Potter has to go back to uncle Vernon&apos;s home. But he can&apos;t bring his precious with him. As you know, uncle Vernon never allows such magic things in his house. So Harry has to deposit his precious in the Gringotts Wizarding Bank which is owned by some goblins. The bank can be considered as a N &#xD7; M grid consisting of N &#xD7; M rooms. Each room has a coordinate. The coordinates of the upper-left room is (1,1) , the down-right room is (N,M) and the room below the upper-left room is (2,1)..... A 3&#xD7;4 bank grid is shown below:<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C486-1002-1.jpg\"></center> <br><br>&#x3000;&#x3000;Some rooms are indestructible and some rooms are vulnerable. Goblins always care more about their own safety than their customers&apos; properties, so they live in the indestructible rooms and put customers&apos; properties in vulnerable rooms. Harry Potter&apos;s precious are also put in some vulnerable rooms. Dudely wants to steal Harry&apos;s things this holiday. He gets the most advanced drilling machine from his father, uncle Vernon, and drills into the bank. But he can only pass though the vulnerable rooms. He can&apos;t access the indestructible rooms. He starts from a certain vulnerable room, and then moves in four directions: north, east, south and west. Dudely knows where Harry&apos;s precious are. He wants to collect all Harry&apos;s precious by as less steps as possible. Moving from one room to another adjacent room is called a &apos;step&apos;. Dudely doesn&apos;t want to get out of the bank before he collects all Harry&apos;s things. Dudely is stupid.He pay you $1,000,000 to figure out at least how many steps he must take to get all Harry&apos;s precious.","type":"description","format":"html"},{"title":"Input","content":"&#x3000;&#x3000;There are several test cases.<br>&#x3000;&#x3000;In each test cases:<br>&#x3000;&#x3000;The first line are two integers N and M, meaning that the bank is a N &#xD7; M grid(0&lt;N,M &lt;= 100).<br>&#x3000;&#x3000;Then a N&#xD7;M matrix follows. Each element is a letter standing for a room. &apos;#&apos; means a indestructible room, &apos;.&apos; means a vulnerable room, and the only &apos;@&apos; means the vulnerable room from which Dudely starts to move.<br>&#x3000;&#x3000;The next line is an integer K ( 0 &lt; K &lt;= 4), indicating there are K Harry Potter&apos;s precious in the bank.<br>&#x3000;&#x3000;In next K lines, each line describes the position of a Harry Potter&apos;s precious by two integers X and Y, meaning that there is a precious in room (X,Y).<br>&#x3000;&#x3000;The input ends with N = 0 and M = 0<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#x3000;&#x3000;For each test case, print the minimum number of steps Dudely must take. If Dudely can&apos;t get all Harry&apos;s things, print -1.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 3\n##@\n#.#\n1\n2 2\n4 4\n#@##\n....\n####\n....\n2\n2 1\n2 4\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1\n5</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html"}]}