{"title":"Zhuge Liang's Password","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4772","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4772&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4772","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4772"},"statement":[{"title":"Problem Description","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;In the ancient three kingdom period, Zhuge Liang was the most famous and smart military leader. His enemy was Sima Yi, the military leader of Kingdom Wei. Sima Yi always looked stupid when fighting against Zhuge Liang. But it was Sima Yi who laughed to the end. <br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Zhuge Liang had led his army across the mountain Qi to attack Kingdom Wei for six times, which all failed. Because of the long journey, the food supply was a big problem. Zhuge Liang invented a kind of bull-like or horse-like robot called &quot;Wooden Bull &amp; Floating Horse&quot;(in abbreviation, WBFH) to carry food for the army. Every WBFH had a password lock. A WBFH would move if and only if the soldier entered the password. Zhuge Liang was always worrying about everything and always did trivial things by himself. Since Ma Su lost Jieting and was killed by him, he didn&apos;t trust anyone&apos;s IQ any more. He thought the soldiers might forget the password of WBFHs. So he made two password cards for each WBFH. If the soldier operating a WBFH forgot the password or got killed, the password still could be regained by those two password cards.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Once, Sima Yi defeated Zhuge Liang again, and got many WBFHs in the battle field. But he didn&apos;t know the passwords. Ma Su&apos;s son betrayed Zhuge Liang and came to Sima Yi. He told Sima Yi the way to figure out the password by two cards.He said to Sima Yi: <br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&quot;A password card is a square grid consisting of N&#xFFFD;&#xFFFD;N cells.In each cell,there is a number. Two password cards are of the same size. If you overlap them, you get two numbers in each cell. Those two numbers in a cell may be the same or not the same. You can turn a card by 0 degree, 90 degrees, 180 degrees, or 270 degrees, and then overlap it on another. But flipping is not allowed. The maximum amount of cells which contains two equal numbers after overlapping, is the password. Please note that the two cards must be totally overlapped. You can&apos;t only overlap a part of them.&quot;<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Now you should find a way to figure out the password for each WBFH as quickly as possible.","type":"description","format":"html"},{"title":"Input","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;There are several test cases.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;In each test case:<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The first line contains a integer N, meaning that the password card is a N&#xFFFD;&#xFFFD;N grid(0&lt;N&lt;=30).<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Then a N&#xFFFD;&#xFFFD;N matrix follows ,describing a password card. Each element is an integer in a cell. <br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Then another N&#xFFFD;&#xFFFD;N matrix follows, describing another password card. <br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Those integers are all no less than 0 and less than 300.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The input ends with N = 0","type":"input_format","format":"html"},{"title":"Output","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, print the password.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 2\n3 4\n5 6\n7 8\n2\n10 20\n30 13\n90 10\n13 21\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html"}]}