{"title":"Random Number Generator","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4774","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4774&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4774","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4774"},"statement":[{"title":"Problem Description","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;A random number generator (RNG) is a computational or physical device designed to generate a sequence of numbers or symbols that lack any pattern, i.e. appear random. Many of these have existed since ancient time, including dices, coin flipping, the shuffling of playing cards, and many other techniques. These methods depend on the measurement of some physical phenomenon which is expected to be random, and are still widely used today. On the other hand, deterministic computational algorithms were introduced into random number generation. Despite such algorithms&apos; ability to produce apparently random results, they are in fact determined by a shorter initial value, known as a seed or key. These algorithms are often called pseudorandom number generators. They can also be called RNG customarily, but actually differ with real RNG significantly. <br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Now considering a simple RNG, whose algorithm has two positive integer parameters A, B and a prime parameter M (2 &#xFFFD;&#xFFFD; A, B &lt; M &#xFFFD;&#xFFFD; 10<sup>18</sup>). To run the algorithm, a seed X0 (0 &#xFFFD;&#xFFFD; X<sub>0</sub> &lt; M) is required, and the algorithm produces a integer sequence Xn satisfying the condition X<sub>n</sub> = (A &#xFFFD;&#xFFFD; X<sub>n - 1</sub> + B) mod M for any positive integer n.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;An application implemented this algorithm. This application has another two parameters S (S &#xFFFD;&#xFFFD; M) and K (K &#xFFFD;&#xFFFD; 10<sup>5</sup>), and will use this RNG in such a way. Firstly, the application generates the first K integers in the random sequence including the seed, and these numbers modulo S are stored in another number sequence D, i.e. D<sub>i</sub> = X<sub>i</sub> mod S for any integer i in [0, K - 1]. Then, another random integer X<sub>K</sub> is produced, and the application chooses the ((X<sub>K</sub> mod K) + 1)-th number in sequence D, i.e. D<sub>Xk mod K</sub> as its output C. If an output C (0 &#xFFFD;&#xFFFD; C &lt; S) is observed in a certain run, and parameters A, B, M, S, K is known, your task is determining a possible X0 which leads to the output C.","type":"description","format":"html"},{"title":"Input","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;There are at most 200 test cases. Each test case is a single line containing six integers, A, B, M, S, K and C, seperated by space. The meaning of these numbers are described above.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The input is ended by 0 0 0 0 0 0<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;You should output an integer for each test case, indicating a possible X<sub>0</sub>. If there is no solution, print &quot;impossible&quot; instead. This problem is special judged.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2 97 5 3 2\n2 2 97 5 3 3\n0 0 0 0 0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n8</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html"}]}