{"title":"Infinite Go","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4775","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4775&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4775","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4775"},"statement":[{"title":"Problem Description","content":"&#x3000;&#x3000;Go is a proverbial board game originated in China. It has been proved to be the most difficult board game in the world. &#x201C;The rules of Go are so elegant, organic, and rigorously logical that if intelligent life forms exist elsewhere in the universe, they almost certainly play Go.&#x201D; said Emanuel Lasker, a famous chess master.<br>&#x3000;&#x3000;A Go board consists of 19 horizontal lines and 19 vertical lines. So there are 361 cross points. At the beginning, all cross points are vacant.<br>&#x3000;&#x3000;Go is played by two players. The basic rules are:<br>&#x3000;&#x3000;1. One player owns black stones and the other owns white stones.<br>&#x3000;&#x3000;2. Players place one of his stones on any vacant cross points of the board alternately. The player owns black stones moves first.<br>&#x3000;&#x3000;3. Vertically and horizontally adjacent stones of the same color form a chain.<br>&#x3000;&#x3000;4. The number of vacant points adjacent (vertically or horizontally) to a chain is called the liberty of this chain. Once the chain has no liberty, it will be captured and removed from the board.<br>&#x3000;&#x3000;5. While a player place a new stone such that its chain immediately has no liberty, this chain will be captured at once unless this action will also capture one or more enemy&#x2019;s chains. In that case, the enemy&#x2019;s chains are captured, and this chain is not captured.<br>&#x3000;&#x3000;<br>&#x3000;&#x3000;In effect, Go also has many advanced and complex rules. However, we only use these basic rules mentioned above in this problem.<br>&#x3000;&#x3000;Now we are going to deal with another game which is quite similar to Go. We call it &#x201C;Infinite Go&#x201D;. The only difference is that the size of the board is no longer 19 times 19 -- it becomes infinite. The rows are numbered 1, 2, 3, ..., from top to down, and columns are numbered 1, 2, 3, ..., from left to right. Notice that the board has neither row 0 nor column 0, which means even though the board is infinite, it has boundaries on the top and on the left.<br>&#x3000;&#x3000;In this problem, we are solving the problem that, given the actions of two players in a set of Infinite Go, find out the number of remaining stones of each player on the final board.","type":"description","format":"html"},{"title":"Input","content":"&#x3000;&#x3000;The input begins with a line containing an integer T (1 &lt;= T &lt;= 20), the number of test cases.<br>&#x3000;&#x3000;For each test case, the first line contains a single integer N (1 &lt;= N &lt;= 10000), the number of stones placed during this set. Then follows N lines, the i-th line contains two integer X and Y (1 &lt;= X, Y &lt;= 2,000,000,000), indicates that the i-th stone was put on row X and column Y (i starts from 1). The stones are given in chronological order, and it is obvious that odd-numbered stones are black and even-numbered ones are white.<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#x3000;&#x3000;For each test case, output two integers Nb and Nw in one line, separated by a single space. Nb is the number of black stones left on the board, while Nw is the number of white stones left on the board.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n7\n5 5\n4 5\n3 5\n3 4\n4 4\n3 3\n4 6</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html"}]}