{"title":"Tower Defense","time_limit":2000,"memory_limit":129.65625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4779","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4779&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4779","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4779"},"statement":[{"title":"Problem Description","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;DRD loves playing computer games, especially Tower Defense games. Tower Defense is a famous computer game with a number of variations. In general, you are to build some defense towers to guard your territory in this game. <br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;However, in most Tower Defense games, your defending towers will not attack each other. You will see the shells flying through your towers and finally hit the target on your screen. DRD thinks it to be absurd, and he designed a new tower defense game.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;In DRD&#xFFFD;&#xFFFD;s game, you have two kinds of defending tower, heavy tower and light tower. You can put the tower on a grid with N rows and M columns and each cell in the grid can hold one tower at most. Both two kinds of towers can attack the cells in the same column or the same row as it is located in, and your towers may attack each other. Moreover, light towers should not be attacked by other towers while heavy towers can be attacked by at most one other tower.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;You can put some of your towers (at least one tower) in the grid to build a tower formation satisfying the restriction above. And now, DRD wants you to calculate that how many different tower formations could be designed. Note that all the towers of the same type are considered to be identical. While the answer could be quite large, you should output the number mod (10<sup>9</sup> + 7).","type":"description","format":"html"},{"title":"Input","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;There are multiple test cases in the input. The first line of the input file is an integer T demonstrating the number of test cases. (0&lt; T&lt;= 200).<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, there is only one line containing 4 integers, N, M, P and Q ,meaning that the grid has N rows and M columns, and you have P heavy towers and Q light towers. You do not have to put all the towers in the grid. (1 &lt;= N, M &lt;= 200, 0 &lt;= P, Q &lt;= 200)<br>","type":"input_format","format":"html"},{"title":"Output","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, output the number of different formations mod (10<sup>9</sup> + 7) in a single line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 2 0 1\n2 2 2 0\n3 3 2 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n10\n144</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Hangzhou+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Hangzhou Regional Contest  </a> ","type":"source","format":"html"}]}