{"title":"Assignment For Princess","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4781","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4781&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4781","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4781"},"statement":[{"title":"Problem Description","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Long long ago, in the Kingdom Far Far Away, there lived many little animals. And you are the beloved princess who is marrying the prince of a rich neighboring kingdom. The prince, who turns out to be a handsome guy, offered you a golden engagement ring that can run computer programs!<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The wedding will be held next summer because your father, the king, wants you to finish your university first.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;But you did&#xFFFD;&#xFFFD;t even have a clue on your graduation project. Your terrible project was to construct a map for your kingdom. Your mother, the queen, wanted to make sure that you could graduate in time.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Or your wedding would have to be delayed to the next winter. So she told you how your ancestors built the kingdom which is called the Roads Principle:<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;1. Your kingdom consists of N castles and M directed roads.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;2. There is at most one road between a pair of castles.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;3. There won&#xFFFD;&#xFFFD;t be any roads that start at one castle and lead to the same one.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;She hoped those may be helpful to your project. Then you asked your cousin Coach Pang (Yes, he is your troubling cousin, he always asks you to solve all kinds of problems even you are a princess.), the Minister of Traffic, about the castles and roads. Your cousin, sadly, doesn&#xFFFD;&#xFFFD;t have a map of the kingdom. Though he said the technology isn&#xFFFD;&#xFFFD;t well developed and it depends on your generation to contribute to the map, he told you the Travelers Guide, the way travelers describe the amazing road system:<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;1. No matter which castle you start with, you can arrive at any other castles.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;2. Traveling on theM roads will take 1, 2, 3, ... ,M days respectively, no two roads need the same number of days.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;3. You can take a round trip starting at any castle, visiting a sequence of castles, perhaps visiting some castles or traveling on some roads more than once, and finish your journey where you started.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;4. The total amount of days spent on any round trip will be a multiple of three.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;But after a month, you still couldn&#xFFFD;&#xFFFD;t make any progress. So your brother, the future king, asked your university to assign you a simpler project. And here comes the new requirements. Construct a map that satisfies both the Roads Principle and the Travelers Guide when N and M is given.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;There would probably be several solutions, but your project would be accepted as long as it meets the two requirements.<br>Now the task is much easier, furthermore your fiance sent two assistants to help you.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Perhaps they could finish it within 5 hours and you can think of your sweet wedding now.","type":"description","format":"html"},{"title":"Input","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The first line contains only one integer T, which indicates the number of test cases.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, there is one line containing two integers N, M described above.(10 &lt;= N &lt;= 80, N+3 &lt;= M &lt;= N<sup>2</sup>/7 )","type":"input_format","format":"html"},{"title":"Output","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, first output a line &#xFFFD;&#xFFFD;Case #x:&#xFFFD;&#xFFFD;, where x is the case number (starting from 1).<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Then output M lines for each test case. Each line contains three integers A, B, C separated by single space, which denotes a road from castle A to castle B and the road takes C days traveling.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Oh, one more thing about your project, remember to tell your mighty assistants that if they are certain that no map meets the requirements, print one line containing one integer -1 instead.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Note that you should not print any trailing spaces.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n6 8</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n1 2 1\n2 3 2\n2 4 3\n3 4 4\n4 5 5\n5 6 7\n5 1 6\n6 1 8\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\n&#xFFFD;&#xFFFD;The restrictions like N &gt;= 10 will be too big for a sample. So the sample is just a simple case for the detailed formats of input and output,\n and it may be helpful for a better understanding. Anyway it won&#xFFFD;&#xFFFD;t appear in actual test cases.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Chengdu+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Chengdu Regional Contest  </a> ","type":"source","format":"html"}]}