{"title":"Dinner Coming Soon","time_limit":1000,"memory_limit":100,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4784","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4784&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4784","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4784"},"statement":[{"title":"Problem Description","content":"&#x3000;&#x3000;Coach Pang loves his boyfriend Uncle Yang very much. Today is Uncle Yang&#x2019;s birthday, Coach Pang wants to have a romantic candlelit dinner at Uncle Yang&#x2019;s house and he has to arrive there in T minutes.<br>&#x3000;&#x3000;There are N houses in their city numbered from 1 to N. Coach Pang lives in house 1 while Uncle Yang lives in house N. The houses are connected byM directed roads. It takes some time and usually a fee to pass one road. Coach Pang wants to reach Uncle Yang&#x2019;s house before the dinner starts with as much money as possible.<br>&#x3000;&#x3000;But the matter is not so simple. Coach Pang decides to do some salt trade on the way to Uncle Yang&#x2019;s house. The host of each house offers a price of a bag of salt, so Coach Pang can make a profit from the price differences. Each time when Coach Pang arrives at a house (except the house 1 and the house N). He can buy one bag of salt, sell one bag of salt or do nothing. Coach Pang can carry at most B bags of salt with him, and he carries no salt when he leaves his house. The trading is so efficient that the time cost of trading can be ignored.<br>&#x3000;&#x3000;However, the problem is more complicated than imagine. Coach Pang has a handheld device that can perform a journey around K parallel universes numbered from 0 to K-1. Coach Pang lives in the universe 0. When Coach Pang uses the device in universe i, he will be transported to the same place and the same time of universe (i+1) modK. The host of the house at the same place in different universe may offer a different price of salt. Luckily, the time cost and fee of the city roads are uniform among the K universes. The journey between universes costs no time but Coach Pang has to stand still watching the ads on the device for one minute every time before the device works. Remember, Coach Pang should never visit house 1 or house N in a universe other than universe 0, because the situation might become uncontrollable if he bumps into himself or his boyfriend in another universe.<br>&#x3000;&#x3000;The time is running out. Coach Pang asks you to tell him whether he can arrive at Uncle Yang&#x2019;s house in time, and how much money Coach Pang can have at most when the dinner starts. Coach Pang has R yuan at the start, and will end his journey immediately once he arrives at Uncle Yang&#x2019;s house. He must arrive at Uncle Yang&#x2019;s house in T minutes, and he can&#x2019;t have negative amount of money anywhere anytime. Please help him!","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"&#x3000;&#x3000;The first line of the input is an integer C representing the number of test cases.<br>&#x3000;&#x3000;For each test case, the first line will contain 6 integers N, M, B, K, R, T, as described above.<br>&#x3000;&#x3000;(2 &lt;= N &lt;= 100, 0 &lt;= M &lt;= 200, 1 &lt;= B &lt;= 4, 2 &lt;= K &lt;= 5, 0 &lt;= R &lt;= 10<sup>5</sup>, 0 &lt;= T &lt;= 200)<br>&#x3000;&#x3000;The following K lines contain N integers each, indicating the price p<sub>ij</sub> (0 &lt;= i &lt; K, 1 &lt;= j &lt;= N) for a bag of salt offered by the host of house j in the universe i. The price of house 1 and house N will be marked as -1.(1 &lt;= p<sub>ij</sub> &lt;= 100)<br>&#x3000;&#x3000;Then M lines follow, each contains 4 integers a, b, t and m, indicating that there is a road from house a to house b that costs t minutes of time and m yuan of money. (1 &lt;= a,b &lt;= N,  a&lt;&gt; b, 1 &lt;= t &lt;=15, 0 &lt;= m &lt;= 100)<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"&#x3000;&#x3000;For each test case, output one line containing &#x201C;Case #x: y&#x201D;, where x is the case number (starting from 1) and y is the most money Coach Pang can have if he can have dinner with Uncle Yang on time.<br>&#x3000;&#x3000;Print &quot;Forever Alone&quot; otherwise.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 2 1 2 10 6\n-1 1 -1\n-1 5 -1\n1 2 1 0\n2 3 1 1\n2 2 1 2 5 5\n-1 -1\n-1 -1\n1 2 10 2\n1 2 2 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 17\nCase #2: Forever Alone</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Chengdu+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Chengdu Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}