{"title":"Exhausted Robot","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4785","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4785&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4785","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4785"},"statement":[{"title":"Problem Description","content":"&#x3000;&#x3000;You want a tidy palace but you are too lazy to do the cleaning. As a result, your cousin Coach Pang gave you a cleaning robot. Unfortunately, the robot has some flaws and some furniture may hamper the cleaning.<br>&#x3000;&#x3000;To simplify the problem, we consider all objects in a 2D-Plane. The room is viewed as a rectangle with edges parallel to the axis. Both robot and furniture are in shape of convex polygons.<br>&#x3000;&#x3000;During the cleaning, the robot can move towards any direction (but only translation are permitted which means it cannot rotate). Although the robot has the ability to move through furniture, it can only do cleaning when it has no area outside the room or intersect with furniture. Besides, only one point can do the cleaning which is given as the first vertex of the robot in the input.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"&#x3000;&#x3000;The first line of the input contains an integer T indicates the number of test cases.<br>&#x3000;&#x3000;In the first line of each test case, there will be an integer n (0 &lt;= n &lt;= 20) and then (n + 1) blocks of data describing the objects. The first n blocks for furniture and the last one for the robot. All the vertices of an object are shown in corresponding block with counter-clockwise order. The first line of each block contains an integer m (3 &lt;= m &lt;= 20). Then m lines follow. In each line, there are two integers x<sub>i</sub>, y<sub>i</sub> indicating a vertex of the convex polygon.<br>&#xE049;At the end of each set of data, there will be four integers in a line, x<sub>BL</sub>, y<sub>BL</sub>, x<sub>TR</sub>, y<sub>TR</sub>, indicates the coordinates of the bottom left corner and the top right corner of your room.<br>&#xE049;The absolute value of all coordinates are within 10<sup>3</sup>.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"&#x3000;&#x3000;For each test case, output one line &#x201C;Case #x: y&#x201D;, where x is the case number (starting from 1) and y is size of the area that robot can clean, rounded to 3 digits after decimal point.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1\n4\n3 3\n4 3\n4 4\n3 4\n4\n1 1\n2 1\n2 2\n1 2\n0 0 10 10\n0\n4\n1 1\n2 1\n2 2\n1 2\n0 0 10 10</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 77.000\nCase #2: 81.000</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Chengdu+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Chengdu Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}