{"title":"ICPC Ranking","time_limit":10000,"memory_limit":129.65625,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4789","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4789&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4789","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4789"},"statement":[{"title":"Problem Description","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;There are so many submissions during this contest. Coach Pang can not determine which team is the winner. Could you help him to print the score board?<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;As we all know, the contest executes by the teams submit codes for some problems. Simply, we assume there are three kinds of results for every submission.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>ERROR</b> There was something wrong. The team didn&#xFFFD;&#xFFFD;t solve the problem but won&#xFFFD;&#xFFFD;t get any penalty.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>NO</b> Sorry, the code was not right. The team didn&#xFFFD;&#xFFFD;t solve the problem.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>YES</b> Yeah, AC. The team solved the problem.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;To make the contest more exciting, we set a time called frozen time. If one team doesn&#xFFFD;&#xFFFD;t solve one of the problems before the frozen time and submits at least one submission on this problem after or exactly at the frozen time, this problem of this team is called frozen. For different team, the frozen problems will be different. For the frozen problems, the score board will only show how many submissions the team has been submitted but won&#xFFFD;&#xFFFD;t show the result of the submissions.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The rank is determined by the following factors. Remember, we only consider the unfrozen problems. The frozen problems will be ignored. The following factors are ordered with the priority from high to low.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>Solved</b> the team who solves more problems will place higher.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>Penalty</b> the team who gets less penalty time will place higher. Only solved problems will give penalty time. Every solved problem will give T + 20X penalty time. T is the time of the first YES, X is the number of NOs before the first YES.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>Last Solved</b> the team who solved their last problem earlier will place higher. If there is a tie, we compare their second last problems, then their third last problems, etc.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>Name</b> The team whose name comes later in lexicographical order will place higher.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;At the end of the contest, the score board will be unfrozen. First, choose the team which has frozen problems with the lowest rank. Then choose one frozen problem of this team. If the team has multiple frozen problems, choose their first frozen problem in alphabetic order. Then show the result of the problem, recalculate the rank, change the score board and make the problem unfrozen for this team. Repeat this procedure until no teams have frozen problems. Then we get the final score board.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Please help Coach Pang to print the initial score board, the final score board and the process of the unfreeze procedure.<br>","type":"description","format":"html"},{"title":"Input","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The first line contains an integer C, which indicates the number of test cases.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, the first line will have four integers n, m, T and t. n(1 &lt;= n &lt;= 50000) is the number of submissions. m(1 &lt;= m &lt;= 26) is the number of problems. T(1 &lt;= T &lt;= 10000) is the total time of the contest. t(0 &lt;= t &lt;= T) is the frozen time.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;The following n lines, each line will be in the form &quot;Name Problem Time Result&quot;. Name is the team&#xFFFD;&#xFFFD;s name which only contains letters and digits with at most 20 characters. Problem is the identifier of the problem which is a capital letter from A to them-th letter. Time is a integer indicates the submission time which greater than or equal to 0 and less than T. Result is one string which equal YES, NO or ERROR.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Every team will have at least one submission. If one team has multiple submissions at the same time, we consider the ERRORs come before NOs and NOs come before YESs.","type":"input_format","format":"html"},{"title":"Output","content":"&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;For each test case, first print &#xFFFD;&#xFFFD;Case #x:&#xFFFD;&#xFFFD;, x is the case number start from 1.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Then print the initial score board (before the unfreeze procedure) ordered by the rank. For every team, print &quot;Name Rank Solved Penalty A B C ...&quot;. Name is the team&#xFFFD;&#xFFFD;s name. Rank is the team&#xFFFD;&#xFFFD;s rank. Solved is the number of solved problems. Penalty is the team&#xFFFD;&#xFFFD;s penalty time.<br>A B C ... is the condition of every problem is the format below:<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>+x</b> The problem is unfrozen and solved. x is the number of NOs before the first YES. If x = 0, print &quot;+&quot; instead of &quot;+0&quot;.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>-x</b> The problem is unfrozen but not solved. x is the number of NOs. If x = 0, print &quot;.&quot; instead of &quot;-0&quot;.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;<b>-x/y</b> The problem is frozen. x is the number of NOs before the frozen time. y is the number of submissions a&#xFFFD;&#xFFFD;er or exact at the frozen time. If x = 0, print &quot;0/y&quot; instead of &quot;-0/y&quot;.<br><br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;After the initial score board, print the process of the unfreeze procedure. During the unfreeze procedure, every time one team unfreezes one frozen problem and causes the change of its rank, print &quot;Name1 Name2 Solved Penalty&quot;. Suppose this team is team A. Name1 is the name of team A. Name2 is the name of the team which is overtaken by team A with the highest rank. Solved is the new number of the solved problems of team A. Penalty is the new penalty time of team A.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;Finally print the final score board (after the unfreeze procedure) as the same format as the initial score board.<br>&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;See the sample to get more details.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n20 12 300 240\nEpic B 12 YES\nEpic A 14 NO\nRivercrab E 25 YES\nTwo2erII B 100 NO\nEpic A 120 YES\nRivercrab I 150 NO\nTwo2erII C 160 NO\nEpic C 180 YES\nTwo2erII C 180 NO\nRivercrab F 226 YES\nTwo2erII C 230 YES\nTwo2erII L 241 YES\nEpic F 246 YES\nEpic G 260 YES\nRivercrab I 289 YES\nEpic D 297 YES\nMusou H 299 YES\nMusou I 299 YES\nMusou J 299 YES\nMusou K 299 YES</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\nEpic 1 3 332 +1 + + 0/1 . 0/1 0/1 . . . . .\nRivercrab 2 2 251 . . . . + + . . -1/1 . . .\nTwo2erII 3 1 270 . -1 +2 . . . . . . . . 0/1\nMusou 4 0 0 . . . . . . . 0/1 0/1 0/1 0/1 .\nMusou Two2erII 2 598\nTwo2erII Musou 2 511\nMusou Rivercrab 3 897\nRivercrab Musou 3 560\nMusou Epic 4 1196\nEpic Musou 4 629\nEpic 1 6 1135 +1 + + + . + + . . . . .\nMusou 2 4 1196 . . . . . . . + + + + .\nRivercrab 3 3 560 . . . . + + . . +1 . . .\nTwo2erII 4 2 511 . -1 +2 . . . . . . . . +</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Chengdu+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Chengdu Regional Contest  </a> ","type":"source","format":"html"}]}