{"title":"Winter's Coming","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4796","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4796&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4796","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4796"},"statement":[{"title":"Problem Description","content":"&#x2033;You are too young to be burdened with all my cares,&#x2033; the father told her, &#x2033;but you are also a Stark of Winterfell. You know our words.&#x2033;<br>&#x2033;Winter is coming,&#x2033; Arya whispered, thinking of Nymeria. She hugged her knees against her chest, suddenly afraid.<br>&#x2033;Remember the sigil of our House, Arya. Let me tell you something about it. When the snows fall and the white winds blow, the lone Wolf dies, but the pack survives. Summer is the time for squabbles. In winter, we must protect one another, keep each other warm, share our strengths. So if you must hate, Arya, hate those who would truly do us harm. Sansa... Sansa is your sister. You may be as different as the sun and the moon, but the same blood flows through both your hearts. You need her, as she needs you... and I need both of you, gods help me. Gods commanded us to build a long wall, which is regardless of the thickness, to defend the attack from the Lannister. Now we should carry out the wall.&#x2033; Ned Stark sounded so tired that it made Arya sad.<br>&#x2033;I do not mean to frighten you, but neither will I lie to you. We have come to a dark dangerous place, child. We have enemies who mean us ill in the King&apos;s Landing. We&apos;ll point the swords to the Lannister, rather than fight a war among ourselves. Our construction crew will build a wall which connect the north border and south border, separate the mainland into exact two parts. All our Wolf&apos;s cities should lie on the left part, while All Lannister&apos;s cities lie on the right part. Precisely, the wall can&apos;t pass through a grid more than once, and should run parallel or vertically to the four borders. With winter soon upon us, that is a different matter that we should minimize the time cost.&#x2033;<br>&#x2033;How much time do we have, roughly?&#x2033; Arya take out the draft and has been ready to calculate.<br>&#x2033;Winter is coming.&#x2033; Her father frowned.<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/4796-1.jpg\"></center>","type":"description","format":"html"},{"title":"Input","content":"There are multiple cases. The first line of each case contains two integers, N, M (1 &#x2264; N &#x2264; 20, 1 &#x2264; M &#x2264; 10), indicating the width and length of the mainland&apos;s layout.<br>In the map, the character is &apos;W&apos; indicated the Wolf&apos;s city, &apos;L&apos; indicated the Lannister&apos;s city, &apos;#&apos; means a grid where forbade any construction, and a number in &apos;0&apos;-&apos;9&apos; indicated the time cost to build a wall on this grid.","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output one integer, the minimum time cost to build a valid wall, or -1 if we can&apos;t work out an approach.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6 8\n88W888L8\n888#W888\n888888L8\n8W88L#88\n8888888L\n88888W88</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">88</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Changsha+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Changsha Regional Contest  </a> ","type":"source","format":"html"}]}