{"title":"LIKE vs CANDLE","time_limit":2000,"memory_limit":320,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4799","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4799&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4799","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4799"},"statement":[{"title":"Problem Description","content":"A microblog caused a war recently - There&apos;s the war between LIKE and CANDLE.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/4799-1.jpg\"></center> <br>As you see, there are N accounts are trying to show their support of LIKE or CANDLE. The way they show the support is forwarding a microblog, which means you choose someone&apos;s microblog and repost it with some comment. A valid support microblog is forwarding the original account&apos;s microblog or a other valid support microblog. We can assume that all accounts will forward the microblog only once. Also, it is impossible for a microblog forwarding a microblog that posts after it.  When the activity ends, someone will use a software to check these accounts and calculate a Power Point for LIKE and CANDLE. Specifically, each account will have a value based on some algorithm (you need not to care). The value will be added to LIKE if the account is voting LIKE, vice versa. So easy, isn&apos;t it?<br>Edward is a programmer and he supports LIKE. He found a bug in the software that used in the activity - He can spend X Power Point of LIKE to flip an account. When an account is flipped, it will be seen as it votes the other side. For example, if Alice votes LIKE and then it is flipped, the software will add the value to CANDLE. Of course, an account can be flipped for several times - If Alice is flipped again, it votes for LIKE again. And if we called the account the flipped account (Notice it&apos;s only a concept indicates the account has been flipped and not an attribute of an account), all accounts which forwarding the flipped account&apos;s microblog will also be flipped. Soon, Edward found that someone uses this bug before! Some accounts have been flipped already. He can&apos;t spend X Power Point to flip them anymore; instead, he need spend Y Power Point to flip an account which has been flipped directly by someone. For the glory of the LIKE, please help Edward to flip accounts so that the Power Point of LIKE can be larger than CANDLE as much as possible.<br>You can spend Power Point as much as you like, no matter the total Power Point of LIKE is negative or not.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains no more than 20 test cases. Notice there&apos;s no empty line between each test case.<br>For each test case, first line has three integers N (1 &#x2264; N &#x2264; 50000) - the number of the accounts, X (0 &#x2264; X &#x2264; 1000) and Y (0 &#x2264; Y &#x2264; 1000) - as the problem description. The account is numbered from 1 to N and 0 represent the original account.<br>Following N lines, the i<sup>th</sup> line means the i<sup>th</sup> account. Each line has four integers: V (0 &#x2264; V &#x2264; 1000) - the value of the i<sup>th</sup> account, F (0 &#x2264; F &#x2264; N) - which account did the i<sup>th</sup> account&apos;s forwarding account come from (0<sup>th</sup>  microblog is original account&apos;s microblog), S (0 &#x2264; S &#x2264; 1) - the status of flipped (0 means no changed, 1 means changed) and P (0 &#x2264; P &#x2264; 1) - the side the account supports without flipped (0 means LIKE, 1 means CANDLE).<br>The original microblog&apos;s account can&apos;t be flipped, and it hasn&apos;t the value and the support side.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case print an integer, represents the maximum result of the value of LIKE minus the value of CANDLE. If the value of CANDLE is larger than the LIKE, then just output &quot;HAHAHAOMG&quot; (without quote).<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3 2\n5 0 0 0\n3 1 0 1\n4 2 1 0\n1 2 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Changsha+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Changsha Regional Contest  </a> ","type":"source","format":"html","require":["katex"]}]}