{"title":"Josephina and RPG","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4800","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4800&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4800","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4800"},"statement":[{"title":"Problem Description","content":"A role-playing game (RPG and sometimes roleplaying game) is a game in which players assume the roles of characters in a fictional setting. Players take responsibility for acting out these roles within a narrative, either through literal acting or through a process of structured decision-making or character development.<br>Recently, Josephina is busy playing a RPG named TX3. In this game, M characters are available to by selected by players. In the whole game, Josephina is most interested in the &quot;Challenge Game&quot; part.<br>The Challenge Game is a team play game. A challenger team is made up of three players, and the three characters used by players in the team are required to be different. At the beginning of the Challenge Game, the players can choose any characters combination as the start team. Then, they will fight with N AI teams one after another. There is a special rule in the Challenge Game: once the challenger team beat an AI team, they have a chance to change the current characters combination with the AI team. Anyway, the challenger team can insist on using the current team and ignore the exchange opportunity. Note that the players can only change the characters combination to the latest defeated AI team. The challenger team gets victory only if they beat all the AI teams.<br>Josephina is good at statistics, and she writes a table to record the winning rate between all different character combinations. She wants to know the maximum winning probability if she always chooses best strategy in the game. Can you help her?<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. The first line of each test case is an integer M (3 &#x2264; M &#x2264; 10), which indicates the number of characters. The following is a matrix T whose size is R &#xD7; R. R equals to C(M, 3). T(i, j) indicates the winning rate of team i when it is faced with team j. We guarantee that T(i, j) + T(j, i) = 1.0. All winning rates will retain two decimal places. An integer N (1 &#x2264; N &#x2264; 10000) is given next, which indicates the number of AI teams. The following line contains N integers which are the IDs (0-based) of the AI teams. The IDs can be duplicated.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, please output the maximum winning probability if Josephina uses the best strategy in the game. For each answer, an absolute error not more than 1e-6 is acceptable.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n0.50 0.50 0.20 0.30\n0.50 0.50 0.90 0.40\n0.80 0.10 0.50 0.60\n0.70 0.60 0.40 0.50\n3\n0 1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.378000</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Changsha+Regional+Contest+&amp;source=1&amp;searchmode=source\"> 2013 Asia Changsha Regional Contest  </a> ","type":"source","format":"html"}]}