{"title":"Shoot","time_limit":15000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4805","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4805&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4805","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4805"},"statement":[{"title":"Problem Description","content":"At the year of 8192, the war between Evil Army and Galaxy Army broken out. Unfortunately, Evil Army had conquered half the galaxy in just one year. To prevent the situation of the war from getting worse, Levi, the general of Galaxy Elite Army, was ordered by his superior to attack the enemy&#x2019;s power bases.<br>Levi was born with the remarkable ability of counter-surveillance, it was just a piece of cake for him to reach Evil Army&#x2019;s power bases. Each power base can be represented as a triangle in 3D-Cartesian coordinate system. The only weapon Levi had was a laser cannon which can shoot <b>in both two directions simultaneously</b>. To avoid being caught by enemy, Levi can only place the laser cannon somewhere on a segment from S to T. Unfortunately, there was something wrong with the laser cannon, Levi can&#x2019;t adjust its shooting angle, so the shooting direction was fixed.<br>Since Levi didn&#x2019;t have any time to find the best place to shoot the laser, he decided to select a point on the segment randomly to place the cannon. If the laser touched the base(even the boundary), the base will be destroyed. Your task is to calculate the expected number of the destroyed bases in just one shoot.<br>It is recommended to see the sample input to understand the problem statement more clearly.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases, please process till EOF.<br>For each test case, the first line is an integer N (1 &lt;= N &lt;= 100000), the number of enemy&#x2019;s power bases. Each of the next three lines contains 3 integers, x, y, z, denoting the coordinates of S, T, and the fixed shooting direction. The last N lines contains 9 integers, x<sub>1</sub>, y<sub>1</sub>, z<sub>1</sub>, x<sub>2</sub>, y<sub>2</sub>, z<sub>2</sub>, x<sub>3</sub>, y<sub>3</sub>, z<sub>3</sub>, denoting the coordinates of the three vertices of enemy&#x2019;s power base. It is guaranteed that all the triangles will not degenerate.<br>And the absolute value of all numbers except N and T will not exceed 1000.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the expected number of destroyed power bases.<br>Any answer within an absolute error less than or equal to 10<sup>-6</sup> would be accepted.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0 0 0\n2 0 0\n0 0 1\n-1 0 1 1 0 1 -1 0 2\n1 1 -1 1 -1 -1 2 0 -1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1.00000000</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013ACM%2FICPC%D1%C7%D6%DE%C7%F8%C4%CF%BE%A9%D5%BE%CF%D6%B3%A1%C8%FC%A1%AA%A1%AA%CC%E2%C4%BF%D6%D8%CF%D6&amp;source=1&amp;searchmode=source\"> 2013ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5357;&#x4EAC;&#x7AD9;&#x73B0;&#x573A;&#x8D5B;&#x2014;&#x2014;&#x9898;&#x76EE;&#x91CD;&#x73B0; </a> ","type":"source","format":"html","require":["katex"]}]}