{"title":"Circular Lamps","time_limit":2000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4806","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4806&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4806","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4806"},"statement":[{"title":"Problem Description","content":"The circular roundabout of 2nd road is an important traffic junction in Nanjing University of Science and Technology. To celebrate the 60th anniversary, the school officer decides to build some lamps with digital shape surrounding the circular roundabout.<br>There are 2N lamps to build. Lamps have the shape of digits, ranging from 1 to 2N. Specially, lamps will be built as a whole which can&#x2019;t be split into single numbers. For example, lamp 19 can&#x2019;t be split into lamp 1 and lamp 9. Since the roundabout is circular, the last lamp is next to the first lamp. Unfortunately, due to the carelessness of the construction team, some lamps are placed in the wrong position. Since the construction team is now<br>absent after finishing their work, we could only correct the order of lamps by ourselves. After rearrangement, the lamp with the shape i (1 &lt;= i &lt;= 2N) is expected to be placed on the i-th position. In other words, the final permutation should be 1, 2, ... , 2N. Because of the large volume of the lamps, we have only two ways to adjust the order <br><br>1) Reverse the consecutive 4 lamps starting from the position x, denotes as (1 x). For example:<br>(1 4): 1 2 3 [4 5 6 7] 8      -&gt;    1 2 3 [7 6 5 4] 8<br>or<br>(1 6): 1] 2 3 4 5 [6 7 8      -&gt;    6] 2 3 4 5 [1 8 7<br>where &#x2018;[&#x2019; stands for the start position, and &#x2018;]&#x2019; stands for the end position respectively.<br>2) Shift all lamps to the left by x positions, denotes as (2 x). For example:<br>(2 4): 1 2 3 4 5 6 7 8     -&gt;     5 6 7 8 1 2 3 4<br>or<br>(2 7): 1 2 3 4 5 6 7 8     -&gt;     8 1 2 3 4 5 6 7<br><br>The data guarantees the existence of a valid adjustment sequence. Also the case where all lamps are already placed correctly will not exist in the input.<br><br>Your task is to generate a valid adjustment sequence that all lamps are put on the correct position.","type":"description","format":"html"},{"title":"Input","content":"There are several test cases, please process till EOF.<br>Each test case starts with a line containing one integers N(2 &lt;= N &lt;= 30). The next line contains 2N different integers, the i-th number A<sub>i</sub> denotes that the shape of the i-th lamp is A<sub>i</sub>(1 &lt;= A<sub>i</sub> &lt;= 2N).","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, the first line of the output should contain a single integer S &lt;= 400000, denoting the number of swap operations you need to perform.<br>Each of the following S lines should consist of two integers. The first one may be 1 or 2, indicating the type of swap operations. For the first type, the second number is the start position of the operation, and for the second type, the second number is the positions you need to shift. In both cases, the second number should be ranged between 1 and 2N.<br>If there are multiple possible solutions satisfying the conditions above, any one will be accepted. Please don&#x2019;t print extra empty lines, spaces and other irrelevant characters.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n6 5 4 3 2 1 8 7\n4\n4 5 1 2 3 6 7 8\n4\n7 8 4 3 2 1 5 6</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 2\n1 6\n2\n1 2\n1 1\n2\n1 3\n2 2</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013ACM%2FICPC%D1%C7%D6%DE%C7%F8%C4%CF%BE%A9%D5%BE%CF%D6%B3%A1%C8%FC%A1%AA%A1%AA%CC%E2%C4%BF%D6%D8%CF%D6&amp;source=1&amp;searchmode=source\"> 2013ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5357;&#x4EAC;&#x7AD9;&#x73B0;&#x573A;&#x8D5B;&#x2014;&#x2014;&#x9898;&#x76EE;&#x91CD;&#x73B0; </a> ","type":"source","format":"html"}]}