{"title":"Little Tiger vs. Deep Monkey","time_limit":1000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4815","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4815&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4815","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4815"},"statement":[{"title":"Problem Description","content":"A crowd of little animals is visiting a mysterious laboratory &#x2013; The Deep Lab of SYSU.<br><br>&#x201C;Are you surprised by the STS (speech to speech) technology of Microsoft Research and the cat face recognition project of Google and academia? Are you curious about what technology is behind those fantastic demos?&#x201D; asks the director of the Deep Lab. &#x201C;Deep learning, deep learning!&#x201D; Little Tiger raises his hand briskly. &#x201C;Yes, clever boy, that&#x2019;s deep learning (&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;/&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;)&#x201D;, says the director. &#x201C;However, they are only &#x2018;a piece of cake&#x2019;. I won&#x2019;t tell you a top secret that our lab has invented a Deep Monkey (&#x6DF1;&#x7334;) with more advanced technology. And that guy is as smart as human!&#x201D;<br><br>&#x201C;Nani ?!&#x201D; Little Tiger doubts about that as he is the smartest kid in his kindergarten; even so, he is not as smart as human, &#x201C;how can a monkey be smarter than me? I will challenge him.&#x201D;<br><br>To verify their research achievement, the researchers of the Deep Lab are going to host an intelligence test for Little Tiger and Deep Monkey.<br><br>The test is composed of N binary choice questions. And different questions may have different scores according to their difficulties. One can get the corresponding score for a question if he chooses the correct answer; otherwise, he gets nothing. The overall score is counted as the sum of scores one gets from each question. The one with a larger overall score wins; tie happens when they get the same score.<br><br>Little Tiger assumes that Deep Monkey will choose the answer randomly as he doesn&#x2019;t believe the monkey is smart. Now, Little Tiger is wondering &#x201C;what score should I get at least so that I will not lose in the contest with probability of at least P? &#x201D;. As little tiger is a really smart guy, he can evaluate the answer quickly.<br><br>You, Deep Monkey, can you work it out? Show your power!&#xFFFD;","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input contains a single integer T (1 &#x2264; T &#x2264; 10) indicating the number of test cases. Then T test cases follow.<br><br>Each test case is composed of two lines. The first line has two numbers N and P separated by a blank. N is an integer, satisfying 1 &#x2264; N &#x2264; 40. P is a floating number with at most 3 digits after the decimal point, and is in the range of [0, 1]. The second line has N numbers separated by blanks, which are the scores of each question. The score of each questions is an integer and in the range of [1, 1000]&#xFFFD;","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output only a single line with the answer.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 0.5\n1 2 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Regional+Changchun+&amp;source=1&amp;searchmode=source\"> 2013 Asia Regional Changchun  </a> ","type":"source","format":"html","require":["katex"]}]}