{"title":"Bathysphere","time_limit":10000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4816","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4816&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4816","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4816"},"statement":[{"title":"Problem Description","content":"The Bathysphere is a spherical deep-sea submersible which was unpowered and lowered into the ocean on a cable, and was used to conduct a series of dives under the sea. The Bathysphere was designed for studying undersea wildlife.<br><br>The Bathysphere was conducted from the deck of a ship. After counted, the ship should not move, so choosing the position where the Bathysphere was conducted is important.<br><br>A group of scientists want to study the secrets of undersea world along the equator, and they would like to use the Bathysphere. They want to choose the position where the Bathysphere can dive as deep as possible. Before conducting the Bathysphere, they have a map of the seabed, which tell them the shape of the seabed. They draw a line on the equator of the map to mark where they will release the Bathysphere, as a number axis. Suppose the axis is draw from 0 to L. But when they release the Bathysphere, they can&apos;t know where they are accurately, i.e., if they choose position x to release the Bathysphere, the real position will distribute between x-d and x+d with an equal probability, where d is given. The objective of the scientists is very simple, i.e., to maximize the expected depth.<br><br>For the ease of presentation, the shape of the seabed is described as a poly line. Given N points ) , ( X<sub>i</sub>,Y<sub>i</sub> ) as the vertices, where X<sub>i</sub> and Y<sub>i</sub> indicate the position and the depth of the i-th vertex, respectively, the ploy line is composed of the line segments that connect consecutive vertices.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer T (1 &#x2264; T &#x2264; 25), the number of test cases.<br><br>Then T test cases follow. In each test case, the first line contains two integers N (2 &#x2264; N &#x2264; 2*10^5) and L (2 &#x2264; L &#x2264; 10^9), as described above. Then N lines follow, each line contains two integer X<sub>i</sub> and Y<sub>i</sub> (1&#x2264;i&#x2264;N, 0&#x2264; Y<sub>i</sub> &#x2264;10^9), where point ( X<sub>i</sub>,Y<sub>i</sub> ) is a vertex of the ploy line. It is assumed that X<sub>1</sub> == 0 and X<sub>n</sub> == L and X<sub>i</sub> &lt; X<sub>i+1</sub> for 1 &#x2264; i &lt; N. Then the following line contains one integer d (0 &#x2264; d &#x2264; L/2), as described above.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, choose a position between d and L-d, both inclusive, to conducted the Bathysphere, and calculate the expected depth. Output the expected depth in a line, rounded to 3 digits after the decimal point.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 10\n0 3\n4 10\n10 1\n5\n3 10\n0 3\n4 10\n10 1\n1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5.900\n9.192</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Regional+Changchun+&amp;source=1&amp;searchmode=source\"> 2013 Asia Regional Changchun  </a> ","type":"source","format":"html","require":["katex"]}]}