{"title":"Tower","time_limit":5000,"memory_limit":63.9990234375,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4820","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4820&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4820","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4820"},"statement":[{"title":"Problem Description","content":"The land price on the MMM island is extremely high. So people on the island all live in a very tall tower with one million floors!! There are N electric service companies (labeled 1 to N) and M power stations on the island. One power station belongs to exactly one company.<br><br>At the beginning, the company of each power station is given, and a company can choose one floor to build a power center. Assuming that there are k power stations (on floor a1,a2,...,ak) that belong to a company, and the company chooses floor x to build the power center, the daily cost of this company would be |a1-x|+|a2-x|+...+|ak-x|. MMM, the master of the island, has made a special rule:<br><br>x1 &lt;=&gt; x2 &lt;=&gt; x3 &lt;=&gt; ... &lt;=&gt; xn<br><br>The operator &lt;=&gt; can be either &lt;= or &gt;=. It means that the power centers chosen by the adjacent companies should follow the specified order. For example, if the rule is x1 &lt;= x2 &gt;= x3, it means that the power center of company 1 should not be higher than that of company 2, and the power center of company 2 should not be lower than that of company 3. Though there is no constraint between company 1 and company 3. If company 1 chooses floor 2 for the power center and company 2 chooses floor 3, the station of company 3 can only be in floor 1, 2 or 3.<br><br>Your task is to help the companies calculate their minimum total daily cost.","type":"description","format":"html"},{"title":"Input","content":"There are multiple test cases. The first line has an integer T (T &#xFFFD;&#xFFFD; 10), which indicates the number of test cases.<br><br>Each test case begins with two integers N and M (1 &#xFFFD;&#xFFFD; N &#xFFFD;&#xFFFD; M &#xFFFD;&#xFFFD; 5*10^5).<br><br>There are N - 1 operators on the second line, either &apos;&lt;=&apos; or &apos;&gt;=&apos;, separated by spaces, indicating the rules between adjacent companies.<br><br>The third line has M pairs of integers. Each pair x_i, y_i describes the i-th power station, where x_i indicates the label of the floor and y_i indicates the label of the company, (1 &#xFFFD;&#xFFFD; x_i &#xFFFD;&#xFFFD; 10^6, 1 &#xFFFD;&#xFFFD; y_i &#xFFFD;&#xFFFD; N). It is guaranteed that each company has at least one power station.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the minimum total daily cost of the island.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3 5\n&lt;= &lt;=\n2 1 3 1 4 2 4 2 5 3\n3 8\n&lt;= &lt;=\n7 3 9 3 3 2 4 2 5 2 6 1 7 1 8 1\n4 4\n&lt;= &gt;= &lt;=\n3 1 1 2 4 3 2 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n11\n4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2013+Asia+Regional+Changchun+&amp;source=1&amp;searchmode=source\"> 2013 Asia Regional Changchun  </a> ","type":"source","format":"html"}]}