{"title":"ROBOT","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4840","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4840&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4840","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4840"},"statement":[{"title":"Problem Description","content":"In the near future, robots are going to transport snacks to the contestants at Balkan Olympiads in Informatics. Robot carries all snacks on a single square tray. &#x2264;Unfortunately, path between the kitchen and the contestant hall is expected to be full of various obstacles and, thus, robot won\\&apos;t be able to carry a tray of an arbitrary size. It is your task to write a program ZAD1.EXE to determine the size of the largest possible tray that can be used for catering. <br>The path that the robot is supposed to traverse is contained in the corridor with parallel walls and corridor can have only 90o turns. Corridor starts in the direction of the positive x-axis. Obstacles are pillars, represented as points, and they are all between the walls of the corridor. In order for the robot to be able to traverse the path, the tray must not hit pillars or walls -- it may only \\&quot;touch\\&quot; them with its side. Robot and his tray move only by translation in the direction of x or y-axis. Assume that the dimensions of the robot are smaller than the dimensions of the tray and that the robot is always completely under the tray. ","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains an integer T(1&lt;=T&lt;=20) which means the number of test cases.<br>In the first line of the each test case, is an integer m (1 &#x2264; m &#x2264; 30) that represents the number of straight wall segments. In the next m+1 lines of the input file are the x and y coordinates of all turning points (including the endpoints) of the \\&quot;upper\\&quot; walls, i.e. the broken line whose initial point has a greater y coordinate. Similarly, in the next m+1 lines are the x and y coordinates of all turning points (including the endpoints) of the \\&quot;lower\\&quot; walls. Next line of the input file contains the integer n (0 &#x2264; n &#x2264; 100) that represents the number of obstacles. In the next n lines of the input file are the x and y coordinates of the obstacles. All coordinates are integers with absolute values less than 32001.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output should contain only one integer for each test case that represents the length of the side of the largest tray that satisfies the conditions of the problem.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\n0 10\n20 10\n20 &#x2013;25\n-10 &#x2013;25\n0 0\n10 0\n10 &#x2013;10\n-10 -10\n2\n15 &#x2013;15\n6 5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BOI+2002&amp;source=1&amp;searchmode=source\"> BOI 2002 </a> ","type":"source","format":"html","require":["katex"]}]}