{"title":"Wow! Such Doge!","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4847","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4847&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4847","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4847"},"statement":[{"title":"Problem Description","content":"<center><img style=\"max-width:100%;\" src=\"../../data/images/C521-1001-1.jpg\"></center><br>   Chen, Adrian (November 7, 2013). &#xFFFD;&#xFFFD;Doge Is An Ac- tually Good Internet Meme. Wow.&#xFFFD;&#xFFFD;. Gawker. Retrieved November 22, 2013.<br><br>   Doge is an Internet meme that became popular in 2013. The meme typically con- sists of a picture of a Shiba Inu dog ac- companied by multicolored text in Comic Sans MS font in the foreground. The text, representing a kind of internal monologue, is deliberately written in broken  English, and usually contains the word &#xFFFD;&#xFFFD;wow&#xFFFD;&#xFFFD; and the phrases &#xFFFD;&#xFFFD;such x&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;much x&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;many x&#xFFFD;&#xFFFD;, &#xFFFD;&#xFFFD;very x&#xFFFD;&#xFFFD; and &#xFFFD;&#xFFFD;so x&#xFFFD;&#xFFFD;.<br>   Kabosu, the Shiba Inu featured in the original meme, was first pictured in a 2010 blog post by Atsuko Sato, a Japanese kindergarten teacher. Afterwards, varia- tions of the pictures using overlaid Comic Sans text were posted from a Tumblr blog, Shiba Confessions. However, the use of the intentionally misspelled &#xFFFD;&#xFFFD;doge&#xFFFD;&#xFFFD; dates back to June 2005, when it was mentioned in an episode of Homestar Runners puppet series.<br>   In August 2013, images of the meme were spammed on Reddit&#xFFFD;&#xFFFD;s r/MURICA subreddit by 4chan&#xFFFD;&#xFFFD;s random imageboard, /b/. A search of the term doge on Google Trends shows an explosion of popularity occurring in October 2013, and more so in the following month. By November 2013, the meme had become widespread on the Internet. Google later created a Doge Easter egg: when doge meme was entered into the YouTube search bar, all of the site&#xFFFD;&#xFFFD;s text would be displayed in colorful Comic Sans, similar to the kind used by the meme.<br>   The meme was ranked #12 on MTV&#xFFFD;&#xFFFD;s list of &#xFFFD;&#xFFFD;50 Things Pop Culture Had Us Giving Thanks For&#xFFFD;&#xFFFD; in 2013. Io9 compared the internal dialog of the Shiba Inu dogs to lolcat-speak. The image most commonly associated with the meme is of a female Shiba Inu named Kabosu, taken from a Japanese blog documenting the dog&#xFFFD;&#xFFFD;s daily activities. The spelling of doge has several variants, leading to debate on its actual pronunciation. On December 13, Doge was named the &#xFFFD;&#xFFFD;top meme&#xFFFD;&#xFFFD; of 2013 by Know Your Meme.<br>   In December 2013, the Dogecoin was introduced as a new cryptocurrency, making it the first cryptocurrency to be based on an Internet meme; the viral phenomenon, along with usage of the Comic Sans MS typeface, gave it &#xFFFD;&#xFFFD;the Internet density of a large star&#xFFFD;&#xFFFD; according to Medium writer Quinn Norton.<br>In late December 2013, members of the U.S. Congress produced material in the meme&#xFFFD;&#xFFFD;s style. Huffington Post commented that Doge was &#xFFFD;&#xFFFD;killed&#xFFFD;&#xFFFD; because of the Congress members&#xFFFD;&#xFFFD; usage of the meme.<br>   By early 2014, Doge&#xFFFD;&#xFFFD;s popularity was sustained by internet communities on social media, accompanied by the rapid growth and acceptance of Dogecoin.  In April 2014, Doge experienced a second major media resurgence due to revelations of the Dogecoin community&#xFFFD;&#xFFFD;s intent to sponsor Josh Wise in NASCAR and place a picture of the Shiba Inu on his vehicle.<br><br>                                                                               &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; Doge (meme). (2014, May 18).<br>                                    In Wikipedia, The Free Encyclopedia.  Retrieved 02:00, May 22, 2014, from<br>                                       http://en.wikipedia.org/w/index.php?title=Doge_(meme)&amp;oldid=609040691<br><br>   Now, Doge wants to know how many words &#xFFFD;&#xFFFD;doge&#xFFFD;&#xFFFD; are there in a given article. Would you like to help Doge solve this problem?","type":"description","format":"html"},{"title":"Input","content":"   An article that Doge wants to know.<br>   The size of the article does not exceed 64KB. The article contains only ASCII characters.","type":"input_format","format":"html"},{"title":"Output","content":"   Please output the number of word &#xFFFD;&#xFFFD;doge&#xFFFD;&#xFFFD; (case-<b>in</b>sensitive). Refer to the samples for more details.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">adoge\ncutedo \nyourge \nblownDoge\nlovelyDooge\nWow!\tSuch Dooooooooooooooge!!!\nD0ge\ndOge DOGE \ndogedoge</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">6</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014%CE%F7%B0%B2%C8%AB%B9%FA%D1%FB%C7%EB%C8%FC&amp;source=1&amp;searchmode=source\"> 2014&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x22B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}