{"title":"Trader Dogy","time_limit":4000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4853","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4853&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4853","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4853"},"statement":[{"title":"Problem Description","content":"   Trader Dogy lives in a city consists of n districts. There are n - 1 bidirectional roads in the city, each connecting a pair of districts. It is guaranteed that Dogy can reach every district regardless of district to start with.<br>   One day Dogy is assigned a task with high awards. In this task, Dogy needs to visit a list of K districts one by one, in order to buy and sell some goods. It takes a lot of time, so Dogy wants to make good use of his car. Let Target<sub>i</sub> be the i-th district in the list. Initially Dogy is in the district with number Target<sub>1</sub> with his only car.<br>   At any time, Dogy can pass a road by car or park his car at the district he is currently in and try other transportations (which means he can not drive his car until he comes back to the district where he parks his car). Also, he can not park his car on roads.<br>   More precisely, the for the i-th road connecting city a<sub>i</sub> and b<sub>i</sub>, it will take costCar<sub>i</sub> units of time to pass by car, or costOther<sub>i</sub> to pass in other ways of transportations. Please note that costCar<sub>i</sub> might be larger than costOtheri due to traffic congestion.<br>   Now Dogy turns to you for help. He asks you to make a plan minimizing the total time required for his task. As his best friend, can you solve the problem?","type":"description","format":"html"},{"title":"Input","content":"   There are several test cases. Please process till EOF. <br>   Each test case contains several lines, for each test case,<br>   The first line contains two integers n, K(1 &#x2264; n, K &#x2264; 100000) where n is the number of districts and K is the length of the list mentioned above.<br>   The following n - 1 lines describes roads, each containing 4 numbers a<sub>i</sub>, b<sub>i</sub>, costOther<sub>i</sub>,  costCa<sub>i</sub>.<br>   The last line contains K integers: the elements in the list.<br>   <b>One useful tip</b>: The structure of Dogy&#x2019;s city is <b>randomly generated</b>, see <b>Hint</b> below for more details.<br><br><b>Hint</b>:<br>   The data generator for this problem runs as follows: for each i &gt; 1, it creates a road connecting district<sub>i</sub> and district<sub>randint(1,i - 1)</sub>, where randint(l, r) returns an integer uniformly distributed between l and r, inclusively.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print one integer: the cost of time in your minimized plan.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 3\n1 2 1 100\n2 3 100 1\n2 4 1 100\n1 3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">103</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014%CE%F7%B0%B2%C8%AB%B9%FA%D1%FB%C7%EB%C8%FC&amp;source=1&amp;searchmode=source\"> 2014&#x897F;&#x5B89;&#x5168;&#x56FD;&#x9080;&#x8BF7;&#x8D5B; </a> ","type":"source","format":"html"}]}