{"title":"Centroid of a Tree","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4863","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4863&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4863","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4863"},"statement":[{"title":"Problem Description","content":"   Given a tree T with N vertices, your task is calculating the number of the connected sub-tree of T, which has the same centroid as T.<br>   In order to define the centroid, some integer value will be associated to every vertex. Let&apos;s consider the vertex k. If we remove the vertex k from the tree (along with its adjacent edges), the remaining graph will have only N-1 vertices and may be composed of more than one connected components. Each of these components is (obviously) a tree. The value associated to vertex k is the largest number of vertices contained by some connected component in the remaining graph, after the removal of vertex k. All the vertices for which the associated value is minimum are considered centroids.<br>   A graph can have an arbitrary number of centroids. However,it can be proved that for trees, there are only two possibilities:<br>   1. The tree has precisely one centroid.<br>   2. The tree has precisely two centroids. In this case, the two centroids are adjacent.<br>   Note that in case 2, we just consider that T has two centroids, you should only count the sub-tree which has the two same centroids as T.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   The first line of the date is an integer T, which is the number of the text cases.<br>   Then T cases follow each case starts of a number N descript above.<br>   Then N-1 lines follow, each line contains two integers x and y, which means that there is a edge between x and y in tree T, you can assume that the index of T is from 1 to N.<br>   1 &lt;= T &lt;= 50, 1 &lt;= N &lt;= 200,","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each case, output the case number first, then output the number of the connected sub-tree which has the same centroid as T.<br>   Give your answer modulo 10007.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\n1\n2\n1 2\n3\n1 2\n1 3\n4\n1 2\n1 3\n1 4\n5\n1 2\n1 3\n1 4\n4 5</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 1\nCase 2: 1\nCase 3: 2\nCase 4: 5\nCase 5: 6</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"FZU","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 1 </a> ","type":"source","format":"html","require":["katex"]}]}