{"title":"ZCC loves Army","time_limit":1200,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4875","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4875&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4875","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4875"},"statement":[{"title":"Problem Description","content":"   ZCC owns an army with n soldiers. Soldiers are numbered from 1 to n. Soldier 1 is the commander in chief. Each soldier has a <b>direct superior (which is called father in ACM)</b> except soldier 1. x is a <b>direct inferior (which is called son in ACM)</b> of y if and only if y is the direct superior of x. Soldier use an ordered list called <b>direct inferiors list</b> to manage his direct inferiors (The indexes begin with 1). If soldier A and soldier B are in the same direct inferiors list, and A is in front of B, then we say A&#x2019;s level is higher than B. We assume that soldier 1 belongs to a direct inferior list that only contains soldier 1 for convenience.<br>   <b>Messages</b> can be transmitted among the soldiers. A soldier can directly send messages to his direct superior, his direct inferior, and those who are in the same direct inferior list with him. Messages can also be sent indirectly. That means if x wants to send a message to y, he first send it directly to a third soldier z, then z send this message directly to y. In this case, we say z is involved in this transmission as a middleman. Message transmission that involves more than one middleman is also allowed.<br>   <b>Orders</b> can be transmitted among the soldiers too. A soldier can directly give orders to his direct inferior and those who are in the same direct inferior list with him but have lower level. Orders can also be given indirectly. That means if x wants to give an order to y, he first give it to a third soldier z, then z give this order to y. In this case, we say z is involved in this transmission as a middleman. Order transmission that involves more than one middleman is also allowed.<br>   Unfortunately, sometimes some soldiers will change their direct superior. More specifically, event like &#x201C;the p-th soldier to (p+c-1)-th soldier in soldier x&#x2019;s direct inferior list change their direct superior to y and be inserted after the q-th soldier in y&#x2019;s direct inferior list (if q=0, that means these soldiers are inserted in front of the first soldier in y&#x2019;s direct inferior list)&#x201D; will sometimes happen.<br>   To examine the efficiency of the transmission of the messages and orders, ZCC will ask two types of question: <br>   1) If soldier x want to send messages to soldier y, at least how many soldiers will be involved in this transmission as a middleman.<br>   2) How many soldiers can give orders to soldier x.<br>   Now, m events, including direct superior change events and ZCC&#x2019;s questions, happen one by one. Can you answer all ZCC&#x2019;s questions?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   The first line contains two integers n and m, indicating the number of soldiers and the number of events.<br>   Then n lines follow, describing the initial direct inferior list of each soldier. The i-th line contains several integers. The first integer is k, indicating the number of soldier i&#x2019;s direct inferior. Then k integers follow, indicating the direct inferior list of soldier i.<br>   After that m lines follow, describing the m events. Each line begins with an integer t, indicating the type of this event.<br>   If t = 1, then 5 integers x, p, c, y and q follow, indicating a direct superior change event;<br>   If t = 2, then 2 integers x and y follow, indicating ZCC&#x2019;s question 1;<br>   If t = 3, then an integer x follows, indicating ZCC&#x2019;s question 2.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each question, output one line with one integer indicating your answer.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9 7\n2 2 3\n3 4 5 6\n3 7 8 9\n0\n0\n0\n0\n0\n0\n3 1\n3 9\n1 2 2 2 3 2\n3 9\n2 5 9\n2 4 8\n3 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n5\n7\n0\n2\n2\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>   n&lt;=100000, m&lt;=100000\n   You can assume that the events are all legal, and the relationship among the soldiers forms a tree all the time.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"&#x9547;&#x6D77;&#x4E2D;&#x5B66;","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+2&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 2 </a> ","type":"source","format":"html","require":["katex"]}]}