{"title":"TIANKENG’s travel","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4885","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4885&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4885","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4885"},"statement":[{"title":"Problem Description","content":"TIANKENG has get a driving license and one day he is so lucky to find a car. Every day he drives the car around the city. After a month TIANKENG finds that he has got high driving skills and he wants to drive home. Assuming that we regard the map of Hangzhou as a two-dimensional Cartesian coordinate system, the coordinate of the school is (sx, sy), the coordinate of TIANKENG&#x2019;s home is (ex,ey). There are n gas stations distributing along the road and the coordinate of the ith gas station is (xi, yi). Because there is something wrong with the car engine, TIANKENG can drive the car for L miles after every time he fills up the gas. Assuming that TIANKENG must fill up the gas when he passes by a gas station and the initial status of the tank is full. TIANKENG must drive on the straight line and he can only choose to drive to school or home or gas station. Your task is to tell TIANKENG the minimum times he needs to charge fuel to go home successfully.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains a positive integer T(T&lt;=30), referring to T test cases.<br>For each test case, the first line contains two integers n(0&lt;=n&lt;=1000), L(1&lt;=L&lt;=100000), which mean n gas stations in all and the distance TIANKENG can drive with the full tank respectively. The second line contains two integers sx, sy, which refers to the coordinate of the school.<br>The third line contains two integers ex, ey, which refers to the coordinate of TIANKENG&#x2019;s home.<br>Then following n lines, each line contains two integer xi, yi, which refers to the coordinate of gas station.<br><br>Assuming that all the coordinates are different! All the coordinates satisfied [0,1000000]. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, if TIANKENG cannot go home successfully, print &#x201C;impossible&#x201D;(without quotes), otherwise print the minimum times of charging fuel.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 1000\n0 0\n2000 1000\n1000 0\n2000 0\n0 1000\n0 0\n2000 1000</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nimpossible</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BestCoder+Round+%232&amp;source=1&amp;searchmode=source\"> BestCoder Round #2 </a> ","type":"source","format":"html","require":["katex"]}]}