{"title":"Endless Punishment","time_limit":15000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4887","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4887&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4887","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4887"},"statement":[{"title":"Problem Description","content":"   In the ancient Greek tale, Sisyphus was a king of Ephyra, he was punished for chronic deceitfulness by being compelled to roll an immense stone up a hill every day, only to watch it roll back down, and to repeat this action forever.<br><br>   Zeus, the God of the universe, shows some mercy for Sisyphus, so he decides to change the way of punishment. He puts N stones with the color of white or black in a line on the hill, everyday when Sisyphus rolls a new stone up the hill, the new stone is added to the back of the old N stones, and the first stone rolls down to the foot of the hill. Then Zeus shows his magic to change the color of the new N stones. Firstly, he looks at a subset S<sub>1</sub> of the original N stones, which always includes the first stone, if an odd number of the stones are black, then the newly N-th stone will be black and white otherwise. After the first step is done, he flips the color of another subset S<sub>2</sub> of the new N stones, black stone will become white, and white stone will become black vice versa. The following example illustrates how Zeus&apos;s magic works.<br><br>   Consider the case of N = 4, S1 = {1,3}, S2 = {2,4}. Suppose the current stone color state is &#x25CF;&#x25CB;&#x25CB;&#x25CB;, (&#x25CB; for white stone, and &#x25CF; for black stone), the 1st and 3rd stone is black and white respectively, so the new 4th stone will be black, produces &#x25CB;&#x25CB;&#x25CB;&#x25CF; after the first step. At the second step, the 2nd and 4th stone flip its color, produces &#x25CB;&#x25CF;&#x25CB;&#x25CB; in the end.<br><br>   Zeus tells to Sisyphus that, if one day <b>after the two steps are done,</b> the color of the stones turns to one specific state, he will get his freedom. Now given the current and final stone colors, please compute how many days are needed for Sisyphus&apos;s freedom?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   There are several test cases, please process till EOF.<br><br>   For each test case, the first line contains three integers, the first integer is N(2 &#x2264; N &#x2264; 31), the number of stones, followed by two integers S<sub>1</sub> and S<sub>2</sub>, (1 &#x2264; S<sub>1</sub>,S<sub>2</sub> &#x2264; N), denoting the size of two subsets as mentioned above. The second and third line contains S<sub>1</sub> and S<sub>2</sub> integers a and b in the increasing order, describing the two subsets. It is guaranteed that a1 always equals to 1. The last two lines each contains N integers with <b>0 (for white)</b>, or <b>1 (for black)</b> denoting the current and final state. The first integer describes the first stone, and the last integer describes the last stone.<br><br>   Please note that there are about 500 test cases, fortunately, only 20 of them are big test cases.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each test case, output a single integer, the minimum days for Sisyphus to get his freedom. If Zeus is an absolute liar, then just simply print the sentence <b>poor sisyphus</b>.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2 2\n1 3\n2 4\n1 0 0 0\n0 1 0 0\n4 2 2\n1 3\n2 4\n1 1 1 1\n0 0 0 0\n4 2 2\n1 3\n2 4\n1 1 1 1\n0 1 0 0\n10 5 6\n1 2 4 5 6\n2 4 5 8 9 10\n0 0 0 0 0 0 1 0 0 0\n1 1 1 1 1 1 1 1 1 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n4\npoor sisyphus\n387</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"Fudan University","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+3&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 3 </a> ","type":"source","format":"html","require":["katex"]}]}