{"title":"NO ACM NO LIFE","time_limit":3000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4900","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4900&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4900","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4900"},"statement":[{"title":"Problem Description","content":"   There is an old country and the king fell in love with a devil. The devil always asks the king to do some crazy things. Although the king used to be wise and beloved by his people. Now he is just like a boy in love and can&#xFFFD;&#xFFFD;t refuse any request from the devil. Also, this devil is looking like a very cute Loli.<br><br>   If you solved the last problem, you will see that the devil can&apos;t figure out who is z*p because there are too many people. So anyway, she decided to let it go.<br><br>   The devil think she is the cutest loli in the world, but there is some people in the kingdom don&apos;t think so. And they think WJMZBMR is the most cutest loli. <br><br>   It seems a war is approaching, but in this kingdom, due to the old tradition, every conflict is solved by Algorithm contest!<br><br>   One day, WJMZBMR is hanging out with her friend s***kplus on the street. And she noticed that there is a group of people playing algorithm contest to decide who is the cutest loli in the kingdom. One problem attracts her interest:<br><br>   Given a tree with n vertices, we randomly choose k vertices of it. Then we can induced a subtree which is the smallest connected subtree of the original tree containing those k vertices.<br><br>   Each vertex has a label(an integer), for a subtree we induced, we look at its diameter a-b,(if there are many diameters, pick the one with the smallest a, and then the smallest b). And output how many distinct label are on the diameter.<br><br>   What is the expected value we output?<br><br>   Of course, WJMZBMR is merely a cute loli and don&apos;t know much about the algorithm contest, but since you are a member of Princess&apos;s Knight, you should solve it for your princess, can you do it?<br>","type":"description","format":"html"},{"title":"Input","content":"   The first line contains an integer T, denoting the number of the test cases.<br>   For each test case, the first line contains two integers n,k.<br>   The next n-1 lines, each contains two integers a and b, denote there is an edge between a and b.<br>   The next line contains n integers separated by a single space, denote each vertex&apos;s label in the order from 1 to n.<br><br>   <b>n,k &lt;= 300. label &lt;= 10^9.<br>   T &lt;= 20.</b>","type":"input_format","format":"html"},{"title":"Output","content":"   For each case, output the result.<br>   This problem is special judged. The relative error less than 1e-6 will be accepted.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n20 8\n2 1\n3 1\n4 1\n5 4\n6 3\n7 2\n8 4\n9 5\n10 5\n11 10\n12 11\n13 10\n14 11\n15 12\n16 12\n17 14\n18 13\n19 18\n20 17\n5 6 2 1 2 4 7 3 1 3 5 4 1 7 2 6 1 2 1 5 </div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5.7866158609</div></pre>","type":"example","format":"html"},{"title":"Author","content":"WJMZBMR","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+4&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 4 </a> ","type":"source","format":"html"}]}