{"title":"Robbery Plan","time_limit":3500,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4926","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4926&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4926","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4926"},"statement":[{"title":"Problem Description","content":"   As the chief consultant in the International Consulting Company, you&#x2019;re now enjoying such a high reputation in the industry that even the organizations underworld often come to you and ask for your suggestions. Professional as you are to your clients, you always try your best to help them and, certainly, make more profits for yourself. Money makes the mare go, and you&#x2019;re no exception either.<br><br>   But the shareholders of the company are always watching their profits as well. In order to protect the investors, they keep focusing on every project you take charge of. Once you receive money in a project, they will come immediately to you. If your profit is less than M dollars, they won&#x2019;t step in; but if the profit reaches M , they will meddle in and take away profits in unit of M as much as possible. (e.g. if you earn (2M + 1) or exactly 2M dollars, they will both take 2M away.)<br><br>   Now a big client comes. A famous robbery organization expects you to help them construct a robbery plan. The offer is so irresistible that you accept it immediately.<br><br>   Their targets are the banks in the city. Totally, there&#x2019;re K banks (numbered from 1 to K) that located at different areas, which produce different difficulties to rob them. The robbery team is made up of N people, and they have totally Q dollars as action funds. In a robbery, if they send p people and spend d dollars of funds to rob bank i, they will earn f<sub>i</sub>[p, d] in this action. Here, f<sub>i</sub>[p, d] is generated by<br>           f<sub>i</sub>[p, d] =0                                          (p &lt;= 0 or d &lt;= 0)<br>           f<sub>i</sub>[p, d] = f<sub>i</sub>[p - 1, d - e<sub>i</sub>] + f<sub>i</sub>[p - 1, d]&#xA0;&#xA0;         (1 &lt; p &lt;= N,1 &lt;= d &lt;= Q) <br>and f<sub>i</sub>[1, d] comes from<br>           f<sub>i</sub>[1, d] = A<sub>i</sub>f<sup>2</sup><sub>i</sub>[1, d - 1] + B<sub>i</sub>f<sub>i</sub>[1, d - 1] + C<sub>i</sub>&#xA0;&#xA0;     (1 &lt;= d &lt;= Q)<br>where e<sub>i</sub>, A<sub>i</sub>, B<sub>i</sub>, C<sub>i</sub> are coefficients given initially.<br><br>   The team is so professional (as you are) that the members always succeed in robberies. After they rob a bank and get the money, the team will divide it into (almost) equal parts and distribute them to you and everyone who participates in this action.  That is, if they send p men and rob X dollars, you&#x2019;ll receive <img style=\"max-width:100%;\" src=\"../../data/images/C507-1006-1.jpg\"> dollars immediately after the robbery on this bank. But at the time you receive the money, the damned shareholders will come and take away the part of theirs. <b>Only the remaining part belongs to you.</b><br><br>   You&#x2019;re now required to help them determine the plan. Note that the robberies won&#x2019;t take place simultaneously; and thus each person can rob several banks, but each bank can be robbed at most once (if we choose to rob it). The money they rob won&#x2019;t be added to their action funds afterwards. Your final profit equals to the sum of profits that belongs to you after each robbery (Note that your total profit will not be checked again by the shareholders, i.e. <b>your total profit may exceed</b> M ).<br><br>   Your target, professionally speaking, is to maximize the <b>total profit of yourself</b> after they finish robbing the banks according to your plan. Be careful of the annoying shareholders in the company!","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   The input consists of several test cases. The first line of input gives the number of test cases T (T&lt;=5).<br><br>For each test case:<br>   The first line consists of four integers N, Q, K(1&lt;=N&lt;=1000, 1&lt;=Q&lt;=20, 1&lt;=K&lt;=50) and M (1&lt;=M&lt;=10<sup>6</sup>).<br>   The following K lines describe the property of banks, where the ith line contains e<sub>i</sub>, A<sub>i</sub>, B<sub>i</sub>, C<sub>i</sub>(1&lt;=e<sub>i</sub>&lt;=Q, 1&lt;=A<sub>i</sub>, B<sub>i</sub>, C<sub>i</sub>&lt;=10<sup>9</sup>) in order.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each test case, output the maximum profits you can obtain in a line.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n80 10 1 1000000\n1 988123 894129 102939</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">999996</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"BUPT","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+6&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 6 </a> ","type":"source","format":"html","require":["katex"]}]}