{"title":"Fighting the Landlords","time_limit":1000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4930","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4930&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4930","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4930"},"statement":[{"title":"Problem Description","content":"   Fighting the Landlords is a card game which has been a heat for years in China. The game goes with the 54 poker cards for 3 players, where the &#x201C;Landlord&#x201D; has 20 cards and the other two (the &#x201C;Farmers&#x201D;) have 17.  The Landlord wins if he/she has no cards left, and the farmer team wins if either of the Farmer have no cards left. The game uses the concept of hands, and some fundamental rules are used to compare the cards. For convenience, here we only consider the following categories of cards:<br><br>   1.Solo: a single card. The priority is: Y (i.e. colored Joker) &gt; X (i.e. Black &amp; White Joker) &gt; 2 &gt; A (Ace) &gt; K (King) &gt; Q (Queen) &gt; J (Jack) &gt; T (10) &gt; 9 &gt; 8 &gt; 7 &gt; 6 &gt; 5 &gt; 4 &gt; 3. It&#x2019;s the basic rank of cards.<br><br>   2.Pair : two matching cards of equal rank (e.g. 3-3, 4-4, 2-2 etc.). Note that the two Jokers cannot form a Pair (it&#x2019;s another category of cards). The comparison is based on the rank of Solo, where 2-2 is the highest, A-A comes second, and 3-3 is the lowest.<br><br>   3.Trio: three cards of the same rank (e.g. 3-3-3, J-J-J etc.). The priority is similar to the two categories above: 2-2-2 &gt; A-A-A &gt; K-K-K &gt; . . . &gt; 3-3-3.<br><br>   4.Trio-Solo: three cards of the same rank with a Solo as the kicker. Note that the Solo and the Trio should be different rank of cards (e.g. 3-3-3-A, 4-4-4-X etc.). Here, the <b>Kicker&#x2019;s rank is irrelevant</b> to the comparison, and the Trio&#x2019;s rank determines the priority. For example, 4-4-4-3 &gt; 3-3-3-2.<br><br>   5.Trio-Pair : three cards of the same rank with a Pair as the kicker (e.g. 3-3- 3-2-2, J-J-J-Q-Q etc.). The comparison is as the same as Trio-Solo, where the Trio is the only factor to be considered. For example,4-4-4-5-5 &gt; 3-3-3-2-2. Note again, that two jokers cannot form a Pair.<br><br>   6.Four-Dual: four cards of the same rank with two cards as the kicker. Here, <b>it&#x2019;s allowed for the two kickers to share the same rank.</b> The four same cards dominates the comparison:  5-5-5-5-3-4 &gt; 4-4-4-4-2-2.<br><br>   In the categories above, a player can only beat the prior hand using of the same category but not the others. For example, only a prior Solo can beat a Solo while a Pair cannot. But there&#x2019;re exceptions:<br><br>   7.Nuke: X-Y (JOKER-joker). It can beat everything in the game.<br><br>   8.Bomb: 4 cards of the same rank. It can beat any other category except Nuke or another Bomb with a higher rank. The rank of Bombs follows the rank of individual cards: 2-2-2-2 is the highest and 3-3-3-3 is the lowest.<br><br>   Given the cards of both yours and the next player&#x2019;s, please judge whether you have a way to play a hand of cards that the next player cannot beat you <b>in this round.</b> If you no longer have cards after playing, we consider that he cannot beat you either. You may see the sample for more details.<br>","type":"description","format":"html"},{"title":"Input","content":"   The input contains several test cases. The number of test cases T (T&lt;=20) occurs in the first line of input.<br><br>   Each test case consists of two lines. Both of them contain a string indicating your cards and the next player&#x2019;s, respectively. The length of each string doesn&#x2019;t exceed 17, and <b>each single card will occur at most 4 times totally on two players&#x2019; hands except that the two Jokers each occurs only once.</b>","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, output Yes if you can reach your goal, otherwise output No.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n33A\n2\n33A\n22\n33\n22\n5559T\n9993</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes\nNo\nYes\nYes</div></pre>","type":"example","format":"html"},{"title":"Author","content":"BUPT","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+6&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 6 </a> ","type":"source","format":"html"}]}