{"title":"Poor Mitsui","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4957","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4957&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4957","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4957"},"statement":[{"title":"Problem Description","content":"Because of the mess Mitsui have made, (not too long ago, Mitsui, leading a group of bully guys, intended to make some trouble and damage to the basketball team.) he was punished to mop the floor this week. And he needs to get some water first.<br><br>He takes N broken buckets to get some water. When he turns on the water-tap, the water begins to fill in at a speed V unit water per second.(And this speed will always be V.) As the buckets is broken, when there is water in the bucket, water begins to flow away at a certain speed. Each bucket has its own speed. At a time, there can only be one bucket to receive water from the water-tap, but at the same time water still flows away from the buckets (those contains water at that moment). <br><br>We don&#x2019;t allow a bucket to receive water from the water-tap for more than once or receive water from other buckets. And we assume that Mitsui can change the position of the buckets in a very short time (we can ignore the time it takes) and the capacity of each backet is so large that it can&#x2019;t be fulfilled.<br><br>Now Mitsui wonders can there be a moment that each bucket is filled with a specific volunm of water. If it&#x2019;s possible, find the earliest one, otherwise he will just go home in a bad mood.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"This problem contains multiple tests.<br>The first line contains a number T (1 &#x2264; T &#x2264; 150), which tells the total number of test cases.<br>Each test consists of three lines, the first line contains two integers, N and V. (1 &#x2264; N &#x2264; 40, 1 &#x2264; V &#x2264; 40). N tells the number of buckets and V tells the speed of water come out of the water-tap. In the second line, there are N integers, Ai (1 &#x2264; Ai &#x2264; 40) is the speed of water flow away from the i-th bucket. In the third line, there are N interges, Bi (0 &#x2264; Bi &#x2264; 40) is the volunm of water that Mitsui wants the i-th bucket to contain at that special moment.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"This problem is intended to use special judge. But so far, BestCoder doesn&#x2019;t support special judge. So if it&#x2019;s possible for Mitsui to optimize his movement to make that happen, you should output a number which tells the earliest time that might happen since Mitsui turns on the water-tap, rounded it into an integer, otherwise just output -1 instead.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 3\n1 1 3\n2 2 2\n3 3\n1 1 1\n2 2 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">-1\n5\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In the first example, Mitsui can&#x2019;t make that happen no matter how he arranges the order of the buckets to receive water from the water-tap. So the answer is -1.\nIn the second example, Mitsui can make that happen in 4.75 seconds. And that is the optimal answer. So you should output 5. \nPlease note, If the accurate answer is X, you are recommended to  use printf(&#x201C;%.0f\\n&#x201D;, X) to output the answer in C++. </div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BestCoder+Round+%235&amp;source=1&amp;searchmode=source\"> BestCoder Round #5 </a> ","type":"source","format":"html","require":["katex"]}]}