{"title":"Closed Paths","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4962","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4962&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4962","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4962"},"statement":[{"title":"Problem Description","content":"   JFantasy has fallen in love with a beautiful girl (An ICPC volunteer?). Every afternoon, when the sun set, the girl comes out from her dorm, walks around the campus, and returns to her dorm. The girl&#x2019;s walking path can be considered as a closed polyline. A closed polyline is a curve specified by a sequence of points (P<sub>1</sub>, P<sub>2</sub>, &#x2026;, P<sub>n</sub>) so that the curve consists of the line segments P<sub>1</sub>P<sub>2</sub>, P<sub>2</sub>P<sub>3</sub>, &#x2026;, P<sub>n-1</sub>P<sub>n</sub>, P<sub>n</sub>P<sub>1</sub>. Note that two line segments may intersect, coincide or partially coincide with each other. The points P<sub>1</sub>, P<sub>2</sub>, &#x2026;, P<sub>n</sub> are also called vertices of the polyline. While the girl is walking along the path, JFantasy is standing at some point which is not lying on the path. During the girl&#x2019;s walking, the spoony boy rotates himself such that he can always see the girl directly in front of him. The boy may sometimes rotate counter-clockwise, and sometimes rotate clockwise. If the boy stands at point P, let AP denote the total degrees the boy rotate counter-clockwise, and BP denote the total degrees the boy rotate clockwise. It is not difficult to see that A<sub>P</sub> &#x2013; B<sub>P</sub> is a multiple of 360, because when the girl finishes walking, the boy faces in the same direction as when the girl starts walking. We define the rotation number of P to be (A<sub>P</sub> &#x2013; B<sub>P</sub>) / 360. <br><br>   LCQ is one of JFantasy&#x2019;s G (G for good) friends. He has found JFantasy&#x2019;s secret, and got an idea of making fun of him. He wants to put JFantasy at some point of which the rotation number is maximum given the walking path of the girl. To simplify the problem, we assume that the point where JFantasy can be put must be on a straight line. Formally, the problem can be stated as follows: Given the coordinates of (P<sub>1</sub>, P<sub>2</sub>, &#x2026;, P<sub>n</sub>), which specifies the girl&#x2019;s walking path, you are asked to find the largest possible rotation number among all the points that are on the X axis, but not on the girl&#x2019;s walking path.","type":"description","format":"html"},{"title":"Input","content":"   The input begins with a line containing an integer T (T&lt;=100), which indicates the number of test cases. Each case begins with a line containing an integer N (2&lt;=N&lt;=1000), indicating the number of vertices of the girl&#x2019;s walking path. The following N lines each contain two integers x<sub>i</sub>\u001f and y<sub>i</sub> (-1000&lt;= x<sub>i</sub>, y<sub>i</sub> &lt;=1000), indicating the coordinates of the ith vertex P<sub>i</sub>.","type":"input_format","format":"html"},{"title":"Output","content":"   For each case, output the largest possible rotation number in a line.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2\n1 2\n2 1\n6\n1 -1\n2 -1\n2 1\n3 1\n3 0\n1 0\n5\n1 1\n-1 0\n1 -1\n0 1\n0 -1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n0\n2</div></pre>","type":"example","format":"html"},{"title":"Author","content":"SYSU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+9&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 9 </a> ","type":"source","format":"html"}]}