{"title":"A simple dynamic programming problem","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4972","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4972&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4972","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4972"},"statement":[{"title":"Problem Description","content":"   Dragon is watching NBA. He loves James and Miami Heat.<br><br>   Here&apos;s an introduction of basketball game:http://en.wikipedia.org/wiki/Basketball. However the game in Dragon&apos;s version is much easier:<br><br>   &quot;There&apos;s two teams fight for the winner. The only way to gain scores is to throw the basketball into the basket. Each time after throwing into the basket, the score gained by the team is 1, 2 or 3. However due to the uncertain factors in the game, it&#xFFFD;&#xFFFD;s hard to predict which team will get the next goal&quot;.<br><br>   Dragon is a crazy fan of Miami Heat so that after each throw, he will write down the difference between two team&apos;s score regardless of which team keeping ahead. For example, if Heat&apos;s score is 15 and the opposite team&apos;s score is 20, Dragon will write down 5. On the contrary, if Heat has 20 points and the opposite team has 15 points, Dragon will still write down 5.<br><br>   Several days after the game, Dragon finds out the paper with his record, but he forgets the result of the game. It&apos;s also fun to look though the differences without knowing who lead the game, for there are so many uncertain! Dragon loves uncertain, and he wants to know how many <b>results</b> could the game has gone?<br>","type":"description","format":"html"},{"title":"Input","content":"   The first line of input contains only one integer T, the number of test cases. Following T blocks, each block describe one test case.<br><br>   For each test case, the first line contains only one integer N(N&lt;=100000), which means the number of records on the paper. Then there comes a line with N integers (a<sub>1</sub>, a<sub>2</sub>, a<sub>3</sub>, ... , a<sub>n</sub>). a<sub>i</sub> means the number of i-th record.","type":"input_format","format":"html"},{"title":"Output","content":"   Each output should occupy one line. Each line should start with &quot;Case #i: &quot;, with i implying the case number. Then for each case just puts an integer, implying the number of <b>result</b> could the game has gone.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2\n2 3\n4\n1 3 5 7</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 2\nCase #2: 2</div></pre>","type":"example","format":"html"},{"title":"Author","content":"BJTU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+10&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 10 </a> ","type":"source","format":"html"}]}