{"title":"A simple water problem","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=4974","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=4974&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=4974","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=4974"},"statement":[{"title":"Problem Description","content":"   Dragon is watching competitions on TV. Every competition is held between two competitors, and surely Dragon&apos;s favorite. After each competition he will give a score of either 0 or 1 for each competitor and add it to the total score of that competitor. The total score begins with zero. Here&apos;s an example: four competitors with name James, Victoria, Penghu, and Digo. First goes a competition between Penghu and Digo, and Dragon enjoys the competition and draw both 1 score for them. Then there&#x2019;s a competition between James and Victoria, but this time Dragon draw 1 for Victoria and 0 for James. Lastly a competition between James and Digo is held, but this time Dragon really dislike the competition and give zeroes for each of them. Finally we know the score for each one: James--0, Victoria--1, Penghu--1, Digo--1. All except James are the Winner!<br><br>   However, Dragon&apos;s mom comes back home again and close the TV, driving Dragon to his homework, and find out the paper with scores of all competitors. Dragon&apos;s mom wants to know how many competition Dragon watched, but it&apos;s hard through the paper. Here comes the problem for you, given the scores of all competitors, at least how many competitions had Dragon watched?","type":"description","format":"html"},{"title":"Input","content":"   The first line of input contains only one integer T(&lt;=10), the number of test cases. Following T blocks, each block describe one test case.<br><br>   For each test case, the first line contains only one integers N(&lt;=100000), which means the number of competitors. Then a line contains N integers (a<sub>1</sub>,a<sub>2</sub>,a<sub>3</sub>,...,a<sub>n</sub>).a<sub>i</sub>(&lt;=1000000) means the score of i-th competitor.","type":"input_format","format":"html"},{"title":"Output","content":"   Each output should occupy one line. Each line should start with &quot;Case #i: &quot;, with i implying the case number. Then for each case just puts a line with one integer, implying the competition at least should be watched by dragon.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\n2 3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 5</div></pre>","type":"example","format":"html"},{"title":"Author","content":"BJTU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Multi-University+Training+Contest+10&amp;source=1&amp;searchmode=source\"> 2014 Multi-University Training Contest 10 </a> ","type":"source","format":"html"}]}