{"title":"Tree","time_limit":8000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5002","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5002&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5002","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5002"},"statement":[{"title":"Problem Description","content":"You are given a tree with N nodes which are numbered by integers 1..N. Each node is associated with an integer as the weight.<br><br>Your task is to deal with M operations of 4 types:<br><br>1.Delete an edge (x, y) from the tree, and then add a new edge (a, b). We ensure that it still constitutes a tree after adding the new edge.<br><br>2.Given two nodes a and b in the tree, change the weights of all the nodes on the path connecting node a and b (including node a and b) to a particular value x.<br><br>3.Given two nodes a and b in the tree, increase the weights of all the nodes on the path connecting node a and b (including node a and b) by a particular value d.<br><br>4.Given two nodes a and b in the tree, compute the second largest weight on the path connecting node a and b (including node a and b), and the number of times this weight occurs on the path. Note that here we need the strict second largest weight. For instance, the strict second largest weight of {3, 5, 2, 5, 3} is 3.","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T (T&lt;=3), which means there are T test cases in the input.<br><br>For each test case, the first line contains two integers N and M (N, M&lt;=10^5). The second line contains N integers, and the i-th integer is the weight of the i-th node in the tree (their absolute values are not larger than 10^4).<br><br>In next N-1 lines, there are two integers a and b (1&lt;=a, b&lt;=N), which means there exists an edge connecting node a and b.<br><br>The next M lines describe the operations you have to deal with. In each line the first integer is c (1&lt;=c&lt;=4), which indicates the type of operation.<br><br>If c = 1, there are four integers x, y, a, b (1&lt;= x, y, a, b &lt;=N) after c.<br>If c = 2, there are three integers a, b, x (1&lt;= a, b&lt;=N, |x|&lt;=10^4) after c.<br>If c = 3, there are three integers a, b, d (1&lt;= a, b&lt;=N, |d|&lt;=10^4) after c.<br>If c = 4 (it is a query operation), there are two integers a, b (1&lt;= a, b&lt;=N) after c.<br><br>All these parameters have the same meaning as described in problem description.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, first output &quot;Case #x:&quot;&quot; (x means case ID) in a separate line.<br><br>For each query operation, output two values: the second largest weight and the number of times it occurs. If the weights of nodes on that path are all the same, just output &quot;ALL SAME&quot; (without quotes).","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 2\n1 1 2\n1 2\n1 3\n4 1 2\n4 2 3\n7 7\n5 3 2 1 7 3 6\n1 2\n1 3\n3 4\n3 5\n4 6\n4 7\n4 2 6\n3 4 5 -1\n4 5 7\n1 3 4 2 4\n4 3 6\n2 3 6 5\n4 3 6</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\nALL SAME\n1 2\nCase #2:\n3 2\n1 1\n3 2\nALL SAME</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Anshan+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Anshan Online </a> ","type":"source","format":"html"}]}