{"title":"Compromise","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5005","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5005&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5005","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5005"},"statement":[{"title":"Problem Description","content":"Xiaoqiang and Amoeba (AMB for short) are good friends. Friends as they are, they are inevitably self-centered beings. So their life together is full of concession and compromise. To further promote their ongoing relationship, Xiaoqiang studies his interaction with AMB from a game theoretical perspective. He views his everyday life with AMB as a game.<br><br>The game has N &quot;nodes&quot; corresponding to different &quot;states&quot; of life. Each node has several outgoing &quot;edges&quot; representing &quot;actions&quot;. A node either belongs to Xiaoqiang or AMB. The nodes and edges form a connected DAG (Directed Acyclic Graph, a graph without cycles). Each node without outgoing edges has two &quot;utility&quot; values for Xiaoqiang and AMB respectively.<br><br>For example, consider the following game:<br>&#xFFFD;&#xFFFD; Node S: The day begins. AMB has two actions leading to A and B respectively.<br>&#xFFFD;&#xFFFD; Node A: AMB goes to University P. Xiaoqiang has two actions leading to C and D respectively.<br>&#xFFFD;&#xFFFD; Node B: AMB goes to University T. Xiaoqiang has two actions leading to D and E respectively.<br>&#xFFFD;&#xFFFD; Node C: Xiaoqiang and AMB both go to University P. AMB&apos;s utility is 102, Xiaoqiang&apos;s utility is 99.<br>&#xFFFD;&#xFFFD; Node D: Xiaoqiang and AMB go to different universities. AMB&apos;s utility is 51, Xiaoqiang&apos;s utility is 0.<br>&#xFFFD;&#xFFFD; Node E: Xiaoqiang and AMB both go to University T. AMB&apos;s utility is 100, Xiaoqiang&apos;s utility is 101.<br><br>Life starts from Node S. At each node, either Xiaoqiang or AMB can take an action. Xiaoqiang&apos;s aim is to maximize his own utility (and cares nothing about AMB) and AMB&apos;s aim is also to maximize his own utility.<br><br>AMB thinks, if he goes to node A then Xiaoqiang&apos;s best response will be going to node C and he can happily live in University P with Xiaoqiang. In this case AMB&apos;s utility is 102 and Xiaoqiang&apos;s is 99. Xiaoqiang is not satisfied with this, but it seems there is nothing Xiaoqiang can do about this. This is the so called Nash Equilibrium.<br><br>Until one day Xiaoqiang claims (or, to be exact, swears): &quot;Listen, I was attacked by a paramecium and I became insane. If I am in Node B, I will surely go to Node E. But if I am in Node A, I will go to Node D without hesitation.&quot; In this way, he reveals his whole strategy to AMB, which encodes for each node what Xiaoqiang will do if he arrives at the node. Notice that in this strategy Xiaoqiang&apos;s action (going to University T) at a node does not depend on which path is used to arrive at the node. This strategy is not rational, because at Node A Xiaoqiang&apos;s best action should be going to Node C.<br><br>But Xiaoqiang makes his claim in such a convincing voice that AMB believes that Xiaoqiang will follow this strategy at all cost however irrational it is. Then AMB finds out that his best strategy will be going to node B, and they will end up at Node E. In this case, Xiaoqiang&apos;s utility is 101. Notice that Xiaoqiang must keep his words after the claim. That is, after the claim Xiaoqiang&apos;s strategy is fixed, and AMB will make decisions to maximize his own utility provided Xiaoqiang&apos;s strategy.<br><br>Given a game, you are to determine:<br>(1) Xiaoqiang&apos;s best utility if he cannot make the claim.<br>(2) Xiaoqiagn&apos;s best utility if he can make the claim.<br>To make things simple, all utility values are distinct.<br><br>Remark: The real world situation is, Xiaoqiang and AMB are currently in Node D because AMB failed to get himself to University T through the entrance exam.","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T, denoting the number of the test cases.<br><br>Each test case begins with one integer N, the number of nodes. 1&lt;=N&lt;=200. Life starts from the first node.<br><br>Then follows N lines. Each line begins with an integer M indicating the number of actions. 0&lt;=M&lt;N<br><br>If M is nonzero, M integers follow. Each integer (in range [1, N]) represents the destination of an outgoing edge. At the end of the line is a character being either &apos;A&apos; or &apos;X&apos; describing whether this node belongs to AMB or Xiaoqiang.<br><br>If M is zero, two integers follow representing AMB&apos;s utility and Xiaoqiang&apos;s utility respectively. Utility values are in range [0, 10000] and are distinct.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one line containing two integers representing the answers separated by a space.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n6\n2 5 6 A\n0 102 99\n0 50 0\n0 100 101\n2 2 3 X\n2 3 4 X</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">99 101</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Anshan+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Anshan Online </a> ","type":"source","format":"html"}]}