{"title":"Wang Xifeng's Little Plot","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5024","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5024&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5024","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5024"},"statement":[{"title":"Problem Description","content":"   &#xFFFD;&#xFFFD;Dream of the Red Chamber&#xFFFD;&#xFFFD;(also &#xFFFD;&#xFFFD;The Story of the Stone&#xFFFD;&#xFFFD;) is one of the Four Great Classical Novels of Chinese literature, and it is commonly regarded as the best one. This novel was created in Qing Dynasty, by Cao Xueqin. But the last 40 chapters of the original version is missing, and that part of current version was written by Gao E. There is a heart breaking story saying that after Cao Xueqin died, Cao&apos;s wife burned the last 40 chapter manuscript for heating because she was desperately poor. This story was proved a rumor a couple of days ago because someone found several pages of the original last 40 chapters written by Cao. <br><br>   In the novel, Wang Xifeng was in charge of Da Guan Yuan, where people of Jia family lived. It was mentioned in the newly recovered pages that Wang Xifeng used to arrange rooms for Jia Baoyu, Lin Daiyu, Xue Baochai and other teenagers. Because Jia Baoyu was the most important inheritor of Jia family, and Xue Baochai was beautiful and very capable , Wang Xifeng didn&apos;t want Jia Baoyu to marry Xue Baochai, in case that Xue Baochai might take her place. So, Wang Xifeng wanted Baoyu&apos;s room and Baochai&apos;s room to be located at two ends of a road, and this road should be as long as possible. But Baoyu was very bad at directions, and he demanded that there could be at most one turn along the road from his room to Baochai&apos;s room, and if there was a turn, that turn must be ninety degree. There is a map of Da Guan Yuan in the novel, and redists (In China English, one whose job is studying &#xFFFD;&#xFFFD;Dream of the Red Chamber&#xFFFD;&#xFFFD;is call a &quot;redist&quot;) are always arguing about the location of Baoyu&apos;s room and Baochai&apos;s room. Now you can solve this big problem and then become a great redist.","type":"description","format":"html"},{"title":"Input","content":"   The map of Da Guan Yuan is represented by a matrix of characters &apos;.&apos; and &apos;#&apos;.  A &apos;.&apos; stands for a part of road, and a &apos;#&apos; stands for other things which one cannot step onto. When standing on a &apos;.&apos;,  one can go to adjacent &apos;.&apos;s through 8 directions: north, north-west, west, south-west, south, south-east,east and north-east.<br><br>   There are several test cases.<br><br>   For each case, the first line is an integer N(0&lt;N&lt;=100) ,meaning the map is a N &#xFFFD;&#xFFFD; N matrix.<br><br>   Then the N &#xFFFD;&#xFFFD; N matrix follows.<br><br>   The input ends with N = 0.","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, print the maximum length of the road which Wang Xifeng could find to locate Baoyu and Baochai&apos;s rooms. A road&apos;s length is the number of &apos;.&apos;s it includes. It&apos;s guaranteed that for any test case, the maximum length is at least 2.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n#.#\n##.\n..#\n3\n...\n##.\n..#\n3\n...\n###\n..#\n3\n...\n##.\n...\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n4\n3\n5</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Guangzhou+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Guangzhou Online </a> ","type":"source","format":"html"}]}