{"title":"Saving Tang Monk","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5025","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5025&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5025","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5025"},"statement":[{"title":"Problem Description","content":"   &#x300A;Journey to the West&#x300B;(also &#x300A;Monkey&#x300B;) is one of the Four Great Classical Novels of Chinese literature. It was written by Wu Cheng&apos;en during the Ming Dynasty. In this novel, Monkey King Sun Wukong, pig Zhu Bajie and Sha Wujing, escorted Tang Monk to India to get sacred Buddhism texts. <br><br>   During the journey, Tang Monk was often captured by demons. Most of demons wanted to eat Tang Monk to achieve immortality, but some female demons just wanted to marry him because he was handsome. So, fighting demons and saving Monk Tang is the major job for Sun Wukong to do.<br><br>   Once, Tang Monk was captured by the demon White Bones. White Bones lived in a palace and she cuffed Tang Monk in a room. Sun Wukong managed to get into the palace. But to rescue Tang Monk, Sun Wukong might need to get some keys and kill some snakes in his way.<br><br>   The palace can be described as a matrix of characters. Each character stands for a room. In the matrix, &apos;K&apos; represents the original position of Sun Wukong, &apos;T&apos; represents the location of Tang Monk and &apos;S&apos; stands for a room with a snake in it. Please note that there are only one &apos;K&apos; and one &apos;T&apos;, and at most five snakes in the palace. And, &apos;.&apos; means a clear room as well &apos;#&apos; means a deadly room which Sun Wukong couldn&apos;t get in.<br><br>   There may be some keys of different kinds scattered in the rooms, but there is at most one key in one room. There are at most 9 kinds of keys. A room with a key in it is represented by a digit(from &apos;1&apos; to &apos;9&apos;). For example, &apos;1&apos; means a room with a first kind key, &apos;2&apos; means a room with a second kind key, &apos;3&apos; means a room with a third kind key... etc. To save Tang Monk, Sun Wukong must get ALL kinds of keys(in other words, at least one key for each kind).<br><br>   For each step, Sun Wukong could move to the adjacent rooms(except deadly rooms) in 4 directions(north, west, south and east), and each step took him one minute. If he entered a room in which a living snake stayed, he must kill the snake. Killing a snake also took one minute. If Sun Wukong entered a room where there is a key of kind N, Sun would get that key if and only if he had already got keys of kind 1,kind 2 ... and kind N-1. In other words, Sun Wukong must get a key of kind N before he could get a key of kind N+1 (N&gt;=1). If Sun Wukong got all keys he needed and entered the room in which Tang Monk was cuffed, the rescue mission is completed. If Sun Wukong didn&apos;t get enough keys, he still could pass through Tang Monk&apos;s room. Since Sun Wukong was a impatient monkey, he wanted to save Tang Monk as quickly as possible. Please figure out the minimum time Sun Wukong needed to rescue Tang Monk.","type":"description","format":"html"},{"title":"Input","content":"   There are several test cases.<br><br>   For each case, the first line includes two integers N and M(0 &lt; N &lt;= 100, 0&lt;=M&lt;=9), meaning that the palace is a N&#xD7;N matrix and Sun Wukong needed M kinds of keys(kind 1, kind 2, ... kind M). <br><br>   Then the N &#xD7; N matrix follows.<br><br>   The input ends with N = 0 and M = 0.","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, print the minimum time (in minutes) Sun Wukong needed to save Tang Monk. If it&apos;s impossible for Sun Wukong to complete the mission, print &quot;impossible&quot;(no quotes). ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 1\nK.S\n##1\n1#T\n3 1\nK#T\n.S#\n1#.\n3 2\nK#T\n.S.\n21.\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5\nimpossible\n8</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Guangzhou+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Guangzhou Online </a> ","type":"source","format":"html"}]}