{"title":"Cowboy","time_limit":9000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5034","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5034&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5034","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5034"},"statement":[{"title":"Problem Description","content":"   There are N cowboys in the arena, tagged with 1 to N. The arena can be considered as an N * N grid.<br><br>   At first, every cowboy is standing on a grid point (lower left point is (1,1) and upper right is (N,N)). <br><br>   Then the god named Matt will give M orders to the cowboys. All orders look like this: <b>(i,dir,distance)</b> which means the i-th cowboy moving <b>distance</b> step in <b>dir</b> direction.<br><br>   And <b>dir</b> will be:<br><br>    &#x25CF; &apos;1&apos; for East  ((x,y)-&gt;(x + 1, y) for one step)<br>    &#x25CF; &apos;2&apos; for North ((x,y)-&gt;(x, y + 1) for one step)<br>    &#x25CF; &apos;3&apos; for West  ((x,y)-&gt;(x - 1, y) for one step)<br>    &#x25CF; &apos;4&apos; for South ((x,y)-&gt;(x, y - 1) for one step)<br><br>   Since the cowboys can&apos;t get out of the arena, they will stop moving if they reach the boundary of the arena.<br><br>   The cowboys are so aggressive that they always want to duel, but only the one that is moving can duel another cowboy. If a cowboy A is given an order, he will first turn his direction to the moving direction.<br><br>   Then A will look at both his left hand direction and right hand direction, and the point now he is standing. If someone B is insight, A and B will have a duel, and  the one with a smaller tag number will be the winner and loser will leave the arena, and A will stop moving immediately.<br><br>   If no one is insight, A will go one step and start looking again. The process will stop if someone is insight, or A has moved for &apos;distance&apos; steps and no one is insight.<br><br>   Since the Cowboys&apos; eyesight is not so good, they can only see someone if the distance between them is no more than D.<br><br>   Since all cowboys are confident, if there are more than one cowboy insight, they will choose to duel the one with the smallest tag number.<br><br>   Furthermore, Matt will give an order only if the previous cowboy has stopped. It&apos;s possible for more than one cowboy on one point. Nothing will happen if Matt gives an order to a cowboy that has left the arean.<br><br>   Now, given the initial location of the cowboys and the orders, we want to know the final situation of the arena.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   The first line of the input contains an integer T, denoting the number of testcases. Then T test cases follow.<br><br>   For each test case, the first line contains three integers:N,M,D(1&lt;=N&lt;= 50000,M&lt;=50000,0&lt;=D).<br><br>   In the following N lines, the i-th line contains two integers:X,Y (1&lt;=X, Y &lt;=N) indicating the initial location of the i-th cowboy.<br><br>   In the following M lines, the i-th line contains three integers:I,Dir,Dis(1&lt;=I &lt;=N, 1&lt;=Dir&lt;=4, 0&lt;=Dis&lt;=N) indicating the i-th order given by Matt.<br><br>   All the numbers appears in the input will not exceed 10^9.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each test case, first output one line &quot;Case #x:&quot;, where x is the case number (starting from 1).<br><br>   Then for each cowboy that has not left the arena, output his tag number and final location in one line(Output in tag number order).","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5 2 1\n1 1\n5 5\n1 5\n5 1\n3 3\n5 4 1\n1 1 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n1 3 1\n2 5 5\n3 1 5\n4 5 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Beijing+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Beijing Online </a> ","type":"source","format":"html","require":["katex"]}]}