{"title":"Hilarity","time_limit":6000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5039","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5039&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5039","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5039"},"statement":[{"title":"Problem Description","content":"   After June 1st, elementary students of Ted Land are still celebrating &quot;The Sacred Day of Elementary Students&#x201D;. They go to the streets and do some elementary students stuff. So we call them &quot;elementary students&quot;. There are N cities in Ted Land. But for simplicity, the mayor Matt only built N - 1 roads so that all cities can reach each other. Some of the roads are occupied by the &quot;elementary students&quot;. They will put an celebration hat on everyone who goes through the road without one. But if someone goes through the road with a celebration hat on his head, &quot;elementary students&quot; will steal the hat for no reason. Since Matt doesn&#x2019;t have a celebration hat, he wants to know how many different paths in his land that he can end up with a hat. Two paths are considered to be different if and only if they have different start city or end city. As the counsellor of the mayor Matt, you have to answer this question for him. The celebration elementary students are not stable: sometimes a new crowd of elementary students go to an empty road; sometimes the elementary students on a road will go back home and remain the road empty. Matt will send you the monitor about the change of elementary students on road and ask you the question above. You will be fired if you answer wrong.","type":"description","format":"html"},{"title":"Input","content":"   The first line of the input contains an integer T, denoting the number of testcases. Then T test cases follow.<br><br>   For each test case, the first line contains N (1&lt;=N&lt;=30000) describing the number of cities.<br><br>   Then N lines follow. The ith line of these contains the name of the ith city, it&#x2019;s a string containing only letters and will not be longer than 10.<br><br>   The following N - 1 lines indicate the N - 1 edges between cities. Each of these lines will contain two strings for the cities&#x2019; name and a integer for the initial status of the edge (0 for empty, 1 for crowded).<br><br>   Then an integer M (1&lt;=M&lt;=60000) describes the number of queries. There are two kinds of query:<br><br>   &#x25CF; &quot;M i&quot; means the status changing of the ith (starting from 1) road (0 to 1, 1 to 0);<br>   &#x25CF; &quot;Q&quot; means that Matt asks you the number of different paths.","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, first output one line &#x201C;Case #x:&#x201D;, where x is the case number (starting from 1).<br><br>   Then for each &#x201C;Q&#x201D; in input, output a line with the answer.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n5\na\nb\nc\nd\ne\na b 1\nb c 0\nc d 1\nd e 1\n7\nQ\nM 1\nQ\nM 3\nQ\nM 4\nQ</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n12\n8\n8\n0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Beijing+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Beijing Online </a> ","type":"source","format":"html"}]}