{"title":"Escape","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5043","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5043&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5043","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5043"},"statement":[{"title":"Problem Description","content":"   As a young man, Al was a skilled artist, a potter with a wife and two fine sons. One night, his older son developed a severe stomachache. Thinking it was only some common intestinal isorder, neither Al nor his wife took the condition very seriously. But the boy died suddenly that night.<br><br>   Knowing the death could have been avoided if he had only realized the seriousness of the situation, he always felt he was guilty. To make matters worse, his wife left him a short time later, leaving him alone with his six-year-old younger son. The hurt and pain of the two situations were more than Al could stand, and he turned to alcohol for help.  In time Al became an alcoholic.<br><br>   As the alcoholism progressed, AL began to lose everything he possessed &#x2013; his land, house, etc. Finally Al died alone in a small bar. Hearing of Al&#x2019;s death, I thought, &#x201C;What a totally wasted life! What a complete failure! &#x201D;<br><br>   As time went by, I began to revalue my earlier rough judgement. I knew Al&#x2019;s now adult son, Ernie. He is one of the kindest, most caring, most loving men I have ever known. I saw the love between Ernie and his children, thinking that kindness and caring had to come from somewhere.<br><br>   I hadn&#x2019;t heard Ernie talked much about his father. One day, I worked up my courage to ask him what on earth his father had done so that he became such a special person. Ernie said quietly, &#x201C;As a child until I left home at 18&#x201D;, Al came into my room every night, gave me a kiss and said, &#x201C;love you, son.&#x201D;<br><br>   Tears came to my eyes as I realized what I had been a fool to judge Al as a failure. He had not left any material possessions behind. But he had been a kind loving father, and left behind his best love.<br><br>   wuyiqi trapped in a maze again. He want to escape from the maze. He face a problem:<br><br>   <b>put k<sub>1</sub> + k<sub>2</sub> + ... + k<sub>N</sub> different balls into N different boxes, the first box must contain k<sub>1</sub> balls, the second box must contain k<sub>2</sub> balls, and so on. What is the number of division modulo P (P is a prime.)..</b><br><br>   This problem is too easy. wuyiqi can solve it very fast.<br><br>   But wuyiqi can not escape from the maze, he must solve a hard problem.<br><br>   Now there is the problem:<br><br>   Given the N and P as mentioned above.<br><br>   wuyiqi should gives the {k<sub>1</sub>, k<sub>2</sub>, ...k<sub>N</sub> }make the above problem&#x2019;s answer is zero.<br><br>   And restriction conditions are 0 &#x2264; k<sub>1</sub> &#x2264; K<sub>1</sub>, 0 &#x2264; k<sub>2</sub> &#x2264; K<sub>2</sub>, ..., 0 &#x2264; k<sub>N</sub> &#x2264; K<sub>N</sub> , of course they are all integers, and at least one of which is not zero.<br><br>   wuyiqi want you to calculate how many {k<sub>1</sub>, k<sub>2</sub>, ...k<sub>N</sub> } meet the conditions.","type":"description","format":"html"},{"title":"Input","content":"   The first line of the input is T (1 &#x2264; T &#x2264; 50), which stands for the number of test cases you need to solve.<br><br>   For each case, there are two lines.<br><br>   The first line of each case contains two integers N ,P (1 &#x2264; N &#x2264; 10, 1 &#x2264; P &#x2264; 20),as explained above, and the P is a prime.<br><br>   The second line contains N integers, K<sub>1</sub>, K<sub>2</sub>, ..., K<sub>N</sub> (1 &#x2264; K<sub>i</sub> &#x2264; 10<sup>9</sup>).","type":"input_format","format":"html"},{"title":"Output","content":"   For each case, you should output a single line, first output &#x201C;Case #t: &#x201D;, where t indicating the case number between 1 and T . Then a single integer follows, indicating the answer module 100000009.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2 3\n1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 1\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>For the &#xFB01;rst case, among {0, 1},{0, 2},{1, 0},{1, 1},{1, 2}, there is only {1, 2} meet the conditions.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+ACM%2FICPC+Asia+Regional+Shanghai+Online&amp;source=1&amp;searchmode=source\"> 2014 ACM/ICPC Asia Regional Shanghai Online </a> ","type":"source","format":"html"}]}