{"title":"Harry And Dig Machine","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5067","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5067&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5067","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5067"},"statement":[{"title":"Problem Description","content":"&#xA0;&#xA0;As we all know, Harry Porter learns magic at Hogwarts School. However, learning magical knowledge alone is insufficient to become a great magician. Sometimes, Harry also has to gain knowledge from other certain subjects, such as language, mathematics, English, and even algorithm. <br>&#xA0;&#xA0;Dumbledore, the headmaster of Hogwarts, is planning to construct a new teaching building in his school. The area he selects can be considered as an n*m grid, some (but no more than ten) cells of which might contain stones. We should remove the stones there in order to save place for the teaching building. However, the stones might be useful, so we just move them to the top-left cell. Taking it into account that Harry learned how to operate dig machine in Lanxiang School several years ago, Dumbledore decides to let him do this job and wants it done as quickly as possible. Harry needs one unit time to move his dig machine from one cell to the adjacent one. Yet skilled as he is, it takes no time for him to move stones into or out of the dig machine, which is big enough to carry infinite stones. Given Harry and his dig machine at the top-left cell in the beginning, if he wants to optimize his work, what is the minimal time Harry needs to finish it?","type":"description","format":"html"},{"title":"Input","content":"They are sever test cases, you should process to the end of file.<br>For each test case, there are two integers n and m.$(1 \\leq n, m \\leq 50)$.<br>The next n line, each line contains m integer. The j-th number of $i_{th}$ line a[i][j] means there are a[i][j] stones on the $j_{th}$ cell of the $i_{th}$ line.( $0 \\leq a[i][j] \\leq 100$ , and no more than 10 of a[i][j] will be positive integer).","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, just output one line that contains an integer indicate the minimal time that Harry can finish his job.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n0 0 0\n0 100 0\n0 0 0\n2 2\n1 1\n1 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BestCoder+Round+%2314&amp;source=1&amp;searchmode=source\"> BestCoder Round #14 </a> ","type":"source","format":"html"}]}