{"title":"Harry And Math Teacher","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5068","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5068&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5068","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5068"},"statement":[{"title":"Problem Description","content":"As we all know, Harry Porter learns magic at Hogwarts School. However, learning magical knowledge alone is insufficient to become a great magician. Sometimes, Harry also has to gain knowledge from other certain subjects, such as language, mathematics, English, and even algorithm. <br>In Hogwarts, there is a tall castle in which all teachers live. The castle is rather special. In every floor there are two doors, behind each of them there existing two stairs to the next floor&#xFFFD;&#xFFFD;s two doors. And if you are at the i-th floor&#xFFFD;&#xFFFD;s j-th door , then you can just go to the next floor from this door. However, something even more interesting (or we can say &quot;magic&quot;) can happen to the stairs: sometimes they break into pieces (making it impossible to go to the next floor), and sometimes the fragments can joint together and become the whole stair again. Now suppose Harry is in the a-th floor (you know, Harry is the hero, so he lives in the teachers&#xFFFD;&#xFFFD; building somehow), and his math teacher b-th floor. Sometimes the math teacher will call Harry to his room. Facing these magic stairs, Harry gets puzzled how he can go to see the math teacher. Can you help Harry figure out how many ways exactly he can choose without going backwards? You can assume that the change of the stairs will not happen when Harry is on his way. Harry can begin at any doors in floor a and he can end at any doors in floor b. And as Harry want to arrive as soon as possible, so he can not go back to the past. And at the beginning all the stairs are intact. And the answer may be too large, you should output the answer mod 1000000007.","type":"description","format":"html"},{"title":"Input","content":"They are sever test cases, you should process to the end of file.<br>For each test case, there are two integers n and $m(2 \\leq n \\leq 50000, 1 \\leq m \\leq 50000)$ in the first line, indicate the number of the castle&#xFFFD;&#xFFFD;s layers and the number of queries. And the following m lines, each line contains three or four integers. If the first integer op equals 0, there are two integers a and b ($1 \\leq a &lt; b \\leq n$) follow, indicate the position of Harry and math teacher. Otherwise, there are three integers $x, y, z (1 \\leq x &lt; n, 1 \\leq y, z \\leq 2)$follow, it means that the stair between the $x_{th}$ floor&#xFFFD;&#xFFFD;s $y_{th}$ door and the $(x+1)_{th}$ floor&#xFFFD;&#xFFFD;s z-th door changes its state(if it is intact, then it breaks else it joints).","type":"input_format","format":"html"},{"title":"Output","content":"For each query, if op equals 0, you should output one line that contains an integer indicates the number of ways from $a_{th}$ floor to the $b_{th}$ floor.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 1\n0 1 3\n3 2\n1 2 1 1\n0 1 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8\n6</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BestCoder+Round+%2314&amp;source=1&amp;searchmode=source\"> BestCoder Round #14 </a> ","type":"source","format":"html"}]}