{"title":"Chat","time_limit":1000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5071","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5071&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5071","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5071"},"statement":[{"title":"Problem Description","content":"As everyone knows, DRD has no girlfriends. But as everyone also knows, DRD&#xFFFD;&#xFFFD;s friend ATM&#xFFFD;&#xFFFD;s friend CLJ has many potential girlfriends.  One evidence is CLJ&#xFFFD;&#xFFFD;s chatting record.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C549-1001-1.jpg\"></center><br>CLJ chats with many girls all the time. Sometimes he begins a new conversation and sometimes he ends a conversation. Sometimes he chats with the girl whose window is on the top.<br><br>You can imagine CLJ&#xFFFD;&#xFFFD;s windows as a queue. The first girl in the queue is the top girl if no one is &#xFFFD;&#xFFFD;always on top &#xFFFD;&#xFFFD;.<br><br>Since CLJ is so popular, he begins to assign a unique positive integer as priority for every girl. The higher priority a girl has, the more CLJ likes her. For example, GYZ has priority 10<sup>9</sup>, and JZP has priority 10<sup>8</sup> while Sister Soup has priority 1, and Face Face has priority 2.<br><br>As a famous programmer, CLJ leads a group to implement his own WM(window manager). The WM will log CLJ&#xFFFD;&#xFFFD;s operations. Now you are supposed to implement the log system. The general logging format is &#xFFFD;&#xFFFD;Operation #X: LOGMSG.&#xFFFD;&#xFFFD;, where X is the number of the operation and LOGMSG is the logging message.<br><br>There are several kinds of operations CLJ may use:<br><br>   1.<b>Add u:</b>  CLJ opens a new window whose priority is u, and the new window will be the last window in the window queue.  This operation will always be successful except the only case in which there is already a window with priority u. If it is successful, LOGMSG will be &#xFFFD;&#xFFFD;success&#xFFFD;&#xFFFD;. Otherwise LOGMSG will be &#xFFFD;&#xFFFD;same priority&#xFFFD;&#xFFFD;.<br><br>   2.<b>Close u:</b>  CLJ closes a window whose priority is u. If there exists such a window, the operation will be successful and LOGMSG will be &#xFFFD;&#xFFFD;close u with c&#xFFFD;&#xFFFD;, where u is the priority and c is the number of words CLJ has spoken to this window. Otherwise, LOGMSG will be &#xFFFD;&#xFFFD;invalid priority&#xFFFD;&#xFFFD;. Note that ANY window can be closed.<br><br>   3.<b>Chat w:</b>  CLJ chats with the top window, and he speaks w words. The top window is the first window in the queue, or the &#xFFFD;&#xFFFD;always on top&#xFFFD;&#xFFFD; window (as described below) instead if there exists. If no window is in the queue, LOGMSG will be &#xFFFD;&#xFFFD;empty&#xFFFD;&#xFFFD;, otherwise the operation can be successful and LOGMSG will be &#xFFFD;&#xFFFD;success&#xFFFD;&#xFFFD;.<br><br>   4.<b>Rotate x:</b>  CLJ performs one or more  Alt-Tabs  to  move  the  x-th  window  to  the  first  one  in  the queue. For example, if there are 4 windows in the queue, whose priorities are 1, 3, 5, 7 respectively and CLJ performs &#xFFFD;&#xFFFD;Rotate 3&#xFFFD;&#xFFFD;, then  the  window&#xFFFD;&#xFFFD;s  priorities  in  the  queue will  become  5, 1, 3, 7. Note that if CLJ wants to move the first window to the head, this operation is still considered &#xFFFD;&#xFFFD;successful&#xFFFD;&#xFFFD;. If x is out of range (smaller than 1 or larger than the size of the queue), LOGMSG will be &#xFFFD;&#xFFFD;out of range&#xFFFD;&#xFFFD;. Otherwise LOGMSG should be &#xFFFD;&#xFFFD;success&#xFFFD;&#xFFFD;.<br><br>   5.<b>Prior:</b>  CLJ finds out the girl with the maximum priority and then moves the window to the head of the queue. Note that if the girl with the maximum priority is  already  the  first  window,  this operation is considered successful as well. If the window queue is empty, this operation will fail and LOGMSG must be &#xFFFD;&#xFFFD;empty&#xFFFD;&#xFFFD;. If it is successful, LOGMSG must be &#xFFFD;&#xFFFD;success&#xFFFD;&#xFFFD;.<br><br>   6.<b>Choose u:</b> CLJ chooses the girl with priority u and moves the window to the head of the queue.This operation is considered successful if and only if the window with priority u exists. LOGMSG for the successful cases should be &#xFFFD;&#xFFFD;success&#xFFFD;&#xFFFD; and for the other cases should be &#xFFFD;&#xFFFD;invalid priority&#xFFFD;&#xFFFD;.<br><br>   7.<b>Top u:</b> CLJ makes the window of the girl with priority u always on top. Always on top is a special state, which means whoever the first girl in the queue is, the top one must be u if u is always on top. As you can see, two girls cannot be always on top at the same time, so if one girl is always on top while CLJ wants another always on top, the first will be not always on top any more, except the two girls are the same one. Anyone can be always on top. LOGMSG is the same as that of the Choose operation.<br><br>   8.<b>Untop:</b> CLJ cancels the &#xFFFD;&#xFFFD;always on top&#xFFFD;&#xFFFD; state of the girl who is always on top. That is, the girl who is always on top now is not in this special state any more. This operation will fail unless there is one girl always on top. If it fails, LOGMSG should be &#xFFFD;&#xFFFD;no such person&#xFFFD;&#xFFFD;, otherwise should be &#xFFFD;&#xFFFD;success&#xFFFD;&#xFFFD;.<br><br>As a gentleman, CLJ will say goodbye to every active window he has ever spoken to at last, &#xFFFD;&#xFFFD;active&#xFFFD;&#xFFFD; here means the window has not been closed so far. The logging format is &#xFFFD;&#xFFFD;Bye u: c&#xFFFD;&#xFFFD; where u is the priority and c is the number of words he has ever spoken to this window. He will always say good bye to the current top girl if he has spoken to her before he closes it.","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T (T &#xFFFD;&#xFFFD; 10), denoting the number of the test cases.<br><br>For each test case, the first line contains an integer n(0 &lt; n &#xFFFD;&#xFFFD; 5000), representing the number of operations. Then follow n operations, one in a line. All the parameters are positive integers below 10<sup>9</sup>.","type":"input_format","format":"html"},{"title":"Output","content":"Output all the logging contents.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n18\nPrior\nAdd 1\nChat 1\nAdd 2\nChat 2\nTop 2\nChat 3\nUntop\nChat 4\nChoose 2\nChat 5\nRotate 2\nChat 4\nClose 2\nAdd 3\nPrior\nChat 2\nClose 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Operation #1: empty.\nOperation #2: success.\nOperation #3: success.\nOperation #4: success.\nOperation #5: success.\nOperation #6: success.\nOperation #7: success.\nOperation #8: success.\nOperation #9: success.\nOperation #10: success.\nOperation #11: success.\nOperation #12: success.\nOperation #13: success.\nOperation #14: close 2 with 8.\nOperation #15: success.\nOperation #16: success.\nOperation #17: success.\nOperation #18: close 1 with 11.\nBye 3: 2\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>This problem description does not relate to any real person in THU.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Asia+AnShan+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2014 Asia AnShan Regional Contest </a> ","type":"source","format":"html"}]}