{"title":"Galaxy","time_limit":1000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5073","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5073&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5073","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5073"},"statement":[{"title":"Problem Description","content":"Good news for us: to release the financial pressure, the government started selling galaxies and we can buy them from now on! The first one who bought a galaxy was Tianming Yun and he gave it to Xin Cheng as a present.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C549-1004-2.jpg\"></center> <br>To be fashionable, DRD also bought himself a galaxy. He named it Rho Galaxy. There are n stars in Rho Galaxy, and they have the same weight, namely one unit weight, and a negligible volume. They initially lie in a line rotating around their center of mass.<br><br>Everything runs well except one thing. DRD thinks that the galaxy rotates too slow. As we know, to increase the angular speed with the same angular momentum, we have to decrease the moment of inertia.<br><br>The moment of inertia I of a set of n stars can be calculated with the formula<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C549-1004-1.jpg\"></center> <br>where w<sub>i</sub> is the weight of star i, d<sub>i</sub> is the distance form star i to the mass of center.<br><br>As DRD&#x2019;s friend, ATM, who bought M78 Galaxy, wants to help him. ATM creates some black holes and white holes so that he can transport stars in a negligible time. After transportation, the n stars will also rotate around their new center of mass. Due to financial pressure, ATM can only transport at most k stars. Since volumes of the stars are negligible, two or more stars can be transported to the same position.<br><br>Now, you are supposed to calculate the minimum moment of inertia after transportation.","type":"description","format":"html"},{"title":"Input","content":"The first line contains an integer T (T &#x2264; 10), denoting the number of the test cases.<br><br>For each test case, the first line contains two integers, n(1 &#x2264; n &#x2264; 50000) and k(0 &#x2264; k &#x2264; n), as mentioned above. The next line contains n integers representing the positions of the stars. The absolute values of positions will be no more than 50000.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one real number in one line representing the minimum moment of inertia. Your answer will be considered correct if and only if its absolute or relative error is less than 1e-9.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 2\n-1 0 1\n4 2\n-2 -1 1 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0\n0.5</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014+Asia+AnShan+Regional+Contest&amp;source=1&amp;searchmode=source\"> 2014 Asia AnShan Regional Contest </a> ","type":"source","format":"html"}]}