{"title":"Comparison of Android versions","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5099","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5099&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5099","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5099"},"statement":[{"title":"Problem Description","content":"   As an Android developer, it&#x2C7;s really not easy to figure out a newer version of two kernels, because Android is updated so frequently and has many branches. Fortunately, Google identifies individual builds with a short build code, e.g. FRF85B.<br><br>   The first letter is the code name of the release family, e.g. F is Froyo. The code names are ordered alphabetically. The latest code name is K (KitKat).<br>The second letter is a branch code that allows Google to identify the exact code branch that the build was made from, and R is by convention the primary release branch.<br><br>   The next letter and two digits are a date code. The letter counts quarters, with A being Q1 2009. Therefore, F is Q2 2010. The two digits count days within the quarter, so F85 is June 24 2010.<br><br>   Finally, the last letter identifies individual versions related to the same date code, sequentially starting with A; A is actually implicit and usually omitted for brevity.<br><br>   Please develop a program to compare two Android build numbers.","type":"description","format":"html"},{"title":"Input","content":"   The first line is an integer n (1 &lt;= n &lt;= 2000), which indicates how many test cases need to process.<br><br>   Each test case consists of a single line containing two build numbers, separated by a space character. ","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, output a single line starting with &#xA8;Case #: &#x3003; (# means the number of the test case). Then, output the result of release comparison as follows:<br><br>   &#x25CF;  Print &quot;&lt;&quot; if the release of the first build number is lower than the second one;<br>   &#x25CF;  Print &quot;=&quot;  if the release of the first build number is same as he second one;<br>   &#x25CF;  Print &quot;&gt;&quot;  if the release of the first build number is higher than the second one.<br><br>   Continue to output the result of date comparison as follows:<br>   &#x25CF;  Print &quot;&lt;&quot;  if the date of the first build number is lower than the second one;<br>   &#x25CF;  Print &quot;=&quot;  if the date of the first build number is same as he second one;<br>   &#x25CF;  Print &quot;&gt;&quot;  if the date of the first build number is higher than the second one.<br><br>   If two builds are not in the same code branch, just compare the date code; if they are in the same code branch, compare the date code together with the individual version.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nFRF85B EPF21B\nKTU84L KTU84M</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: &gt; &gt;\nCase 2: = &lt;</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014%C9%CF%BA%A3%C8%AB%B9%FA%D1%FB%C7%EB%C8%FC%A1%AA%A1%AA%CC%E2%C4%BF%D6%D8%CF%D6%A3%A8%B8%D0%D0%BB%C9%CF%BA%A3%B4%F3%D1%A7%CC%E1%B9%A9%CC%E2%C4%BF%A3%A9&amp;source=1&amp;searchmode=source\"> 2014&#x4E0A;&#x6D77;&#x5168;&#x56FD;&#x9080;&#x8BF7;&#x8D5B;&#x2014;&#x2014;&#x9898;&#x76EE;&#x91CD;&#x73B0;&#xFF08;&#x611F;&#x8C22;&#x4E0A;&#x6D77;&#x5927;&#x5B66;&#x63D0;&#x4F9B;&#x9898;&#x76EE;&#xFF09; </a> ","type":"source","format":"html"}]}