{"title":"Dire Wolf","time_limit":5000,"memory_limit":500,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5115","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5115&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5115","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5115"},"statement":[{"title":"Problem Description","content":"   Dire wolves, also known as Dark wolves, are extraordinarily large and powerful wolves. Many, if not all, Dire Wolves appear to originate from Draenor.<br>   Dire wolves look like normal wolves, but these creatures are of nearly twice the size. These powerful beasts, 8 - 9 feet long and weighing 600 - 800 pounds, are the most well-known orc mounts. As tall as a man, these great wolves have long tusked jaws that look like they could snap an iron bar. They have burning red eyes. Dire wolves are mottled gray or black in color. Dire wolves thrive in the northern regions of Kalimdor and in Mulgore.<br>   Dire wolves are efficient pack hunters that kill anything they catch. They prefer to attack in packs, surrounding and flanking a foe when they can.<br>                                                     &#x2014; Wowpedia, Your wiki guide to the World of Warcra&#xE039;<br><br>   Matt, an adventurer from the Eastern Kingdoms, meets a pack of dire wolves. There are N wolves standing in a row (numbered with 1 to N from left to right). Matt has to defeat all of them to survive.<br><br>   Once Matt defeats a dire wolf, he will take some damage which is equal to the wolf&#x2019;s current attack. As gregarious beasts, each dire wolf i can increase its adjacent wolves&#x2019; attack by b<sub>i</sub>. Thus, each dire wolf i&#x2019;s current attack consists of two parts, its basic attack ai and the extra attack provided by the current adjacent wolves. The increase of attack is temporary. Once a wolf is defeated, its adjacent wolves will no longer get extra attack from it. However, these two wolves (if exist) will become adjacent to each other now.<br><br>   For example, suppose there are 3 dire wolves standing in a row, whose basic attacks ai are (3, 5, 7), respectively. The extra attacks b<sub>i</sub> they can provide are (8, 2, 0). Thus, the current attacks of them are (5, 13, 9). If Matt defeats the second wolf first, he will get 13 points of damage and the alive wolves&#x2019; current attacks become (3, 15).<br><br>   As an alert and resourceful adventurer, Matt can decide the order of the dire wolves he defeats. Therefore, he wants to know the least damage he has to take to defeat all the wolves.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   The first line contains only one integer T , which indicates the number of test cases. For each test case, the first line contains only one integer N (2 &#x2264; N &#x2264; 200).<br><br>   The second line contains N integers a<sub>i</sub> (0 &#x2264; a<sub>i</sub> &#x2264; 100000), denoting the basic attack of each dire wolf.<br><br>   The third line contains N integers b<sub>i</sub> (0 &#x2264; b<sub>i</sub> &#x2264; 50000), denoting the extra attack each dire wolf can provide.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each test case, output a single line &#x201C;Case #x: y&#x201D;, where x is the case number (starting from 1), y is the least damage Matt needs to take.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n3 5 7\n8 2 0\n10\n1 3 5 7 9 2 4 6 8 10\n9 4 1 2 1 2 1 4 5 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 17\nCase #2: 74\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In the &#xFB01;rst sample, Matt defeats the dire wolves from left to right. He takes 5 + 5 + 7 = 17 points of damage which is the least damage he has to take.</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014ACM%2FICPC%D1%C7%D6%DE%C7%F8%B1%B1%BE%A9%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%B1%B1%CA%A6%BA%CD%C9%CF%BD%BB%A3%A9&amp;source=1&amp;searchmode=source\"> 2014ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5317;&#x4EAC;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x5317;&#x5E08;&#x548C;&#x4E0A;&#x4EA4;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}