{"title":"The E-pang Palace","time_limit":1000,"memory_limit":500,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5128","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5128&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5128","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5128"},"statement":[{"title":"Problem Description","content":"   E-pang Palace was built in Qin dynasty by Emperor Qin Shihuang in Xianyang, Shanxi Province. It was the largest palace ever built by human. It was so large and so magnificent that after many years of construction, it still was not completed. Building the great wall, E-pang Palace and Qin Shihuang&apos;s tomb cost so much labor and human lives that people rose to fight against Qin Shihuang&apos;s regime. <br><br>   Xiang Yu and Liu Bang were two rebel leaders at that time. Liu Bang captured Xianyang -- the capital of Qin. Xiang Yu was very angry about this, and he commanded his army to march to Xianyang. Xiang Yu was the bravest and the strongest warrior at that time, and his army was much more than Liu Bang&apos;s. So Liu Bang was frighten and retreated from Xianyang, leaving all treasures in the grand E-pang Palace untouched. When Xiang Yu took Xianyang, he burned E-pang Palce. The fire lasted for more than three months, renouncing the end of Qin dynasty.<br><br>   Several years later, Liu Bang defeated Xiangyu and became the first emperor of Han dynasty. He went back to E-pang Palace but saw only some pillars left. Zhang Liang and Xiao He were Liu Bang&apos;s two most important ministers, so Liu Bang wanted to give them some awards. Liu Bang told them: &quot;You guys can make two rectangular fences in E-pang Palace, then the land inside the fences will belongs to you. But the corners of the rectangles must be the pillars left on the ground, and two fences can&apos;t cross or touch each other.&quot; <br><br>   To simplify the problem, E-pang Palace can be consider as a plane, and pillars can be considered as points on the plane. The fences you make are rectangles, and you MUST make two rectangles. Please note that the rectangles you make must be parallel to the coordinate axes.<br><br>   The figures below shows 3 situations which are not qualified(Thick dots stands for pillars):<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C558-1002-1.jpg\"></center><br>   Zhang Liang and Xiao He wanted the total area of their land in E-pang Palace to be maximum. Please bring your computer and go back to Han dynasty to help them so that you may change the history.","type":"description","format":"html"},{"title":"Input","content":"   There are no more than 15 test case.<br><br>   For each test case:<br><br>   The first line is an integer N, meaning that there are N pillars left in E-pang Palace(4 &lt;=N &lt;= 30).<br><br>   Then N lines follow. Each line contains two integers x and y (0 &lt;= x,y &lt;= 200), indicating a pillar&apos;s coordinate. No two pillars has the same coordinate.<br><br>   The input ends by N = 0.","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, print the maximum total area of land Zhang Liang and Xiao He could get. If it was impossible for them to build two qualified fences, print &quot;imp&quot;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8\n0 0\n1 0\n0 1\n1 1\n0 2\n1 2\n0 3\n1 3\n8\n0 0\n2 0\n0 2\n2 2\n1 2\n3 2\n1 3\n3 3\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nimp</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014ACM%2FICPC%D1%C7%D6%DE%C7%F8%B9%E3%D6%DD%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%BB%AA%B9%A4%BA%CD%B1%B1%B4%F3%A3%A9&amp;source=1&amp;searchmode=source\"> 2014ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5E7F;&#x5DDE;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x534E;&#x5DE5;&#x548C;&#x5317;&#x5927;&#xFF09; </a> ","type":"source","format":"html"}]}