{"title":"Little Zu Chongzhi's Triangles","time_limit":1000,"memory_limit":500,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5135","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5135&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5135","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5135"},"statement":[{"title":"Problem Description","content":"   Zu Chongzhi (429&#x2013;500)  was a prominent Chinese mathematician and astronomer during the Liu Song and Southern Qi Dynasties. Zu calculated the value of&#x3C0; to the precision of six decimal places and for a thousand years thereafter no subsequent mathematician computed a value this precise. Zu calculated one year as 365.24281481 days, which is very close to 365.24219878 days as we know today. He also worked on deducing the formula for the volume of a sphere. <br><br>   It is said in some legend story books that when Zu was a little boy, he liked mathematical games. One day, his father gave him some wood sticks as toys. Zu Chongzhi found a interesting problem using them. He wanted to make some triangles by those sticks, and he wanted the total area of all triangles he made to be as large as possible. The rules were :<br><br>   1)  A triangle could only consist of 3 sticks.<br>   2)  A triangle&apos;s vertexes must be end points of sticks. A triangle&apos;s vertex couldn&apos;t be in the middle of a stick.<br>   3)  Zu didn&apos;t have to use all sticks.<br><br>   Unfortunately, Zu didn&apos;t solve that problem because it was an algorithm problem rather than a mathematical problem. You can&apos;t solve that problem without a computer if there are too many sticks. So please bring your computer and go back to Zu&apos;s time to help him so that maybe  you can change the history.","type":"description","format":"html"},{"title":"Input","content":"   There are no more than 10 test cases. For each case:<br><br>   The first line is an integer N(3 &lt;= N&lt;= 12), indicating the number of sticks Zu Chongzhi had got. The second line contains N integers, meaning the length of N sticks. The length of a stick is no more than 100. The input ends with N = 0.","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, output the maximum total area of triangles Zu could make. Round the result to 2 digits after decimal point. If Zu couldn&apos;t make any triangle, print 0.00 .","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 1 20\n7\n3 4 5 3 4 5 90\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0.00\n13.64</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014ACM%2FICPC%D1%C7%D6%DE%C7%F8%B9%E3%D6%DD%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%BB%AA%B9%A4%BA%CD%B1%B1%B4%F3%A3%A9&amp;source=1&amp;searchmode=source\"> 2014ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5E7F;&#x5DDE;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x534E;&#x5DE5;&#x548C;&#x5317;&#x5927;&#xFF09; </a> ","type":"source","format":"html"}]}