{"title":"Yue Fei's Battle","time_limit":1000,"memory_limit":500,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5136","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5136&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5136","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5136"},"statement":[{"title":"Problem Description","content":"   Yue Fei is one of the most famous military general in Chinese history.He led Southern Song army in the wars against the Jin dynasty of northern China. Yue Fei achieved a lot of victory and hopefully could retake Kaifeng ,the former capital of Song occupied by Jin. Fearing that retaking Kaifeng might cause the Jin to release former Emperor Song Qinzong, threatening his throne, Emperor Song Gaozong took some corrupted officers&apos; advice, sending 12 urgent orders in the form of 12 gold plaques to Yue Fei, recalling him back to the capital.<br><br>   Then Yue Fei was put into prison and was killed under a charge of &quot;maybe there is&quot; treason. But later Yue Fei was posthumously pardoned and rehabilitated, and became a symbol of loyalty to the country. The four corrupted officers who set him up were Qin Hui,Qin Hui&apos;s wife Lady Wang, Moqi Xie and Zhang Jun. People made kneeling iron statues of them and put the statues before Yue Fei&apos;s tomb (located by the West Lake, Hangzhou). For centuries, these statues have been cursed, spat and urinated upon by people. (Now please don&apos;t do that if you go to Hangzhou and see the statues.)<br><br>   One of the most important battle Yue Fei won is the battle in Zhuxian town. In Zhuxian town, Yue Fei wanted to deploy some barracks, and connected those barracks with roads. Yue Fei needed all the barracks to be connected, and in order to save money, he wanted to build as less roads as possible. There couldn&apos;t be a barrack which is too important, or else it would be attacked by enemies. So Yue Fei required that NO barrack could connect with more than 3 roads. According to his battle theory, Yue Fei also required that the length of the longest route among the barracks is exactly K. Note that the length of a route is defined as the number of barracks lied on it and there may be several longest routes with the same length K.<br><br>   Yue Fei wanted to know, in how many different ways could he deploy the barracks and roads. All barracks could be considered as no different. Yue Fei could deploy as many barracks as he wanted.<br><br>   For example, if K is 3,Yue Fei had 2 ways to deploy the barracks and roads as shown in figure1. If K is 4, the 3 kinds of layouts is shown in figure 2. (Thick dots stand for barracks, and segments stand for roads):<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C558-1010-1.jpg\"></center><br>   Please bring your computer and go back to Yue Fei&apos;s time to help him so that you may change the history.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"   The input consists of no more than 25 test cases.<br><br>   For each test, there is only one line containing a integer K(1&lt;=K&lt;=100,000) denoting the length of the longest route.<br><br>   The input ends by K = 0.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"   For each test case, print an integer denoting the number of different ways modulo 1000000007.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n4\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014ACM%2FICPC%D1%C7%D6%DE%C7%F8%B9%E3%D6%DD%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%BB%AA%B9%A4%BA%CD%B1%B1%B4%F3%A3%A9&amp;source=1&amp;searchmode=source\"> 2014ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5E7F;&#x5DDE;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x534E;&#x5DE5;&#x548C;&#x5317;&#x5927;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}