{"title":"How Many Maos Does the Guanxi Worth","time_limit":1000,"memory_limit":500,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5137","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5137&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5137","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5137"},"statement":[{"title":"Problem Description","content":"   &quot;Guanxi&quot; is a very important word in Chinese. It kind of means &quot;relationship&quot; or &quot;contact&quot;. Guanxi can be based on friendship, but also can be built on money. So Chinese often say &quot;I don&apos;t have one mao (0.1 RMB) guanxi with you.&quot; or &quot;The guanxi between them is naked money guanxi.&quot; It is said that the Chinese society is a guanxi society, so you can see guanxi plays a very important role in many things.<br><br>   Here is an example. In many cities in China, the government prohibit the middle school entrance examinations in order to relief studying burden of primary school students. Because there is no clear and strict standard of entrance, someone may make their children enter good middle schools through guanxis. Boss Liu wants to send his kid to a middle school by guanxi this year. So he find out his guanxi net. Boss Liu&apos;s guanxi net consists of N people including Boss Liu and the schoolmaster. In this net, two persons who has a guanxi between them can help each other. Because Boss Liu is a big money(In Chinese English, A &quot;big money&quot; means one who has a lot of money) and has little friends, his guanxi net is a naked money guanxi net -- it means that if there is a guanxi between A and B and A helps B, A must get paid. Through his guanxi net, Boss Liu may ask A to help him, then A may ask B for help, and then B may ask C for help ...... If the request finally reaches the schoolmaster, Boss Liu&apos;s kid will be accepted by the middle school. Of course, all helpers including the schoolmaster are paid by Boss Liu.<br><br>   You hate Boss Liu and you want to undermine Boss Liu&apos;s plan. All you can do is to persuade ONE person in Boss Liu&apos;s guanxi net to reject any request. This person can be any one, but can&apos;t be Boss Liu or the schoolmaster. If you can&apos;t make Boss Liu fail, you want Boss Liu to spend as much money as possible. You should figure out that after you have done your best, how much at least must Boss Liu spend to get what he wants. Please note that if you do nothing, Boss Liu will definitely succeed.","type":"description","format":"html"},{"title":"Input","content":"   There are several test cases.<br><br>   For each test case:<br><br>   The first line contains two integers N and M. N means that there are N people in Boss Liu&apos;s guanxi net. They are numbered from 1 to N. Boss Liu is No. 1 and the schoolmaster is No. N.   M means that there are M guanxis in Boss Liu&apos;s guanxi net. (3 &lt;=N &lt;= 30, 3 &lt;= M &lt;= 1000)<br><br>   Then M lines follow. Each line contains three integers A, B and C, meaning that there is a guanxi between A and B, and if A asks B or B asks A for help, the helper will be paid C RMB by Boss Liu.<br><br>   The input ends with N = 0 and M = 0.<br><br>   It&apos;s guaranteed that Boss Liu&apos;s request can reach the schoolmaster if you do not try to undermine his plan.","type":"input_format","format":"html"},{"title":"Output","content":"   For each test case, output the minimum money Boss Liu has to spend after you have done your best. If Boss Liu will fail to send his kid to the middle school, print &quot;Inf&quot; instead.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 5\n1 2 3\n1 3 7\n1 4 50\n2 3 4\n3 4 2\n3 2\n1 2 30\n2 3 10\n0 0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">50\nInf</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2014ACM%2FICPC%D1%C7%D6%DE%C7%F8%B9%E3%D6%DD%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%BB%AA%B9%A4%BA%CD%B1%B1%B4%F3%A3%A9&amp;source=1&amp;searchmode=source\"> 2014ACM/ICPC&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x57E;-&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x43B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x371;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}