{"title":"Sequence III","time_limit":3000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5149","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5149&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5149","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5149"},"statement":[{"title":"Problem Description","content":"Jinye is playing with cards. He has n cards in hand now. There is a number range from 1 to m writing on each card respectively.<br>There is a card sequence in the deck. At the beginning the sequence is empty.<br>Jinye will play for t rounds, at each round, Jinye will play one of these two operations:<br>1. select x y. x and y are both integer and x should between 1 and the number of cards in Jinye&#x2019;s hand now, y should between 1 and the number of cards in the card sequence+1.That means Jinye insert the $x_{th}$ card in his hand into the card sequence&#x2019;s $y_{th}$ position. For example, if the cards in Jinye&#x2019;s hand is 2,3,3,6,1 now, and the card sequence is 2,2,5,4,3, after we play &#x201C;select 4 2&#x201D;, the cards in Jinye&#x2019;s hand become 2,3,3,1, and the card sequence become 2,6,2,5,4,3.<br>2. pop. Pop up the cards in the card sequence&#x2019;s right most and put it into the right most of Jinye&#x2019;s hand. For example, if the cards in Jinye&#x2019;s hand is 2,3,3,1 now, and the card sequence is 2,6,2,5,4,3, after we play &#x201C;pop&#x201D;, the cards in Jinye&#x2019;s hand become 2,3,3,1,3 and the card sequence become 2,6,2,5,4.<br>The card sequence should be empty after t rounds.<br>For the card with number i writing on it, if it&#x2019;s in card sequence now, its position in card sequence should never exceed $h_{i}$ at any moment.<br>There are some limits between cards. If x is limited by y, that means if there is at least one card with number y in the card sequence now, the card with number x can not be insert into the card sequence. Note that x can be equal to y, that means there is at most one x in the card sequence.<br>If there is no card can be insert into card sequence, the &#x201C;select x y&#x201D; operation is illegal.<br>If there is no card in the card sequence now, the &#x201C;pop&#x201D; operation is illegal.<br>Our problem is, how many legal operate sequence can meet all the demand.<br>Two operate sequences are consider different if there is a round they display different operations or there is a round they both display &#x201C;select&#x201D; but the parameters are different.<br>Output the answer modulo 1000000009.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains a single integer T, indicating the number of test cases.<br>Each test case begin with three integers n, m, and t, indicating the number of cards in Jinye&#x2019;s hand now, the range of the number writing on card, the number of rounds this game will play. <br>Next line contain n integers $A_{1},A_{2}, \\ldots, A_{n}, A_{i}$ means the number writing on the $i_{th}$ cards.<br>Next line contain m integers $h_{1},h_{2}, \\ldots, h_{m}$, as described above.<br>Next line contain an integers f, indicating the number of limits between cards.<br>Next f lines, each line contains two integers x and y, means x is limited by y.<br><br>[Technical Specification]<br>1 &lt;= T &lt;= 30<br>1 &lt;= n &lt;= 15<br>1 &lt;= m &lt;= 15<br>1 &lt;= t &lt;= 30,t is even<br>1 &lt;= $A_{i}$ &lt;= m<br>1 &lt;= $h_{i}$ &lt;= t<br>0 &lt;= f &lt;= m*m<br>1 &lt;= x,y &lt;= m","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output contain one line, the number of answer.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n1 1 2\n1\n1\n0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BestCoder+Round+%2323&amp;source=1&amp;searchmode=source\"> BestCoder Round #23 </a> ","type":"source","format":"html","require":["katex"]}]}