{"title":"Elven Postman","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5444","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5444&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5444","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5444"},"statement":[{"title":"Problem Description","content":"Elves are very peculiar creatures. As we all know, they can live for a very long time and their magical prowess are not something to be taken lightly. Also, they live on trees. However, there is something about them you may not know. Although delivering stuffs through magical teleportation is extremely convenient (much like emails). They still sometimes prefer other more  &#xFFFD;&#xFFFD;traditional&#xFFFD;&#xFFFD;  methods.<br><br>So, as a elven postman, it is crucial to understand how to deliver the mail to the correct room of the tree. The elven tree always branches into no more than two paths upon intersection, either in the east direction or the west. It coincidentally looks awfully like a binary tree we human computer scientist know. Not only that, when numbering the rooms, they always number the room number from the east-most  position to the west. For rooms in the east are usually more preferable and more expensive due to they having the privilege to see the sunrise, which matters a lot in elven culture.<br><br>Anyways, the elves usually wrote down all the rooms in a sequence at the root of the tree so that the postman may know how to deliver the mail. The sequence is written as follows, it will go straight to visit the east-most room and write down every room it encountered along the way. After the first room is reached, it will then go to the next unvisited east-most room, writing down every unvisited room on the way as well until all rooms are visited.<br><br>Your task is to determine how to reach a certain room given the sequence written on the root.<br> <br>For instance, the sequence 2, 1, 4, 3 would be written on the root of the following tree.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C621-1008-1.jpg\"></center> ","type":"description","format":"html"},{"title":"Input","content":"First you are given an integer $T (T \\leq 10)$ indicating the number of test cases.<br><br>For each test case, there is a number $n (n \\leq 1000)$ on a line representing the number of rooms in this tree. $n$ integers representing the sequence written at the root follow, respectively $a_1, . . . , a_n$ where $a_1, . . . , a_n  &#xFFFD;&#xFFFD; \\{1, . . . , n\\}$.<br><br>On the next line, there is a number $q$ representing the number of mails to be sent. After that, there will be $q$ integers $x_1, . . . , x_q$ indicating the destination room number of each mail.","type":"input_format","format":"html"},{"title":"Output","content":"For each query, output a sequence of move ($E$ or $W$)  the  postman needs  to make to deliver the mail. For that $E$ means that the postman should move up the eastern branch and $W$ the western one. If the destination is on the root, just output a blank line would suffice.<br><br>Note that for simplicity, we assume the postman always starts from the root regardless of the room he had just visited.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4\n2 1 4 3\n3\n1 2 3\n6\n6 5 4 3 2 1\n1\n1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">E\n\nWE\nEEEEE</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2015+ACM%2FICPC+Asia+Regional+Changchun+Online&amp;source=1&amp;searchmode=source\"> 2015 ACM/ICPC Asia Regional Changchun Online </a> ","type":"source","format":"html"}]}