{"title":"The Relationship in Club","time_limit":2500,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5485","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5485&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5485","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5485"},"statement":[{"title":"Problem Description","content":"There are many student clubs in the campus, among which the Always Creatively Moha (ACM) club gained the most popularity. The ACM club consists of $N$ members. Not all of them know each other, so we may describe the relationship between two members with an integer ranging from 0 to $M$ inclusively. For example, 0 means that the two persons do not know each other. 1 may indicate that they know each other but are not familiar. 520 indicates that they have fallen into love.<br>The members are partitioned into two non-empty groups to participate a team-building activity. To get them know each other, it is required that the value of relationship between every pair of members in the same groups is always 0, while the relationship between persons from different groups can be any value between 0 and $M$.<br>It should be noted that such a partition is not always possible. For example, if there are 3 members in the club and the value of relationship between them is greater than 0, it is impossible to partition them as required.<br>The organizer comes up with an interesting question. Assuming we may assign any integer between 0 and $M$ to the relationship between any two members. Among all the ways of assignment, how many of them can make the partitioning possible?<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains a number $T$ indicating the number of test cases ($T&#x2264;100$).<br>Each test case consists of two integers $N$ and $M$ indicating the number of members and the maximum value of relationship ($1&#x2264;N,M&#x2264;1000$).<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a single line consisting of &#x201C;Case #X: Y&#x201D;. $X$ is the test case number starting from 1. $Y$ is the number of ways assigning value to relationships that makes the partitioning possible. As the answer could be huge, you only need to output $Y$ module 105225319.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 1\n3 2\n1 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 2\nCase #2: 19\nCase #3: 0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2015+ACM%2FICPC+Asia+Regional+Hefei+Online&amp;source=1&amp;searchmode=source\"> 2015 ACM/ICPC Asia Regional Hefei Online </a> ","type":"source","format":"html"}]}