{"title":"Game of Flying Circus","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5515","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5515&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5515","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5515"},"statement":[{"title":"Problem Description","content":"The discovery of anti-gravitations technology changed the world. The invention of anti-gravitation shoes (Grav-shoes) enables people to fly in the sky freely. This led to the rise of a new sky sport: <b>``Flying Circus&quot;</b>.<br><br>Utilizing Grav-shoes and personal flying suits, competitors battle it out in a special field, where they compete scoring obtain $m$ points within a certain time limit. The field is a square with edge length $300$ meters. Moreover, there are four buoys floating at each corner of the square. Four buoys are numbered as $1,2,3,4$ in clockwise order.<br><br><center><img style=\"max-width:100%;\" src=\"../../data/images/C645-1007-1.png\"></center><br><br>Two players start at buoy $\\#1$. When game begin, they will try to touch four floating buoys in clockwise order.<br>(Since buoy $\\#1$ is the start point, the first buoy they need to touch will be buoy $\\#2$, and after that, they need to touch buoy $\\#3,\\#4,\\#1$ in order) <b>Note that they could fly freely in the field, even fly inside the square field.</b><br><br>Under two situations the player could score one point.<br><br>$\\cdot$1.<b> If you touch a buoy before your opponent, you will get one point.</b> For example if your opponent touch the buoy $\\#2$ before you after start, he will score one point. So when you touch the buoy $\\#2$, you won&apos;t get any point. Meanwhile, you cannot touch buoy $\\#3$ or any other buoys before touching the buoy $\\#2$.<br><br>$\\cdot$2.<b> Ignoring the buoys and relying on dogfighting to get point.</b> If you and your opponent meet in the same position, you can try to fight with your opponent to score one point. For the proposal of game balance, two players are not allowed to fight before buoy $\\#2$ is touched by anybody.<br><br>There are three types of players.<br><br><b>Speeder</b>: As a player specializing in high speed movement, he/she tries to avoid dogfighting while attempting to gain points by touching buoys.<br><b>Fighter</b>: As a player specializing in dogfighting, he/she always tries to fight with the opponent to score points. Since a fighter is slower than a speeder, it&apos;s difficult for him/her to score points by touching buoys when the opponent is a speeder.<br><b>All-Rounder</b>: A balanced player between Fighter and Speeder.<br><br>There will be a training match between Asuka (All-Rounder) and Shion (Speeder).<br>Since the match is only a training match, the rules are simplified: <b>the game will end after the buoy</b> $\\#1$ <b>is touched by anybody</b>. Shion is a speed lover, and his strategy is very simple: touch buoy $\\#2, \\#3, \\#4, \\#1$ along the shortest path.<br><br>Asuka is good at dogfighting, so she will always score one point by dogfighting with Shion, and <b>the opponent will be stunned for T seconds after dogfighting.</b> Since Asuka is slower than Shion, she decides to fight with Shion for only one time during the match. It is also assumed that if Asuka and Shion touch the buoy in the same time, the point will be given to Asuka and Asuka could also fight with Shion at the buoy. We assume that in such scenario, the dogfighting must happen after the buoy is touched by Asuka or Shion.<br><br>The speed of Asuka is $V_1~m/s$. The speed of Shion is $V_2~m/s$. Is there any possibility for Asuka to win the match (to have higher score)?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains an integer $t~(0&lt;t\\le 1000)$, followed by $t$ lines.<br>Each line contains three double $T,~V_1$ and $V_2~(0\\le V1\\le V2\\le 2000, 0\\le T\\le 2000)$ with no more than two decimal places, stands for one case.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"If there exist any strategy for Asuka to win the match, output ``Yes&quot;, otherwise, output ``No&quot;.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 10 13\n100 10 13</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: No\nCase #2: Yes\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nAsuka could fly to the mid point of the edge between buoy #2 and buoy #3, and wait there until Shion come.  Asuka will fight with Shion when they meet. As a result, Shion will be stunned (It means Shion cannot move for 100 seconds.) Then Asuka could fly back to buoy #2, since the buoy #2 is touched, she will get no point by touching buoy #2. But after that, she could fly to buoy #3, #4, #1 along the edge and get three points.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2015ACM%2FICPC%D1%C7%D6%DE%C7%F8%C9%F2%D1%F4%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%B6%AB%B1%B1%B4%F3%D1%A7%A3%A9&amp;source=1&amp;searchmode=source\"> 2015ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x6C88;&#x9633;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x4E1C;&#x5317;&#x5927;&#x5B66;&#xFF09; </a> ","type":"source","format":"html","require":["katex"]}]}