{"title":"Advanced Calculator","time_limit":7000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5553","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5553&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5553","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5553"},"statement":[{"title":"Problem Description","content":"When Marry was in fourth grade, she made a simple calculator program to help her doing elementary arithmetic. But when she went up to fifth grade, Marry felt the old program would not meet her new requirement, so she decided to design an advanced calculator. You can input some code into this program and then it executes and gives you results. Since this code looks like the C programming language, Marry called these code: C---.<br><br>C--- contains two types of variables: 32-bit signed integer &#x201C;<b>int</b>&#x201D; and 64-bit signed float numbers &#x201C;<b>double</b>&#x201D;. The name of variables consists of English letters and numbers, but the first character must be a letter. The constants also have two types like the variables. Only constants containing the decimal mark &#x201C;<b>.</b>&#x201D; are treated as float numbers. For example, 3 is considered an integer, but 3.0 is a float number. Besides, the float numbers won&#x2019;t use scientific notation.<br><br>A C--- program consists many lines, each line only has one single sentence and ends up with a semicolon. There are two parts in a C--- program. The beginning of a program is several lines of variable statements. The way to state a variable is the same as it in C programs, e.g. &#x201C;<b>int a;</b>&#x201D; or &#x201C;<b>double b;</b>&#x201D;, except that there are no initial values. A variable name consists of no more than twenty letters and all values will be set to zero initially. It should be noticed that not all C--- programs should contain variable statements.<br><br>The remaining part consists of some sentences, and each of them is an expression or output command (no variable statements appear). An expression may or may not have assignment operation. The output command is &#x201C;<b>print(x)</b>&#x201D;. It will print the value of $x$, which is a variable or constant, to the standard output stream on a single line. If $x$ is an integer, the output should display $x$ as an integer, otherwise display it as a float with 6 decimal places. In addition, no variable is named &#x201C;<b>print</b>&#x201D;.<br>The operators used in C--- program includes:<br><br>left parenthesis:&#xA0;&#xA0;&#x201C; <b>(</b>&#x201C;<br>right parenthesis:&#xA0;&#xA0;&#x201C;<b>)</b>&#x201D;<br>assignment:&#xA0;&#xA0;&#x201C;<b>=</b>&#x201D;<br>plus:&#xA0;&#xA0;&#x201C;<b>+</b>&#x201D;<br>minus:&#xA0;&#xA0;&#x201C;<b>-</b>&#x201C;<br>multiplication:&#xA0;&#xA0;&#x201C;<b>*</b>&#x201D;<br>Division:&#xA0;&#xA0;&#x201C;<b>/</b>&#x201D;<br><br>The calculation methods and priority are same to C programs in terms of calculate methods and priority. It should be noticed that when operating an integer along with a float number, the integer will be transferred to a float number implicitly. Also, when a float number was assigned to an integer variable, the decimals of float number will be lost. These rules for implicit conversion are the same as C language. The value and type of an assignment expression &#x201C;<b>x=y</b>&#x201D; equal to $x$.<br><br>Now, you need to help Marry to develop this advanced calculator program, and then execute some C--- codes to validate the correctness.<br><br>There will be no empty lines but may be some extra blank spaces. We ensure that input program code is legal but there may be &#x201C;<b>divided by ZERO</b>&#x201D; runtime error. If the error happens, print single line of &#x201C;<b>divided by ZERO</b>&#x201D; and terminate the execution.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains an integer $N$, which represents the number of lines of the C---code ($N&#x2264;10000$). The next $N$ lines contain the C&#x2014; program. The number of characters in each line is not greater than 1000.","type":"input_format","format":"html"},{"title":"Output","content":"For each &#x201C;<b>print</b>&#x201D; command, output the result according to the above specification. When &#x201C;<b>divided by ZERO</b>&#x201D; error occurs, output &#x201C;<b>divided by ZERO</b>&#x201D; in a single line and terminate the execution.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">12\nint a;\ndouble x,y;\nint b,c,d;\na=5.5;\nx=y=(1+a)*6.44;\na+4;\na=a/2;\nprint(a);\ny=(c+6)*-(1+1);\nprint(y);\nd=a/(2/5);\nprint(d);</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n-12.000000\ndivided by ZERO</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2015ACM%2FICPC%D1%C7%D6%DE%C7%F8%BA%CF%B7%CA%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%D6%D0%BF%C6%B4%F3%A3%A9&amp;source=1&amp;searchmode=source\"> 2015ACM/ICPC&#x4E9A;&#x6D32;&#x533A;&#x5408;&#x80A5;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x4E2D;&#x79D1;&#x5927;&#xFF09; </a> ","type":"source","format":"html"}]}