{"title":"Subway","time_limit":3500,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5732","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5732&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5732","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5732"},"statement":[{"title":"Problem Description","content":"jiefangxuanyan and yiyi cat are universally acknowledged model couples. Once jiefangxuanyan has time, he takes a train to yiyi cat&#x2019;s city and meet her. This time, as usual, jiefangxuanyan gets out from the railway station, and enters the subway, only to find that the subway stations of the whole city changes their names!<br><br>As a direction idiot, jiefangxuanyan felt helpless with this situation. He called yiyi cat for help. Because the subway map is so complicated, she can&#x2019;t remember it either. Fortunately, only the names of the stations changed, the structure of subway lines is the same. So she picks out the old map to make a mapping.<br><br>But mapping such a confused subway map is definitely a difficult task. So she has to use the computer. Unfortunately, she just spilt wonton soup into her computer. So, yiyi cat asked you for help, hoping you can help her with this problem.<br><br>The subway in the city forms a tree, with N subway stations and N-1 subway lines. Any pair of stations are connected with one or more subway lines. You need to find a bijective mapping from the old names to the new names, that for each pair of stations connected by exactly one line in the old map, their new names are also connected by exactly one line in the new map.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input has multiple test cases, please process to the end of file.<br><br>For each test case, the first line is an integer $N (1\\leq N\\leq 100000)$.<br><br>In the following $N-1$ lines, each line has two space-separated string, as two stations connected by one line in the old map.<br><br>In the following $N-1$ lines, each line has two space-separated string, as two stations connected by one line in the new map.<br><br>Station names are no longer than 10 characters, and only consists of lowercase letters (a~z).<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output $N$ lines.<br><br>Each line consists two space-separated string, as the old name and its corresponding new name.<br><br>Both the names appeared in the old and new subway map should appear exactly once in the output.<br><br>You can output the names in any order. And if there are multiple valid mappings, output any one.<br><br>Names in the old map and the new map may be the same, but this does not mean these two stations are the same.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\na b\nb c\nb a\na c</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">b a\na b\nc c</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"HIT","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+Multi-University+Training+Contest+1&amp;source=1&amp;searchmode=source\"> 2016 Multi-University Training Contest 1 </a> ","type":"source","format":"html","require":["katex"]}]}