{"title":"Ants","time_limit":3000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5809","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5809&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5809","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5809"},"statement":[{"title":"Problem Description","content":"Mr. Chopsticks found a lot of ants and ant nests on Mars. The behavior of these ants seems quite different from ants on earth, so Mr. Chopsticks built a laboratory to study them. In the laboratory, there is a flat land and N ant nests, numbered from 1 to N, on it. The ith nest&#x2019;s location is (xi, yi), and no two nests are at the same location. After a period of observation, Mr. Chopsticks has found some laws which all the moving ants obey: <br><br>1.&#xA0;&#xA0;When an ant is at a nest p, it always moves to another nest which is closest to p. If there are multiple nests with minimum distance from p, it moves to the one with smaller x-coordinate value. If there is still a tie, the one with smaller y-coordinate value is chosen. When an ant moves from a nest to another, it always moves along the segment connecting them.<br><br>2.&#xA0;&#xA0;An ant never stops, that is, when an ant arrives at a nest, it moves to the next nest immediately. So, of course, an ant may visit a nest infinitely many times.<br><br>3.&#xA0;&#xA0;All the ants move at the same speed.<br><br>What happens if two ants meet each other? Will they fight? Mr. Chopsticks is curious about these questions. But at first, he should know whether two ants will meet. So he considers the following question: Given two different nests, if two ants start to move from these two nests simultaneously, will they meet at some time during their moving?<br>Note that all the ants and nests can be considered as points.<br>","type":"description","format":"html"},{"title":"Input","content":"The input begins with an integer T (T &lt;= 10), indicating the number of test cases. Each case begins with an integer N and Q (2 &lt;= N &lt;= 100000, 1 &lt;= Q &lt;= 100000), indicating the number of ant nests and the number of queries respectively. The following N lines, each contain two integers xi and yi (-1 000 000 000 &lt;= xi, yi &lt;= 1 000 000 000), indicating the location of the ith ant nest. The following Q lines each contain two integers i and j (1 &lt;= i, j &lt;= N, i &#x2260; j), indicating the number of the two given ant nests.","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output &quot;Case #X:&quot; in a line where X is the case number, staring from 1. Then for each query, output &#x201C;YES&#x201D; in a line if the two ants will meet; otherwise output &#x201C;NO&#x201D;.<br><br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 1\n0 0\n-1 1\n1 2\n5 2\n1 1\n3 3\n4 4\n0 -3\n0 -4\n1 3\n2 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\nYES\nCase #2:\nYES\nNO</div></pre>","type":"example","format":"html"},{"title":"Author","content":"SYSU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+Multi-University+Training+Contest+7&amp;source=1&amp;searchmode=source\"> 2016 Multi-University Training Contest 7 </a> ","type":"source","format":"html"}]}