{"title":"Ice Walls","time_limit":3000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5817","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5817&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5817","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5817"},"statement":[{"title":"Problem Description","content":"Have you ever played DOTA? If so, you may know the hero, Invoker. As one of the few intelligence carries, Invoker has 10 powerful abilities. One of them is the Ice Wall: Invoker generates a wall of solid ice directly in front of him, and the bitter cold emanating from it greatly slows nearby enemies and deals damage each second.<br><br>Now consider the map as a plane. You are now at point s, and want to move to point t. But Invoker has placed N ice walls on the map. Your moving speed is 1 per second, but you need k seconds to pass an ice wall. Time is precious, you must get to point t as quickly as possible. What&apos;s the minimum time you need?<br><br>For convenience, you can assume that all ice walls are segments (no width) either parallel to X-axis or to Y-axis. Segments are strictly disjoint (have no common point). Point s and t are not on any segment (have no common point).<br><br>You will not be slowed when pass the end point of a segment or walk along a segment.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input begins with an integer T, indicating the number of test cases. For each case, the first line is two integers N and k (1 &lt;= N &lt;= 500, 0 &lt;= k &lt;= 10^8), indicating the number of segments and the time needed to pass an ice wall. Next N lines, each have four integers x1, y1, x2, y2, indicating two end points of a segment, (x1, y1) and (x2, y2). Next line has two integers xs and ys, representing the coordinates of starting point s. The last line also has two integers xt and yt, representing the coordinates of target point t. For every point, |x| and |y| &lt;= $10^8$. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output one line containing the minimum time in second needed to get to t from s. The answer should be given within an absolute or relative error of $10^{-6}$.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 1\n1 0 1 2\n0 0\n2 0\n1 1\n1 -2 1 2\n0 0\n2 0\n1 3\n1 -2 1 2\n0 0\n2 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.000000\n3.000000\n4.472136</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Author","content":"SYSU","type":"source","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+Multi-University+Training+Contest+7&amp;source=1&amp;searchmode=source\"> 2016 Multi-University Training Contest 7 </a> ","type":"source","format":"html","require":["katex"]}]}