{"title":"Lights","time_limit":3000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5820","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5820&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5820","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5820"},"statement":[{"title":"Problem Description","content":"Today is April 1st, 2100. Now Guangzhou is a very very big city. Since the number of traffic accidents increased last month, the mayor asked Mr. Chopsticks to investigate the traffic condition of the city. <br><br>After studying the map of Guangzhou for a while, Mr. Chopsticks has some ideas. Guangzhou can be considered as a rectangular grid with 50000 horizontal streets running west-east (labeled with y-coordinates from 1 to 50000) and 50000 vertical streets running north-south (labeled with x-coordinates from 1 to 50000). All streets are two-way streets. A crossroad is an intersection of a horizontal street and a vertical street, so a crossroad can be represented by (x, y), where x and y are coordinates of the horizontal street and vertical street respectively. Since there are too many streets, traffic lights are not placed at all crossroads. Given two crossroads (x1, y1) and (x2, y2), a path between these two crossroads is said to be good if the length of the path is |x1 &#x2013; x2| + |y1 &#x2013; y2| and there exist a traffic light at each turn of this path. Of course, a path must be along the streets, and a turn can only be at a crossroad.<br><br>Now given locations of all traffic lights in Guangzhou, Mr. Chopsticks wants to check whether there exists at least one good path between every pair of traffic lights. As Mr. Chopsticks is busy in preparing ACMICPC 2100, he asks you for help.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains multiple test cases. Each case begins with an integer N (1 &lt;= N &lt;= 500000), indicating the number of traffic lights. The following N lines each contain two integers x and y (1 &lt;= x, y &lt;= 50000), indicating a location of a traffic light. There may be multiple traffic lights at the same location.<br><br>N = 0 indicates the end of the input.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each case, output &#x201C;YES&#x201D; if there exists at least one good path between every pair of traffic lights; otherwise output &#x201C;NO&#x201D;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n1 1\n3 3\n3\n1 1\n1 3\n3 3\n0</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">NO\nYES</div></pre>","type":"example","format":"html"},{"title":"Author","content":"SYSU","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+Multi-University+Training+Contest+7&amp;source=1&amp;searchmode=source\"> 2016 Multi-University Training Contest 7 </a> ","type":"source","format":"html"}]}