{"title":"A Poor King","time_limit":4500,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5844","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5844&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5844","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5844"},"statement":[{"title":"Problem Description","content":"There are two white pieces and one black king (<img style=\"max-width:100%;\" src=\"../../data/images/C712-1001-1.jpg\">) on a chess board. Each of the white pieces is a rook (<img style=\"max-width:100%;\" src=\"../../data/images/C712-1001-2.jpg\">), a bishop (<img style=\"max-width:100%;\" src=\"../../data/images/C712-1001-3.jpg\">), or a queen (<img style=\"max-width:100%;\" src=\"../../data/images/C712-1001-4.jpg\">). White starts. You&#x2019;re playing for White and need to checkmate the black king as soon as possible. Write a program that will determine the minimum number of moves White needs to perform to checkmate black king, assuming Black follows the best possible strategy for prolonging the game.<br><br>Some information about the chess rules:<br><br>1. The position described above is not legal in chess since there is no white king on the board. Also, two queens of the same color cannot exist on the board. Apart from that the game is according to the chess rules.<br><br>2. The board size is 8&#xD7;8 cells. Columns of the board are labeled by the letters <b>a</b> to <b>h</b>, and the rows by the digits <b>1</b> to <b>8</b>.<br><br>3. The players (White and Black) alternately move one piece of their own color at a time. In the context of this problem we&#x2019;re only counting moves made by White.<br><br>4. The rook moves horizontally or vertically, through any number of unoccupied squares. It cannot jump over or stay in the same cell as another piece of the same color.<br><br>5. The bishop moves diagonally, through any number of unoccupied squares. <b>It</b> cannot jump over or stay in the same cell as another piece of the same color.<br><br>6. The queen moves horizontally, vertically or diagonally, through any number of unoccupied squares. It cannot jump over or stay in the same cell as another piece of the same color.<br><br>7. A check is a threat to capture the king on the next move turn.<br><br>8. A king can move one square in any direction (horizontally, vertically, or diagonally) unless the move would place the king in check. If this condition holds, it&#x2019;s not prohibited for king to take over a cell already occupied by one of the white pieces. In this case the rook is removed from play altogether.<br><br>9. Checkmate is a position in which a king is threatened with capture (i.e. is in check) and there is no legal move to escape the threat.<br><br>10. Stalemate is a situation where the player whose turn it is to move is not in check but has no legal move. The rules of chess provide that when stalemate occurs, the game ends as a draw (which is not acceptable for White).<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains the number of positions (which is at most 150 000), and each of the following lines contain the description of a single position. A position is represented by the location of the three pieces on the board: the black king first and then the two white pieces with type-specifying character. &#x2018;R&#x2019; means rook, &#x2018;B&#x2019; means bishop, and &#x2018;Q&#x2019; means queen. It&#x2019;s guaranteed that no two pieces share a cell and there is no check at the initial position.<br><br>","type":"input_format","format":"html"},{"title":"Output","content":"Output one line for each position in the input. The line should contain the minimum number of moves which White needs to make to guarantee the checkmate, starting from the corresponding position. In case it&#x2019;s not possible to reach the goal, output 0 for that position.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\nc7 R f1 R g6\nf5 B b3 R h3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0</div></pre>","type":"example","format":"html"},{"title":"Author","content":"&#x91D1;&#x7B56;&#x5DE5;&#x4E1A;&#x7EFC;&#x5408;&#x5927;&#x5B66;&#xFF08;DPRK&#xFF09;","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+Multi-University+Training+Contest+9&amp;source=1&amp;searchmode=source\"> 2016 Multi-University Training Contest 9 </a> ","type":"source","format":"html"}]}