{"title":"Captain is coding","time_limit":6000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5859","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5859&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5859","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5859"},"statement":[{"title":"Problem Description","content":"To improve players&#xFFFD;&#xFFFD; coding skill, FJ collects a variety of problems and order the players to solve them. In order to ensure they can complete the task, FJ divides the problems into two collections and issues a deadline for each collection. He announces that anyone who can&#xFFFD;&#xFFFD;t complete all the problems of any of the two collections before the deadline of it will be downgraded to be an alternative member. <br><br>Now we focus on Captain Chen. His coding skill can be qualified as an integer, which means the level of coding skill. The higher the level is, the faster and the more accurately Captain Chen codes. One has at least Ci level of coding skill is able to solve the ith problem. But after AC it, Captain Chen will get his coding skill increased by Di. Each hour, Captain Chen can either try to solve one problem, or just practice type. If he practices type for one hour, his coding skill will be increased by Z. Please notice that if he AC the same problem twice, the second AC won&#xFFFD;&#xFFFD;t benefit him anymore. And if he chooses to practice or solve the problem, he will practice a whole hour.<br><br>Now, he wonders if he could solve all the problems on time. If he could, he also wonders the minimum time needed to accomplish this task.<br><br>Can you help Captain Chen?<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains a single integer T, indicating there are T cases.<br><br>    In each case, the first line contains five integers N, the numbers of problems; X, the deadline of problems of collection A; Y, the deadline of problems of collection B; W, the initial coding level of Captain Chen; and Z, which was mentioned above. Next there are N lines, each describing one problem and containing two integers Ci and Di, which are mentioned above. Following the Ci and Di there is a character in each line. The character is either &#xFFFD;&#xFFFD;A&#xFFFD;&#xFFFD; or &#xFFFD;&#xFFFD;B&#xFFFD;&#xFFFD;, indicating which collection the problem belongs to.<br><br>    We guarantee that 0&lt;N&lt;=1000, 0&lt;X, Y&lt;=1000000, 0&lt;Z&lt;=1000, 0&lt;=W&lt;=10^9, 0&lt;=Ci&lt;=10^9, 0&lt;=Di&lt;=1000. Please notice that if the deadline of a problem is X, you can solve the problem in X hours but not X+1 hours.<br><br>    There are about 1000 cases whose N is no more than 10, about 30 cases whose N is no more than 100, and no more than 5 cases whose N is larger than 100.<br>","type":"input_format","format":"html"},{"title":"Output","content":"The output of each case contains a single line. If Captain Chen can solve all the problems before their deadline, this line should be the minimum time needed to do it, measured in hour. Otherwise just print &#xFFFD;&#xFFFD;Poor Captain Chen&#xFFFD;&#xFFFD;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 10 30 5 1\n10 5 A\n30 5 B\n2 10 20 5 1\n10 5 A\n30 5 B</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">22\nPoor Captain Chen</div></pre>","type":"example","format":"html"},{"title":"Author","content":"BUPT","type":"source","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+Multi-University+Training+Contest+10&amp;source=1&amp;searchmode=source\"> 2016 Multi-University Training Contest 10 </a> ","type":"source","format":"html"}]}