{"title":"Balanced Game","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5882","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5882&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5882","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5882"},"statement":[{"title":"Problem Description","content":"Rock-paper-scissors is a zero-sum hand game usually played between two people, in which each player simultaneously forms one of three shapes with an outstretched hand. These shapes are &quot;rock&quot;, &quot;paper&quot;, and &quot;scissors&quot;. The game has only three possible outcomes other than a tie: a player who decides to play rock will beat another player who has chosen scissors (&quot;rock crushes scissors&quot;) but will lose to one who has played paper (&quot;paper covers rock&quot;); a play of paper will lose to a play of scissors (&quot;scissors cut paper&quot;). If both players choose the same shape, the game is tied and is usually immediately replayed to break the tie.<br><br>Recently, there is a upgraded edition of this game: rock-paper-scissors-Spock-lizard, in which there are totally five shapes. The rule is simple: scissors cuts paper; paper covers rock; rock crushes lizard; lizard poisons Spock; Spock smashes scissors; scissors decapitates lizard; lizard eats paper; paper disproves Spock; Spock vaporizes rock; and as it always has, rock crushes scissors.<br><br>Both rock-paper-scissors and rock-paper-scissors-Spock-lizard are balanced games. Because there does not exist a strategy which is better than another. In other words, if one chooses shapes randomly, the possibility he or she wins is exactly $50\\%$ no matter how the other one plays (if there is a tie, repeat this game until someone wins). Given an integer $N$, representing the count of shapes in a game. You need to find out if there exist a rule to make this game balanced.","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains an integer t, the number of test cases. t test cases follow.<br>For each test case, there is only one line with an integer $N~(2\\leq N \\leq 1000)$, as described above.<br><br>Here is the sample explanation.<br><br>In the first case, donate two shapes as A and B. There are only two kind of rules: A defeats B, or B defeats A. Obviously, in both situation, one shapes is better than another. Consequently, this game is not balanced.<br><br>In the second case, donate two shapes as A, B and C. If A defeats B, B defeats C, and C defeats A, this game is balanced. This is also the same as rock-paper-scissors.<br><br>In the third case, it is easy to set a rule according to that of rock-paper-scissors-Spock-lizard.","type":"input_format","format":"html"},{"title":"Output","content":"For each test cases, output &quot;Balanced&quot; if there exist a rule to make the game balanced, otherwise output &quot;Bad&quot;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2\n3\n5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Bad\nBalanced\nBalanced</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+ACM%2FICPC+Asia+Regional+Qingdao+Online&amp;source=1&amp;searchmode=source\"> 2016 ACM/ICPC Asia Regional Qingdao Online </a> ","type":"source","format":"html"}]}