{"title":"Resident Evil","time_limit":3000,"memory_limit":512,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5892","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5892&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5892","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5892"},"statement":[{"title":"Problem Description","content":"The Umbrella Company has developed a new biochemical virus secretly. Lyon, a staff of the company, happened to find out the conspiracy and his company is now stopping him from discovering further evidence by releasing biochemical monster in his city (don&#x2019;t ask me why the company is using this weird method).<br><br>The city can be described as an n*n grids. The Umbrella Company has 50 kinds of biochemical monster in total. The company will specify the type, quantity of biochemical monster and the rectangle area to put monster. For example, if the specified rectangle area has upper left corner (1, 1) and bottom right corner of (3, 3), and the company wishes to put 3 of A monster, 2 of B monster and 1 of C monster in it, then 3 of A monster, 2 of B monster and 1 of C monster is added to each and every grid inside the area.<br><br>However, Lyon risk his life of finding evidence by searching certain rectangle area. By doing this, all monsters inside the area would gather to him. He has two way of dealing with monster. If the number of a certain kind of monster is even, then he would choose to hide, otherwise withdraw.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"A line containing n and m (1&lt;=n&lt;=3000 1&lt;=m&lt;=100000). Representing the size of the city and the number of operations.<br><br>&#xA0;&#xA0;Then m lines of operation and there are only two kinds of operation.<br><br>Letter &#x2018;P&#x2019; means to release monster, followed by 4 integers x1, y1, x2, y2 (1&lt;=x1, y1, x2, y2&lt;=n) , describing the upper left corner and bottom right corner of the area. Then an integer K(1&lt;=K&lt;=50), meaning there will be k pair of number (A, B) given next. A (1&lt;=A&lt;=50) indicates the kind of the monster and B (1&lt;=b&lt;=100000) indicates the number of this kind being added to this area.<br><br>Letter &#x2018;Q&#x2019; represents the query operation, followed by 4 integers x1, y1, x2, y2 (1&lt;=x1, y1, x2, y2&lt;=n), describing the upper left corner and bottom right corner of the area.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For every &#x2018;Q&#x2019; operation. Print 50 number in a line, meaning the kind of action he would take for different kinds of monsters. 1 represents hiding and 2 represents withdrawing.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2\nP 1 1 2 2 1 1 1 \nQ 1 1 1 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 1 1 1 1 1 ........1 &#xFF08;one &apos;2&apos; and  forty-nine &apos;1&apos;&#xFF09;</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+ACM%2FICPC+Asia+Regional+Shenyang+Online&amp;source=1&amp;searchmode=source\"> 2016 ACM/ICPC Asia Regional Shenyang Online </a> ","type":"source","format":"html","require":["katex"]}]}