{"title":"Mission Possible","time_limit":18000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=5931","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=5931&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=5931","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=5931"},"statement":[{"title":"Problem Description","content":"Mr. Frog loves playing video games. However, it seems that he does not have enough gift in this field, so he often gets stuck in some certain levels. Now this annoying situation comes to him again.<br><br>In this mission, Mr. Frog is asked to pass a<br>dangerous region which is currently under his enemies, control. Every second he is inside this region, his enemies would attack him with everything they have. Luckily, he is wearing a powersuit and still have time to enhance it.<br><br>powersuit has three main attributes&#xFFFD;&#xFFFD; health point, velocity and recover speed. In the begin&amp;#172;ning of this mission, the powersuit has H health points, and is able to move at no faster than Vm/s. Once the health point of powersuit is less than 0, the powersuit would be totally destroyed and Mr. Frog would immediately be killed. At the end of every second that the powersuit still works, the suit would repair itself and recover R health points.<br><br>After precise calculation, Mr. Frog has found that, to go through this area, he needs to run at least D meters distance, and every second his enemies, attack would cause A health point loss. Note that attacks take place all the time while the recover <b>only happens at the end of every second</b>, so you can consider that, in <b>every whole second</b>, the powersuit first loses A health points and then recovers R health points at the end of it, if it still works at that moment.<br><br>Mr. Frog could enhance his powersuit at any time he wants during the mission. At the beginning all three attributes of his powersuit equals to 0. He needs to pay $G_1$ in order to increase H by 1, while $G_2$ to increase V by 1 and $G_3$ to increase R by 1. For any of these three values, he can only increase it by non-negative integer. For some well-known reasons, Mr. Frog does not want to finish the game too quickly, so you <b>cannot</b> increase the powersuit&apos;s speed to <b>more than</b> D m/s. Since you looks so clever, now Mr. Frog wants to know not only how he can finish this mission, but also the way to spend the least money, can you help him?<br>","type":"description","format":"html"},{"title":"Input","content":"The first line contains only one integer T, which indicates the number of test cases. For each test case&#xFFFD;&#xFFFD;there are five integers $D,A,G_1,G_2,G_3$.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case&#xFFFD;&#xFFFD;output one line &#xFFFD;&#xFFFD;Case #x: Ans&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;where x is the case number (starting from 1) and Ans is the minimum cost required to finish the mission.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5 1 1 2 5\n10 1 1 2 5</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 7\nCase #2: 8\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\n1 &lt;= D,A &lt;= 500000, 1 &lt;= G1, G2, G3 &lt;= 200 \n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016CCPC%B6%AB%B1%B1%B5%D8%C7%F8%B4%F3%D1%A7%C9%FA%B3%CC%D0%F2%C9%E8%BC%C6%BE%BA%C8%FC+-+%D6%D8%CF%D6%C8%FC&amp;source=1&amp;searchmode=source\"> 2016CCPC&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x467;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x1BE;&#xFFFD;&#xFFFD;&#xFFFD; - &#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}