{"title":"Worried School","time_limit":1000,"memory_limit":32,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6008","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6008&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6008","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6008"},"statement":[{"title":"Problem Description","content":"You may already know that how the World Finals slots are distributed in EC sub-region. But you still need to keep reading the problem in case some rules are different.<br>There are totally G slots for EC sub-region. X slots will be distributed among five China regional sites and Y slots will be distributed to the EC-Final. Of course X and Y are non-negative integers and X + Y = G.<br>Here is how the X slots be distributed:<br><pre><br>      1. Slots are assigned to the Asia Regional sites from the first place, the second place, &#xB7; &#xB7; &#xB7; , last place.<br>      2. For schools having the same place across the sites, the slots will be given in the order of the number of &#x201C;effective <br>         teams&#x201D; in the sites.<br>      3. No school could be assigned a slot 2 times, which means the schools will be skipped if they already got a slot.<br></pre><br>After X slots are distributed, the EC-Final ranklist from highest rank will be assigned Y slots for those schools that haven&#x2019;t got a slot yet.<br>Now here comes a sad story, as X and Y are not announced until the end of the last regional contest of that year, even later!!!<br>Teachers from a school are worried about the whether they can advance to WF whatever the X and Y is. Let&#x2019;s help them find out the results before the announcement of X and Y .<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input gives the number of test cases, T. T test cases follow.<br>Each test case starts with a line consisting of 1 integer and 1 string, G representing the sum of X and Y and S representing the name of the worried school.<br>Next 5 lines each consists of 20 string representing the names of top 20 schools in each site. The sites are given in the order of the number of &#x201C;effective teams&#x201D; which means the first site has the largest number of &#x201C;effective teams&#x201D; and the last site has the smallest numebr of &#x201C;effective teams&#x201D;.<br>The last line consists of 20 strings representing the names of top 20 schools in EC-Final site. No school can appear more than once in each ranklist","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output one line containing &#x201C;Case #x: y&#x201D;, where x is the test case number (starting from 1) and y is &#x201C;ADVANCED!&#x201D; if every non-negative value X, Y will advance the school. Otherwise, output the smallest value of Y that makes the school sad.<br>$\\bullet$ 1 &#x2264; T &#x2264; 200.<br>$\\bullet$ School names only consist of upper case characters &#x2018;A&#x2019; - &#x2018;Z&#x2019; and the length is at most 5.<br>$\\bullet$ 1 &#x2264; G &#x2264; 20.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n10 IJU\nUIV GEV LJTV UKV QLV TZTV AKOV TKUV\nGAV DVIL TDBV ILVTU AKV VTUD IJU IEV\nHVDBT YKUV ATUV TDOV\nTKUV UIV GEV AKV AKOV GAV DOV TZTV\nAVDD IEV LJTV CVQU HVDBT AKVU XIV TDVU\nOVEU OVBB KMV OFV\nQLV OCV TDVU COV EMVU TEV XIV\nVFTUD OVBB OFV DVHC ISCTU VTUD OVEU DTV\nHEVU TEOV TDV TDBV CKVU\nCVBB IJU QLV LDDLQ TZTV GEV GAV KMV\nOFV AVGF TXVTU VFTUD IEV OVEU OKV DVIL\nTEV XIV TDVU TKUV\nUIV DVIL VFTUD GEV ATUV AKV TZTV QLV\nTIV OVEU TKUV UKV IEV OKV CVQU COV\nOFOV CVBB TDVU IOV\nUIV TKUV CVBB AKV TZTV VFTUD UKV GEV\nQLV OVEU OVQU AKOV TDBV ATUV LDDLQ AKVU\nGAV SVD TDVU UPOHK</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 4\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nFor the first test case, the optimal solution is X = 6 and Y = 4, at this time the advanced schools were [UIV, TKUV, QLV, CVBB, GEV, OCV, AKV, TZTV, VFTUD, UKV].\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2016+CCPC-Final&amp;source=1&amp;searchmode=source\"> 2016 CCPC-Final </a> ","type":"source","format":"html","require":["katex"]}]}