{"title":"Count the Sheep","time_limit":1500,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6016","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6016&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6016","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6016"},"statement":[{"title":"Problem Description","content":"Altough Skipping the class is happy, the new term still can drive luras anxious which is of course because of the tests! Luras became worried as she wanted to skip the class, as well as to attend the BestCoder and also to prepare for tests at the same time.<br><br>However, As the result of preparing for tests, luras had no time to practice programing. She didn&apos;t want to lose her rating after attending BC. In the end, she found BCround92&apos;s writer snowy_smile for help, asking him to leak her something.<br><br>Snowy_smile wanted to help while not leaking the problems. He told luras, the best thing to do is to take a good rest according to the following instructions first.<br><br>&quot;Imagine you are on the endless grassland where there are a group of sheep. And n sheep of them are silent boy-sheep while m sheep are crying girl-sheep. And there are k friend-relationships between the boy-sheep and girl-sheep.Now You can start from any sheep, keep counting along the friend relationship. If you can count 4 different sheep, you will exceed 99% sheep-counters and fall asleep.&quot;<br><br>Hearing of the strange instructions, luras got very shocked. Still, she kept counting. Sure enough, she fell asleep after counting 4 different sheep immediately. And, she overslept and missed the BestCoder in the next day. At a result, she made it that not losing her rating in the BCround92!!!<br><br>However, you don&apos;t have the same good luck as her. Since you have seen the 2nd problem, you are possible to have submitted the 1st problem and you can&apos;t go back.<br><br>So, you have got into an awkward position. If you don&apos;t AC this problem, your rating might fall down.<br><br>You question is here, please, can you tell that how many different 4-sheep-counting way luras might have before her sleep?<br><br>In another word, you need to print the number of the &quot;A-B-C-D&quot; sequence, where A-B, B-C, C-D are friends and A,B,C,D are different.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line is an integer T which indicates the case number.<br><br>and as for each case, there are 3 integers in the first line which indicate boy-sheep-number, girl-sheep-number and friend-realationship-number respectively.<br><br>Then there are k lines with 2 integers x and y in each line, which means the x-th boy-sheep and the y-th girl-sheep are friends.<br><br>It is guaranteed that&#x2014;&#x2014;<br><br>There will not be multiple same relationships.<br><br>1 &lt;= T &lt;= 1000<br><br>for 30% cases, 1 &lt;= n, m, k &lt;= 100<br><br>for 99% cases, 1 &lt;= n, m, k &lt;= 1000<br><br>for 100% cases, 1 &lt;= n, m, k &lt;= 100000","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"As for each case, you need to output a single line.<br><br>there should be 1 integer in the line which represents the number of the counting way of 4-sheep-sequence before luras&apos;s sleep.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n2 2 4\n1 1\n1 2\n2 1\n2 2\n3 1 3\n1 1\n2 1\n3 1\n3 3 3\n1 1\n2 1\n2 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">8\n0\n2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=BestCoder+Round+%2392&amp;source=1&amp;searchmode=source\"> BestCoder Round #92 </a> ","type":"source","format":"html","require":["katex"]}]}