{"title":"Automatic Judge","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6023","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6023&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6023","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6023"},"statement":[{"title":"Problem Description","content":"Welcome to HDU to take part in the second CCPC girls&#x2019; competition!<br>A new automatic judge system is used for this competition. During the five-hour contest time, you can submit your code to the system, then the judge will reply you. Here is a list of the judge&apos;s replies and their meaning:<br><br>   1.   $Accepted (AC) $: Yes, your program is correct. You did a good job!<br><br>   2.   $Presentation Error (PE)$ : Your program&apos;s output format is not exactly the same as required by the problem, although the output is correct. This usually means the existence of omitted or extra blank characters (white spaces, tab characters and/or new line characters) between any two non-blank characters, and/or blank lines (a line consisting of only blank characters) between any two non-blank lines. Trailing blank characters at the end of each line and trailing blank lines at the of output are not considered format errors. Check the output for spaces, blank lines, etc. against the problem&apos;s output specification.<br><br>   3.   $Wrong Answer (WA)$ : Correct solution not reached for the inputs. The inputs and outputs that we use to test the programs are not public (it is recomendable to get accustomed to a true contest dynamic :-)<br><br>   4.   $Runtime Error (RE)$ : Your program failed during the execution and you will receive the hints for the reasons.<br><br>   5.   $Time Limit Exceeded (TLE)$ : Your program tried to run during too much time.<br><br>   6.   $Memory Limit Exceeded (MLE) $: Your program tried to use more memory than the judge default settings.<br><br>   7.   $Output Limit Exceeded (OLE) $: Your program tried to write too much information. This usually occurs if it goes into a infinite loop.<br><br>   8.   $Compilation Error (CE) $: The compiler fails to compile your program. Warning messages are not considered errors. Click on the judge&apos;s reply to see the warning and error messages produced by the compiler.<br><br>For each submission, if it is the first time that the judge returns ``AC&apos;&apos; on this problem, then it means you have passed this problem, and the current time will be added to the penalty of your team. In addition, every time you pass a problem, each unsuccessful try for that problem before is counted as 20 minutes penalty, it should also be added to the penalty of your team.<br>Now given the number of problems in the contest and the submission records of a team. Please write a program to calculate the number of problems the team passed and their penalty.","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains an integer $T(1\\leq T\\leq20)$, denoting the number of test cases.<br>In each test case, there are two integers $n(1\\leq n\\leq 13)$ and $m(1\\leq m\\leq 100)$ in the first line, denoting the number of problems and the number of submissions of a team. Problems are labeled by 1001, 1002, ..., $1000+n$.<br>In the following $m$ lines, each line contains an integer $x(1001\\leq x\\leq 1000+n)$ and two strings $t(00:00\\leq t\\leq 05:00)$ and $s$, denoting the team submits problem $x$ at time $t$, and the result is $s$. $t$ is in the format of HH:MM, while $s$ is in the set \\{AC, PE, WA, RE, TLE, MLE, OLE\\}. The team is so cautious that they never submit a CE code. It is guaranteed that all the $t$ in the input is in ascending order and every $t$ is unique.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, print a single line containing two integers $A$ and $B$, denoting the number of problems the team passed and the penalty.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 5\n1002 00:02 AC\n1003 00:05 WA\n1003 00:06 WA\n1003 00:07 AC\n1002 04:59 AC</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 49</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017%D6%D0%B9%FA%B4%F3%D1%A7%C9%FA%B3%CC%D0%F2%C9%E8%BC%C6%BE%BA%C8%FC+-+%C5%AE%C9%FA%D7%A8%B3%A1&amp;source=1&amp;searchmode=source\"> 2017&#x4E2D;&#x56FD;&#x5927;&#x5B66;&#x751F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7ADE;&#x8D5B; - &#x5973;&#x751F;&#x4E13;&#x573A; </a> ","type":"source","format":"html"}]}