{"title":"Classes","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6106","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6106&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6106","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6106"},"statement":[{"title":"Problem Description","content":"The school set up three elective courses, assuming that these courses are A, B, C. N classes of students enrolled in these courses.<br>Now the school wants to count the number of students who enrolled in at least one course in each class and records the maximum number of students.<br>Each class uploaded 7 data, the number of students enrolled in course A in the class, the number of students enrolled in course B, the number of students enrolled in course C, the number of students enrolled in course AB, the number of students enrolled in course BC, the number of students enrolled in course AC, the number of students enrolled in course ABC. The school can calculate the number of students in this class based on these 7 data.<br>However, due to statistical errors, some data are wrong and these data should be ignored.<br>Smart you must know how to write a program to find the maximum number of students.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input gives the number of test cases T; T test cases follow.<br>Each case begins with one line with one integer N, indicates the number of class.<br>Then N lines follow, each line contains 7 data: a, b, c, d, e, f, g, indicates the number of students enrolled in A, B, C, AB, BC, AC, ABC in this class. <br>It&apos;s guaranteed that at least one data is right in each test case.<br><br>Limits<br>$T \\leq 100$<br>$1 \\leq N \\leq 100$<br>$0 \\leq a, b, c, d, e, f, g \\leq 100$","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case output one line contains one integer denotes the max number of students who enrolled in at least one course among N classes.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2\n4 5 4 4 3 2 2\n5 3 1 2 0 0 0\n2\n0 4 10 2 3 4 9\n6 12 6 3 5 3 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7\n15\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the second test case, the data uploaded by Class 1 is wrong. \nBecause we can&apos;t find a solution which satisfies the limitation. \nAs for Class 2, we can calculate the number of students who only enrolled in course A is 2, \nthe number of students who only enrolled in course B is 6, and nobody enrolled in course C,\nthe number of students who only enrolled in courses A and B is 1, \nthe number of students who only enrolled in courses B and C is 3, \nthe number of students who only enrolled in courses A and C is 1, \nthe number of students who enrolled in all courses  is 2, \nso the total number in Class 2 is 2 + 6 + 0 + 1 + 3 + 1 + 2 = 15.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017+Multi-University+Training+Contest+-+Team+6&amp;source=1&amp;searchmode=source\"> 2017 Multi-University Training Contest - Team 6 </a> ","type":"source","format":"html","require":["katex"]}]}