{"title":"Engineering of the Clones","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6137","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6137&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6137","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6137"},"statement":[{"title":"Problem Description","content":"&gt; Cloning was the process of creating a genetically identical or&#x2014;purposefully and specifically&#x2014;modified copy of an original organism. It was also one of the key factors that facilitated the end of the Galactic Republic and the dawn of the Galactic Empire in its place. Through the science of cloning, a vast clone army was created on Kamino for the purpose of serving the Republic. Programmed with absolute loyalty to Supreme Chancellor Palpatine, leader of the Galactic Senate and secretly the Sith Lord Darth Sidious, the clones proved to be instrumental in his rise to the position of Emperor. The military applications of cloning were further exploited by the New Order through the creation of countless more clone soldiers, all used mainly for the sole purpose of spreading and enforcing Imperial hegemony throughout the galaxy.<br>&gt;<br>&gt; &#x2014; Wookieepedia<br><br>The clones are engineered such that all have exactly the same genetic footprint, and are flash-learned directly from a template. Thus, all clones should be completely identical to the original person in theory. However, the cloning procedure is proven to be defective. A clone may be physically deformed and will die in his early age, or even worse, a seemingly functional clone may also have tiny defects in the brain development that may leak secretly programmed information. During the Clone War, such a rare case was reported: a Jedi was killed by a malfunctioning clone believed that the Order 66 has been issued, and the case nearly lead to the Jedi Council to discover the secret plan of the evil Darth Sidious.<br><br>After the malfunctioning case was reported, Chancellor Palpatine decided to carefully test all clones before they are being delivered to the battlefield. This is done by a procedure called &quot;high-precision genome fingerprinting&quot; that balances the time and the money. In particular, the entire gnome of a clone is taken and encoded as a single number. Only one digit of that number is actually sampled and tested.<br><br>Given genes denoted by prime numbers  $p_1, p_2, .. , p_n$, the genome of the clone is represented by a number $A$ defined as  <br><br>$$A=p_1^{r_1} p_2^{r_2} .. p_n^{r_n}$$<br><br>where <br>$$<br>\\left| r_i - r_j \\right| \\le 1, 1 \\le i \\le j \\le n.<br>$$<br><br>Since $A$ may be huge in size, the test process only samples one digit as the fingerprint: the $k$-th digit of $\\frac{1}{A - 1}$ written in base $\\prod_{i=1}^{n} p_i$.<br><br>You received the mission of designing an algorithm to perform the genome fingerprinting test. Given a genome description ($p_i$ and $r_i$) and $k$, you should find the fingerprint value.","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains an integer $T$, denoting the number of test cases. <br><br>For each test case, the first line contains two integers $n$ ($1\\le n\\le 10^6$) and $k$ ($1\\le k \\lt \\max\\{r^2_1, r^2_2, .. , r^2_n\\}$). <br><br>The next line contains $n$ distinct primes. The $i$-th number is $p_i$ $1\\le \\prod_{i=1}^{n} p_i \\le 10^6$.<br><br>The next line contains $n$ integers. The $i$-th number is $r_i$ ($1\\le r_i \\le 5 * 10^4$).","type":"input_format","format":"html"},{"title":"Output","content":"You should output the answers for the queries, one integer per line. <br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2 1\n2 5\n2 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">0</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017+Multi-University+Training+Contest+-+Team+8&amp;source=1&amp;searchmode=source\"> 2017 Multi-University Training Contest - Team 8 </a> ","type":"source","format":"html"}]}