{"title":"Fleet of the Eternal Throne ","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6138","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6138&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6138","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6138"},"statement":[{"title":"Problem Description","content":"&gt; The Eternal Fleet was built many centuries ago before the time of Valkorion by an unknown race on the planet of Iokath. The fate of the Fleet&apos;s builders is unknown but their legacy would live on. Its first known action was in the annihilation of all life in Wild Space. It spread across Wild Space and conquered almost every inhabited world within the region, including Zakuul. They were finally defeated by a mysterious vessel known as the Gravestone, a massive alien warship that countered the Eternal Fleet&apos;s might. Outfitted with specialized weapons designed to take out multiple targets at once, the Gravestone destroyed whole sections of the fleet with a single shot. The Eternal Fleet was finally defeated over Zakuul, where it was deactivated and hidden away. The Gravestone landed in the swamps of Zakuul, where the crew scuttled it and hid it away.<br>&gt;<br>&gt; &#x2014; Wookieepedia<br><br>The major defeat of the Eternal Fleet is the connected defensive network. Though being effective in defensing a large fleet, it finally led to a chain-reaction and was destroyed by the Gravestone. Therefore, when the next generation of Eternal Fleet is built, you are asked to check the risk of the chain reaction.<br><br>The battleships of the Eternal Fleet are placed on a 2D plane of $n$ rows. Each row is an array of battleships. The type of a battleship is denoted by an English lowercase alphabet. In other words, each row can be treated as a string. Below lists a possible configuration of the Eternal Fleet.<br><br><br>aa<br>bbbaaa<br>abbaababa<br>abba<br><br><br>If in the $x$-th row and the $y$-th row, there exists a consecutive segment of battleships that looks identical in both rows (i.e., a common substring of the $x$-th row and $y$-th row), at the same time the substring is a prefix of any other row (can be the $x$-th or the $y$-th row), the Eternal Fleet will have a risk of causing chain reaction.<br><br>Given a query ($x$, $y$), you should find the longest substring that have a risk of causing chain reaction.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of the input contains an integer $T$, denoting the number of test cases. <br><br>For each test cases, the first line contains integer $n$ ($n\\le10^5$).<br><br>There are $n$ lines following, each has a string consisting of lower case letters denoting the battleships in the row. The total length of the strings will not exceed $10^5$.<br><br>And an integer $m$ ($1\\le m\\le100$) is following, representing the number of queries. <br><br>For each of the following $m$ lines, there are two integers $x, y$, denoting the query. ","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"You should output the answers for the queries, one integer per line. ","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\naaa\nbaaa\ncaaa\n2\n2 3\n1 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017+Multi-University+Training+Contest+-+Team+8&amp;source=1&amp;searchmode=source\"> 2017 Multi-University Training Contest - Team 8 </a> ","type":"source","format":"html","require":["katex"]}]}