{"title":"Ch’s gift","time_limit":3000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6162","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6162&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6162","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6162"},"statement":[{"title":"Problem Description","content":"Mr. Cui is working off-campus and he misses his girl friend very much. After a whole night tossing and turning, he decides to get to his girl friend&apos;s city and of course, with well-chosen gifts. He knows neither too low the price could a gift be since his girl friend won&apos;t like it, nor too high of it since he might consider not worth to do. So he will only buy gifts whose price is between [a,b].<br>There are n cities in the country and (n-1) bi-directional roads. Each city can be reached from any other city. In the ith city, there is a specialty of price ci Cui could buy as a gift. Cui buy at most 1 gift in a city. Cui starts his trip from city s and his girl friend is in city t. As mentioned above, Cui is so hurry that he will choose the quickest way to his girl friend(in other words, he won&apos;t pass a city twice) and of course, buy as many as gifts as possible. Now he wants to know, how much money does he need to prepare for all the gifts?<br>","type":"description","format":"html"},{"title":"Input","content":"There are multiple cases.<br><br>For each case:<br>The first line contains tow integers n,m(1&#xFFFD;&#xFFFD;n,m&#xFFFD;&#xFFFD;10^5), representing the number of cities and the number of situations.<br>The second line contains n integers c1,c2,...,cn(1&#xFFFD;&#xFFFD;ci&#xFFFD;&#xFFFD;10^9), indicating the price of city i&apos;s specialty.<br>Then n-1 lines follows. Each line has two integers x,y(1&#xFFFD;&#xFFFD;x,y&#xFFFD;&#xFFFD;n), meaning there is road between city x and city y.<br>Next m line follows. In each line there are four integers s,t,a,b(1&#xFFFD;&#xFFFD;s,t&#xFFFD;&#xFFFD;n;1&#xFFFD;&#xFFFD;a&#xFFFD;&#xFFFD;b&#xFFFD;&#xFFFD;10^9), which indicates start city, end city, lower bound of the price, upper bound of the price, respectively, as the exact meaning mentioned in the description above<br>","type":"input_format","format":"html"},{"title":"Output","content":"Output m space-separated integers in one line, and the ith number should be the answer to the ith situation.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 3\n1 2 1 3 2\n1 2\n2 4\n3 1\n2 5\n4 5 1 3\n1 1 1 1\n3 5 2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7 1 4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017+Multi-University+Training+Contest+-+Team+9&amp;source=1&amp;searchmode=source\"> 2017 Multi-University Training Contest - Team 9 </a> ","type":"source","format":"html"}]}