{"title":"Brother and Sister","time_limit":1000,"memory_limit":149.83203125,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6174","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6174&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6174","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6174"},"statement":[{"title":"Problem Description","content":"Jin Song and Jin Hui are brother and sister. They go to same university. Jin Song is a member of ICPC training club and Jin Hui is a member of English club.<br>Today is Jin Hui&#x2019;s $17^{th}$ birthday and it is also the first birthday at university. So, as a good brother, Jin Song prepared an amazing present for his pretty younger sister. But, the mischievous sister went university before he gets up, so he decided to go to the English club and give his birthday present to her.<br>Jin Hui is a very clever girl, so she thought that her brother will surely come to see her and decided to prepare a funny trick for him. She has n fellows at the English club, and they all agreed with her idea.<br>First, she asked her fellows to wear same uniform and thick glasses just like as her so that the n+1 girls look like the same. By doing so, Jin Song will get confused and try to find his sister. The trick goes as follow:<br>Step 1: He randomly and uniformly chooses a girl i who wasn&#x2019;t asked yet and asks to her &#x201C;Are you my sister?&#x201D;.<br>Step 2: If the current girl i is Jin Hui(that is, i = 0), she will immediately end this trick. <br>Else, girl i will say that Jin Hui is the girl pi.<br>$\\bullet$ If $p_i$ = i (hence, she says that she is Jin Hui) or Jin Song had already asked the girl pi, he will notice that they told him a lie and go to Step 1.<br>$\\bullet$Else, he will ask to girl pi and go to Step 2.<br>Jin Song wants to meet his younger sister as soon as possible, and he wants to know how long it will take to meet his pretty younger sister.<br>So, your task is to work out the expected value of the number of girls Jin Song will meet before the trick ends (including his younger sister).<br>Two ways are considered different if and only if the sequence of asked girls is different. In other words, there is at least one number k, the girls he met in k-th turn are different.<br>","type":"description","format":"html"},{"title":"Input","content":"The first line of input contains an integer T (1 &lt;= T &lt;= 10) , the number of test cases. <br>Each test case consists of two lines. The first line of each test case contains an integer n (1 &lt;= n &lt;= 100000), the number of Jin Hui&#x2019;s fellows. All her fellows are numbered from 1 to n. Jin Hui is numbered 0. Next line contains n space-separated integers $p_1, p_2, ..., p_n$ (1 &lt;= $p_i$ &lt;= n), where $p_i$ indicates the number of girl pointed by girl i.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, you can represent the expected value in a irreducible fraction of p/q (that is, p and q are co-primes). Then, you must output a single integer $pq^{-1}$  mod ($10^9$+7) in one line. ","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3\n2 3 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">250000005\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\n<center><img src=\"../../../data/images/C767-1004-1.jpg\"></center> \nThere are 4 ways to choose the first girl.\nIf you choose the first girl of trick, then the trick is uniquely determined.\nOne way is to choose his sister first, and others are to choose 1, 2, 3.\nIf he chooses his sister first, the trick ends in one turn.\nIf he chooses 1 first, then he must follow in order of 1, 2, 3.\nThen he will notice that they told him a lie and directly go to his sister.\nSo the trick ends in four turns following the sequence of {1, 2, 3, 0}.\nIn case of choosing 2 or 3 first is very similar ({2, 3, 1, 0}, {3, 1, 2, 0}).\nEach case occurs with the same probability of 1 / 4.\nSo the answer is \n(1 + 4 + 4 + 4) * 4^(-1) mod (10^9+7) = 250000005\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017+Multi-University+Training+Contest+-+Team+10&amp;source=1&amp;searchmode=source\"> 2017 Multi-University Training Contest - Team 10 </a> ","type":"source","format":"html"}]}