{"title":"Defense of the Ancients","time_limit":2000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6220","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6220&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6220","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6220"},"statement":[{"title":"Problem Description","content":"In the game of Defense of the Ancients, a team has n units and the other team has m towers. Each unit and towerhas some hit points (HP) and a fixed attack power (AP). The units (resp. towers) with positive HP are surviving and can attack the towers (resp. units), and the units (resp. towers) with zero HP are dead (resp. destroyed) andcannot attack anything.<br>The game is real-time and the time goes continuously. If a tower (resp. unit) is being attacked by k units (resp.towers) with the AP of $a_1, a_2, ... , a_k$ at the same time, then its HP will continuously decrease with the rate of $a_1 + a_2 + ... + a_k$ per second. There is no restriction on attack ranges. That is, any unit can attack any towers andvice versa.<br>During the whole game, the surviving units (resp. towers) will attack a selected tower (resp. unit) together untilit has been destroyed (resp. killed). That is, the surviving units (resp. towers) will focus to destroy (resp. kill) the towers (resp. units) one by one.<br>If all the units are killed and there is at least a surviving tower, the tower team wins. If all the towers are destroyed and there is at least a surviving unit, the unit team wins. If all the units are killed and all the towers are destroyed at the same time, the game ends in a tie.<br>Both teams play optimally. Your task is to predict the winner of the game.","type":"description","format":"html"},{"title":"Input","content":"The first line is the number of test cases up to 10.<br>For each test case, there are 5 lines. The first line contains two integers n and m (0 &lt; n &#xFFFD;&#xFFFD; 10^5, 0 &lt; m &#xFFFD;&#xFFFD; 10^5).<br>The second line contains n integers, which are the HP of the units. The third line contains n integers, which are the AP of the units. The forth line contains m integers, which are the HP of the towers. The fifth line contains m integers, which are the AP of the towers.<br>All the HP and AP are positive and less than 2^32.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, if the unit team has a winning strategy, output &#xFFFD;&#xFFFD;Units win&#xFFFD;&#xFFFD;, if the tower team has a winning strategy, output &#xFFFD;&#xFFFD;Towers win&#xFFFD;&#xFFFD;, if the game ends in a tie, output &#xFFFD;&#xFFFD;Tie&#xFFFD;&#xFFFD;.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 1\n10\n10\n9\n11\n2 2\n1 1\n5 4\n2 1\n4 2\n3 3\n1 2 3\n1 4 9\n1 4 9\n1 2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Units win\nTowers win\nTie</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017ACM%2FICPC%D1%C7%D6%DE%C7%F8%C9%F2%D1%F4%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%B6%AB%B1%B1%B4%F3%D1%A7%A3%A9&amp;source=1&amp;searchmode=source\"> 2017ACM/ICPC&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x57E;-&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x43B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x467;&#xFFFD;&#xFFFD; </a> ","type":"source","format":"html"}]}