{"title":"X-Men","time_limit":1000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6233","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6233&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6233","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6233"},"statement":[{"title":"Problem Description","content":"There is a kingdom called Dream Kingdom with $N$ cities connected by $N - 1$ roads. There is a path between any two city. The length of each road is one kilometer. The cities are numbered from $1$ to $N$. There are $M$ X-men in this kingdom. The $i$-th X-man is in the city numbered $a_i(1 \\leq a_i \\leq N)$. There can be no or multiple X-men in one city.<br><br>Everyone start to walk simultaneously. At the beginning of each hour, one man will choose a adjacent city (&quot;adjacent&quot; means there is a road between two cities) which is on the shortest path to the city where there is a man he can communicate with now. If there are several eligible adjacent cities that can be chosen, the X-man will choose one of them \\textbf{randomly}. Each x-man will make the decision and move simultaneously. The speed of X-men is only one kilometer per hour. So they will move to chosen city at the end of each hour. X-men can communicate with the people whose distance to him is \\textbf{more than one} kilometer at this time. If there are no X-man he can communicate with now, he will not move in the following hour.<br><br>The king of the Dream Kingdom want to arrest X-men. And at the beginning of one hour he could check whether there is any X-man can move in the following hour. If the king knows no X-man can move in the following hour, he will send the army to catch all X-men immediately.<br><br>Now the king wants you to help him calculate the expected hours he could arrest the X-men. In other words, you need to calculate the expected hours such that all X-men stop moving.","type":"description","format":"html"},{"title":"Input","content":"The first line is the number of test cases.<br><br>For each test case, the first line contains two positive numbers $N(1 \\leq N \\leq 10^3), M(1 \\leq M \\leq 10^3)$. The second line contains $M$ numbers $a_i (1 \\leq a_i \\leq N)$.<br><br>The following $N - 1$ lines describe the roads. Each line contains two integers $u, v$ $(1 \\leq u,v \\leq N)$, denoting there is a road between city $u$ and city $v$.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output one number in one single line representing the answer. You should output your answer rounded to two decimal places.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n7 3\n5 6 7\n1 2\n1 3\n1 4\n5 2\n6 3\n4 7\n3 3\n1 1 2\n1 2\n2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2.00\n0.00\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first example, each X-man only have one adjacent city can be chosen to move in the first hour. They will move from city {5, 6, 7} to city {2, 3, 4} respectively. Each X-man only have one adjacent city can be chosen to move in the second hour, too. They will all move to city {1}. And then all of them can&apos;t feel any X-man such that distance between two X-men is more than one unit length. So they will be arrested immediately after two hours from the beginning to now. This is the only situation. So the answer is {2/1 = 2.00}.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2017%D6%D0%B9%FA%B4%F3%D1%A7%C9%FA%B3%CC%D0%F2%C9%E8%BC%C6%BE%BA%C8%FC-%B9%FE%B6%FB%B1%F5%D5%BE-%D6%D8%CF%D6%C8%FC%A3%A8%B8%D0%D0%BB%B9%FE%C0%ED%B9%A4%A3%A9&amp;source=1&amp;searchmode=source\"> 2017&#x4E2D;&#x56FD;&#x5927;&#x5B66;&#x751F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7ADE;&#x8D5B;-&#x54C8;&#x5C14;&#x6EE8;&#x7AD9;-&#x91CD;&#x73B0;&#x8D5B;&#xFF08;&#x611F;&#x8C22;&#x54C8;&#x7406;&#x5DE5;&#xFF09; </a> ","type":"source","format":"html"}]}