{"title":"Rikka with Mutex","time_limit":1000,"memory_limit":500,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6261","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6261&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6261","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6261"},"statement":[{"title":"Problem Description","content":"Sometimes, technical terms implicate some life philosophy. Mutex is one of them. On your way to dream, you may be locked by some difficulties, and you need someone to stop his step, and help you get through them.<br><br>To help you know better about the life philosophy inside mutex, Rikka comes up with a simple task. Maybe some of you know little about mutex, so she uses another scene to replace it.<br><br>There are $n$ gates in a row, several people in the left side of the gates and all of them want to go to the right side. There are two kinds of gates: black and white. These people share energy, which is represented by a non-negative number $E$. Initially, $E =0 $.<br><br>If one person walks through a white gate, he will gain one point of energy, i.e., $E$ will be added by $1$. And if one person walks through a black gate, he will lose one point of energy, i.e., $E$ will be subtracted by $1$. Since $E$ must be a non-negative integer, if $E=0$, no one can walk through a black gate until someone walks through a white gate. You can assume there won&apos;t be two people moving at the same time and all the people are selfless.<br><br>We use P to represent a black gate, V to represent a white gate and use a PV string to represent the row. Initially, all the people are at the beginning of the string, and all of them want to go through the whole string. But unfortunately, sometimes it may be impossible. So, they want to send at least one person to the right side. <br><br>Your task is to find out the minimal number of people which this group needs to achieve this goal.<br><br>For example, if the row is VPP, they need at least two people: The first person walk through the first white gate and the second person can use this point of energy to go through the whole string.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains a single numner $t(1 \\leq t \\leq 10^3)$, the number of the testcases.<br><br>For each testcase, the first line contains a PV string $s(1 \\leq |s| \\leq 10^5)$ describing the gates.<br><br>The input guarantees that there are at most $30$ testcases with $|S| &gt; 1000$.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each testcase, output a single integer, the answer. And if it is impossible, output $-1$.<br><br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\nVPP\nVPPVVVVPPPPPPPP\nVPPPPPPPPPPPPPP\nP</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n14\n-1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=%BA%AE%CE%E4%BC%CDACM%BD%F0%C5%C6%D1%B5%C1%B7%D3%AA-%D6%D8%CF%D6%C8%FC&amp;source=1&amp;searchmode=source\"> &#x5BD2;&#x6B66;&#x7EAA;ACM&#x91D1;&#x724C;&#x8BAD;&#x7EC3;&#x8425;-&#x91CD;&#x73B0;&#x8D5B; </a> ","type":"source","format":"html","require":["katex"]}]}