{"title":"From ICPC to ACM","time_limit":2000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6408","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6408&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6408","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6408"},"statement":[{"title":"Problem Description","content":"You, a former International Collegiate Programming Contest player, have now become an Assistant Cost Manager of Advanced Computer Manufacturing company. There are so many different kinds of costs you should deal with, including material cost, manufacturing cost and warehouse cost. Also, the customer&apos;s demand must be fully satisfied. Moreover, the space of warehouse is limited. To make things worse, all these parameters vary with time. To resolve this matter once for all, you decide to use your algorithmic knowledge to write a program.<br><br>Specifically, you have to find an optimal operational planning for the next $k$ months, under the following constraints: $\\textbf{in the i-th month}$,<br>- the price of raw materials is $c_i$ yuan per unit, and the quantity of raw materials you purchase is not limited.<br>- the customer&apos;s demand is $d_i$ computers, that is, you must sell exactly $d_i$ computers to customers this month.<br>- your company can manufacture at most $p_i$ computers. Manufacturing one computer consumes one unit of raw materials plus a manufacturing cost of $m_i$ yuan.<br>- you can store raw materials and computers in the warehouse for future use. According to the regulations of your company, the raw materials and computers must be placed in two different areas of the warehouse. You can store at most $e_i$ computers to the next month. However, since the volume of raw materials is negligible, the number of raw materials you store is not limited. Storing one unit of raw materials or one computer to the next month takes $R_i$ yuan or $E_i$ yuan, respectively.<br><br>Also, <br>- you may immediately use the raw materials you purchase this month to manufacture computers, as long as the the production capacity of this month is enough; likewise, you may manufacture and sell computers in the same month. These raw materials and computers do not take up warehouse space.<br>- initially, there are no raw materials or computers in your company.<br><br>Your program should report whether all customer&apos;s demands can be fully satisfied, and, if so, report the minimum total cost.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input is a single integer $T$ $(1 \\leq T \\leq 200)$, denoting the number of test cases.<br><br>Each test case begins with a single line of integer $k$ $(2 \\leq k \\leq 50000)$, the number of months. The $i$-th of the following $k$ lines contains four integers $c_i, d_i, m_i, p_i$ $(0 \\leq c_i, d_i, m_i, p_i \\leq 10^4)$, the price of raw materials, the customer&apos;s demand, the unit manufacturing cost and the manufacturing capacity of the $i$-th month, respectively. The $i$-th of the next $k-1$ lines contains three integers $e_i, R_i, E_i$ $(0 \\leq e_i \\leq 10^8, 0 \\leq R_i, E_i \\leq 10^4)$, the capacities of computer area of the warehouse, and the warehouse cost of storing a unit of raw material and a computer, between the $i$-th and the $(i+1)$-th month, respectively.<br><br>It is guaranteed that the sum of $k$ over all test cases does not exceed $3 \\times 10^5$.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, display an integer in a line, denoting the minimum total cost. If customer demands cannot be fully satisfied, display $\\texttt{-1}$ instead.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2\n10 5 3 6\n15 7 2 8\n2 3 2\n2\n0 8 0 7\n0 0 0 0\n0 0 0</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">170\n-1\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first sample test case, you may purchase 12 units of raw materials, which takes 120 yuan, and put 7 of them into the warehouse for the next month, which takes \n21 yuan. Then, your company may manufacture 5 computers and sell them, which takes 15 yuan. In the second month, your company may manufacture and sell 7 \ncomputers using the raw materials in the warehouse, which takes 14 yuan. The total cost is 170 yuan, which can be proved to be optimal.\n\nIn the second sample test case, the manufacturing capacity of the first month is less than the customer&apos;s demand, so the customer&apos;s demand cannot be fully satisfied.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2018+Multi-University+Training+Contest+8&amp;source=1&amp;searchmode=source\"> 2018 Multi-University Training Contest 8 </a> ","type":"source","format":"html","require":["katex"]}]}