{"title":"Sockpuppets","time_limit":5000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6448","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6448&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6448","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6448"},"statement":[{"title":"Problem Description","content":"Pheatr has a lot of accounts competing in online programming contests such as contests on TopForces.<br><br>Sometimes when Pheatr participates in a contest on TopForces but cannot attain a good score directly, he takes advantage of some extra accounts applied for cheating (i.e. sockpuppets) to achieve a higher score:<br>Initially, he builds some wrong codes which can pass the pre-system tests and submits them through the sockpuppets.<br>After that, he uses his main account to challenge these sockpuppets immediately, since a successful challenge provides him $100$ more score points.<br><br>Actually, Pheatr is not the only one who cheats in the contests.<br>Many competitors use the same strategy during online programming contests.<br>Everyone has only one account as the main account.<br>If one&apos;s cheating is revealed, the main account of the one will be banned forever.<br>To prevent the notorious fact from being exposed, each competitor would not register more than two sockpuppets.<br>In spite of great peril, when they register their sockpuppets, these competitors always follow the same rule that the username of a sockpuppet belonging to one competitor should be a prefix of that of the competitor&apos;s main account, otherwise the username of the main account should be a prefix of that of the sockpuppet.<br><br>Recently, a leak from TopForces provided a list of verified cheaters who have used sockpuppets for cheating, containing the usernames of their main accounts.<br>Besides, TopForces also published a list of suspicious accounts, implying some of them may be sockpuppets.<br>In order to differentiate these suspicious accounts and point out their owners, Pheatr intends to describe all the possibilities according to the published information.<br>Certainly, one should notice that some of the suspicious accounts may be wronged and do not belong to any known cheaters.<br><br>After recognizing your outstanding programming skills, Pheatr asks you to count the number of distinct possibilities in total for claiming the affiliations between verified cheaters and suspicious accounts.<br>Two possibilities are considered the same if each suspicious account is wronged simultaneously or belongs to the same competitor in both possibilities.<br>Since the answer can be pretty large, you are only asked to report the answer modulo $(10^9 + 7)$.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains several test cases, and the first line contains a positive integer $T$ indicating the number of test cases which is up to $100$.<br><br>For each test case, the first line contains two integers $n$ and $m$ indicating the number of known cheaters in the leak and the number of suspicious accounts provided by TopForces respectively, where $1 \\le n, m \\le 1000$.<br><br>Each of the following $n$ lines contains a non-empty string $s$ in all lowercase letters representing the username of the main account for a known cheater, where the length of $s$ is up to $10$.<br><br>And each of the following $m$ lines contains a non-empty string $t$ in all lowercase letters representing the username of a suspicious account, where the length of $t$ is up to $10$.<br><br>We guarantee that all usernames appeared in the same test case are distinct.<br><br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output a line containing &quot;Case #x: y&quot; (without quotes), where $x$ is the test case number starting from $1$, and $y$ is the answer modulo $(10^9 + 7)$ to this test case.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n1 2\na\naa\naaa\n1 2\naa\na\nab\n5 5\na\nah\nahd\nahdo\nahdoc\nahdoca\nahdocah\nahdocahd\nahdocahdo\nahdocahdoc</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 4\nCase #2: 2\nCase #3: 6396\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first sample case, both sockpuppets aa and aaa can belong to the owner of a.\n\nIn the second sample case, the sockpuppet ab cannot belong to the owner of aa, while a can.\n\nIn the third sample case, each sockpuppet can belong to anyone in the list leaked from TopForces.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+43rd+ACM+International+Collegiate+Programming+Contest+Asia+Shenyang+Regional+Contest&amp;source=1&amp;searchmode=source\"> The 43rd ACM International Collegiate Programming Contest Asia Shenyang Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}