{"title":"Counting Sheep in Ami Dongsuo","time_limit":7000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6453","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6453&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6453","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6453"},"statement":[{"title":"Problem Description","content":"Ami Dongsuo, the god of the hills in Tibetan, guards the Qilian Mountains, whose Chinese name is Niuxin Mountain.<br>Ami Dongsuo is a holy mountain which is famous for the fantastic love story about Zhuoer Mountain.<br>The surrounding environments prompt Ami Dongsuo to form a huge sheep farmland.<br><br>According to a shocking new report by the excellent ecologist Mr. Ma, Ami Dongsuo has $n$ different pastures in total.<br>With the help of local herdsmen, Mr. Ma describes the number of sheep in each pasture and all paths between different pastures.<br><br>Today, under his leadership, three adventurers Alice, Bob and Carol decide to visit some pastures in Ami Dongsuo.<br>Mr. Ma has shown them a requirement, which is described by an integer $k$ that they should meet.<br>These three adventurers will start their tours at the same pasture and visit three different routes, where their starting point is selected by themselves and thus it could be anywhere.<br>Furthermore, a route may pass through one or more pastures.<br>Since the altitude rises to nearly $5000$ meters at the peak, and going up the hill or even climbing is quite a tiring job, adventurers have reached an agreement that the altitudes at all pastures in a route should be strictly decreasing in visiting order.<br>If go along their routes respectively, they will finally arrive at some pastures, which may not be distinct.<br>The requirement described by $k$ from Mr. Ma requires that the total number of sheep in these three destinations, considering with the multiplicities, is equal to $k$.<br><br>Now, Mr. Ma hopes that someone can tell him, for any positive integer $k$, how many different plans exist for Alice, Bob and Carol that would meet what he requires.<br>In this problem, we consider a plan as a set with three different routes sharing the common starting point.<br>Two routes are considered different if their starting points vary or their sequences of visited paths in order vary.<br>Two plans are considered different if at least one route that is contained in one plan but not in the other exists.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases, and the first line contains a positive integer $T$ indicating the number of test cases which is up to $5$.<br><br>For each test case, the first line contains three integers $n$, $m$ and $w$ indicating the number of pastures, the number of paths between them and an upper bound of the number of sheep at a pasture respectively, where $1 \\leq n \\leq 10000$, $1 \\le m \\le 30000$ and $1 \\le w \\le 400$.<br><br>The next line contains $n$ positive integers and the $i$-th of them indicates the number of sheep at the $i$-th pasture in Ami Dongsuo, where each number is up to $w$.<br><br>The following $m$ lines describe all paths between these pastures, each of which contains two integers $u$ and $v$ representing a path between the $u$-th pasture and the $v$-th one, where $1 \\le u, v \\le n$, $u \\ne v$, and we guarantee that the altitude at the $u$-th pasture is strictly higher than that at the $v$-th one and there is at most one path between any two pastures.<br><br>Though the input does not give the exact altitudes at all pastures, we guarantee that they do exist and all paths given in a test case are not ambivalent.<br>In addition, for any pair of pastures, an adventurer may not be able to visit a route from the higher one to the lower one since the altitudes at pastures involved in the route are restricted.<br>Even if some paths passing from a lower altitude to a higher altitude, the route may not be allowed.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a line contains &quot;Case #x:&quot; (without quotes) and $3 w$ following integers, where $x$ is the test case number starting from $1$, and the $i$-th of the following integers indicates the number of different plans mentioned above for $k = i$ modulo $(10^9 + 7)$.<br>In order to separate these numbers of different plans in the output, insert a space before each of them.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4 3 4\n1 2 3 4\n1 2\n1 3\n1 4\n4 6 4\n1 2 3 4\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 0 0 0 0 0 1 1 1 1 0 0 0\nCase #2: 0 0 0 0 0 2 5 9 16 11 13 4\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the first sample case, the starting points of all possible plans are the same pasture (i. e. the first pasture), \nand the different routes starting from the first pasture are 1, 1 -&gt; 2, 1 -&gt; 3 and 1 -&gt; 4.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+43rd+ACM+International+Collegiate+Programming+Contest+Asia+Shenyang+Regional+Contest&amp;source=1&amp;searchmode=source\"> The 43rd ACM International Collegiate Programming Contest Asia Shenyang Regional Contest </a> ","type":"source","format":"html"}]}