{"title":"How Much Memory Your Code Is Using?","time_limit":6000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6457","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6457&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6457","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6457"},"statement":[{"title":"Problem Description","content":"In the C++ language, the values of variables are stored somewhere in the computer memory as zeros and ones.<br>Our program does not need to know the exact location where a variable is stored since one can simply refer to it by its name.<br><br>What the program needs to be aware of is the kind of data stored in every variable.<br>Storing a simple integer is not the same as storing a letter or a large floating-point number.<br>Even though they are all represented by zeros and ones, they are not interpreted in the same way, and in many cases, they don&apos;t occupy the same amount of memory.<br><br>Fundamental data types, implemented directly by the language, represent the basic storage units supported natively by most systems.<br>They can be mainly classified into four types.<br><br><b>Character types:</b>They can represent a single character, such as `A&apos; or `$&apos;.<br>The most basic type is char, which is a one-byte character.<br><br><b>Numerical integer types:</b>They can store a whole number value, such as $7$ or $1024$.They exist in a variety of sizes.The most basic one is int, which is a four-byte integer.long long is a larger one which occupies twice as many memories as int does.A wider type of integer __int128 may appear in some new systems, which is a $16$-byte integer and rarely useful.<br><br><b>Floating-point types:</b>They can represent real values, such as $3.14$ or $0.01$, with different levels of precision, depending on which of the three floating-point types is used.float, double and long double correspond to int, long long and __int128 where the former types hold the same amount of memory as the latter types used respectively.<br><br><b>Boolean type:</b>The boolean type, known in C++ as bool, can only represent one of two states, true or false.It is a one-byte type.<br><br>Now you have a code in C++, $n$ lines of which apply several variables and arrays.<br>Also, I have checked it so I can claim that all variables and arrays in this code are global without any conflicts.<br><br>As a novice, each line in your code may only apply for one variable or one array; all types of these variables and arrays are mentioned above; any other types unmentioned can not appear in the code.<br>Your task in this problem is to calculate the number of memories in total that the code is using.<br>Output your answer in Kibibyte ($1$ Kibibyte is $1024$ bytes) and round it up to the nearest integer.<br>","type":"description","format":"html"},{"title":"Input","content":"The input contains several test cases, and the first line contains a positive integer $T$ indicating the number of test cases which is up to $100$.<br><br>For each test case, the first line contains a positive integer $n$, which is up to $1000$, indicating the total number of lines to apply (i.e. allocate memory) for variables and arrays in the code.<br>Each of the following $n$ lines may declare a variable in the form<br><br><b>type variable_name;</b><br><br>or declare a new array in the form<br><br><b>type array_name[array_size];</b><br><br>where type must be one name of the aforementioned types.<br>All variable_name and array_name are distinct strings containing only lowercase letters whose lengths are up to $10$, and all array_size are positive integers which are up to $10^5$.<br>Except for spaces in or after the name of some type, no extra spaces are allowed in the input.<br>In other words, we guarantee that no consecutive spaces appear in the input.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output a line containing &quot;Case #x: y&apos;&apos; (without quotes), where x is the test case number starting from $1$, and y indicates the total number of allocated memories in Kibibyte which is rounded up to the nearest integer.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n8\nbool a;\nchar b;\nint c;\nlong long d;\n__int128 e;\nfloat f;\ndouble g;\nlong double h;\n1\nint a[1000];</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1: 1\nCase #2: 4\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the second sample case, the memory usage is 4000 bytes, which should be rounded up to 4 Kibibytes.\n\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+43rd+ACM+International+Collegiate+Programming+Contest+Asia+Shenyang+Regional+Contest&amp;source=1&amp;searchmode=source\"> The 43rd ACM International Collegiate Programming Contest Asia Shenyang Regional Contest </a> ","type":"source","format":"html"}]}