{"title":"Renaissance Past in Nancy","time_limit":6000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6460","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6460&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6460","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6460"},"statement":[{"title":"Problem Description","content":"Nancy used to be known for its Art Nouveau quarter, the rum baba and good King Stanislas Leszczynski, the deposed Polish king who gave the city its gorgeously frilly architectural centrepiece in the 18th century.<br><br>But in 2013, Nancy rediscovered its Renaissance past, with events and exhibitions all around town this summer, from the fine art museum to the thermal establishment and the botanical gardens.<br>Now it is time for me to discover the old town&apos;s Renaissance relics and the Utopian town-planning schemes of Duke Charles III, from the days when Nancy was capital of a powerful independent duchy at the crossroads between northern and southern Europe.<br><br>The old and new towns are seamlessly connected today.<br>The new city or Ville Neuve laid out in 1588 is still the commercial heart of the city with its shops and banks, and covered by food markets in the street near the square originally planned for the cathedral.<br><br>In this autumn, I have the privilege of spending a several-months-long holiday in Ville Neuve.<br>Daily contemplations always follow the breakfasts together with baguettes&apos; sweet and smooth.<br>What makes a baguette better is not La vache qui rit cheese, but where I get it.<br>But why should people who program computers be so concerned about the number of food markets in a street?<br>I do label those food markets which supply baguettes in the street from $1$ to $n$.<br><br>At each glimmering daybreak came, I carry several one-euro coins and make a plan to visit several consecutive food markets.<br>Regardless of winds and rains, a food market always offers a fixed number of baguettes at a fixed price.<br>Two different food markets may be different:<br>The numbers of their daily baguettes offered and the prices differ.<br><br>The early bird catches the worm.<br>Since there is no need to worry about other customers, enough money makes me free to buy all the baguettes in a food market or be blind and go to the next market.<br><br>But why should people just like you be so concerned about the number of different ways that I have to purchase baguettes?<br>They even double-check with me that I may cost nothing and starve, or spend any amount of money that I have.<br>As what theorists always say in a knapsack-like problem, two ways to purchase baguettes are different if, at some markets, the numbers of baguettes purchased vary.<br><br>A man who pursuits high efficiency like you tries to tell me the number of ways I have once he confirmed the amount of money I carry and my visit plan day after day.<br>An undisciplined man like me, though I have made a long list of plans for all days, decides to make a new plan for the next day once I received your reply about one day.<br>I use $lastans$ to denote the number in your reply and set it to zero before my first day in Ville Neuve.<br><br>On a day, I check what I made in the original plan, say $l&apos;$ and $r&apos;$ the index of the first food market I decided to visit, and of the last one, and say $c$ the number of one-euro coins I decided to carry.<br>A transformation like an encryption<br><br>$$l = \\min\\{((l&apos; + lastans) \\bmod n) + 1, ((r&apos; + lastans) \\bmod n) + 1\\}$$<br><br>and<br><br>$$r = \\max\\{((l&apos; + lastans) \\bmod n) + 1, ((r&apos; + lastans) \\bmod n) + 1\\}$$<br><br>shows me a new plan, where $\\min\\{x, y\\}$ and $\\max\\{x, y\\}$ correspond to the minimum and the maximum of $x$ and $y$ respectively, and that is what I execute this morning.<br>You need to tell me the number you calculate for this day and I will set $lastans$ to your reply in modulo $(10^9 + 7)$.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input contains several test cases, and the first line contains a positive integer $T$ indicating the number of test cases which is up to $1000$.<br><br>For each test case, the first line contains two integers $n$ and $m$ which are the number of food markets in the street and the total number of days I plan to spend in Ville Neuve respectively, where $1 \\le n, m \\le 10000$.<br><br>Each of the following $n$ lines describes a food market.<br>The $i$-th line of them contains two integers $a_i$ and $b_i$ indicating the number of baguettes provided by the $i$-th food market and its unit price in euro respectively, where $1 \\le a_i, b_i \\le 1000$.<br><br>Each of the following $m$ lines contains three integers $l&apos;, r&apos;$ and $c$ describing the original plan I made for one day, where $1 \\le l&apos; \\le r&apos; \\le n$ and $1 \\le c \\le 1000$.<br><br>We guarantee that no more than $10$ test cases satisfy $n &gt; 100$ or $m &gt; 100$.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, output &quot;Case #x:&quot;(without quotes) in a line at first, where x is the test case number starting from $1$.<br><br>Then for each day, output an integer in a line indicating the number of the different ways to purchase baguettes on this day in modulo the prime number $(10^9 + 7)$.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n3 3\n1 1\n1 2\n1 3\n1 3 1\n1 3 2\n1 3 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case #1:\n2\n3\n4\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nIn the sample case, I visit the first market and the second market with only one coin on the first day.\nThus I can buy nothing or buy one baguette in the first shop.\nOn the second day, I visit all markets carrying two coins, so I can buy nothing or buy one baguette in any one of the first two markets.\nOn the last day, I visit the first two markets again but carry with me three coins.\nThen I have four different ways to purchase baguettes, but I am too tired to list them all after a three-day shopping.\n\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=The+43rd+ACM+International+Collegiate+Programming+Contest+Asia+Shenyang+Regional+Contest&amp;source=1&amp;searchmode=source\"> The 43rd ACM International Collegiate Programming Contest Asia Shenyang Regional Contest </a> ","type":"source","format":"html","require":["katex"]}]}