{"title":"High Priestess","time_limit":5000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6561","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6561&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6561","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6561"},"statement":[{"title":"Problem Description","content":"<i>Look for areas in your life that may be out of balance or lacking &#xFFFD;&#xFFFD;flow&#xFFFD;&#xFFFD; and ease. Knowledge of how to fix these issues will not come through thinking and rationalising, but through feeling and trusting your intuition, so allow yourself the time and space to meditate and listen to your inner voice. Your intuitive sense right now is providing you with useful and helpful information and is assisting you to become more in touch with your subconscious mind.</i><br><br>Your task is <b>simple</b>: to build a circuit with effective resistance as close to a target value as possible.<br>Specifically, you are given a 1V battery, $10^4$ resistors of 1$\\Omega$ and unlimited number of conductive posts. You can attach each resistor to an arbitrary pair of different posts. Different resistors may be attached to same pairs of posts and you do not need to use up all the resistors (definitely not all posts either). When you finish all attachments, you can finally choose two posts to attach the battery on.<br>For convenience, we can observe the resistor network you build as a undirected graph G = (V, E). Naturally in this mapping each post with at least one resistor attached to it is a vertex in V and each resistor is an undirected edge in E. Following basic physics laws we can calculate the voltage at each post x, denoted as $v_x$ (suppose the voltage at the negative post of the battery is 0) and the sum of current flowing through all resistors between posts x and y, denoted as ixy. We can now define the effective resistance between any pair of posts a and b as<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C642-1007-1.JPG\"></center><br>Suppose the battery is attached to post $a_0$ and $b_0$, your task is to build a graph such that |$r_{a_0b_0}$- r| &#xFFFD;&#xFFFD; $10^{-7}$ for any given r.<br>There are one more constraint - you are only allowed to build the graph following the procedures below.<br>First you have n resistors of 1&#xFFFD;&#xFFFD;, numbered from 0 to n n 1. And each of the resistors can be seen as a graph of 2 posts and 1 edge. You are then allowed to perform several merge operations to any two of the graphs you currently have to form a new graph. The original two graphs are then removed and the new graph is added to your graph pool and numbered consecutively starting from n (that is to say, the graph obtained in the first operation has the number n and in the second operation the number is n + 1 and so on).<br>There are two types of merge operations, a serial merge or a parallel merge. Specifically, if the two graphs you choose to merge is o -&gt; A -&gt; o and o -&gt; B -&gt; o (the o refers to the posts and the -&gt; refers to how the current flows) respectively. After a serial merge, the new graph will be<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C642-1007-2.JPG\"></center><br>and after a parallel merge, the new graph will be<br><center><img style=\"max-width:100%;\" src=\"../../../data/images/C642-1007-3.JPG\"></center>","type":"description","format":"html"},{"title":"Input","content":"First line of the input contains a single positive integer $T$ ($T$ &#xFFFD;&#xFFFD; 20) denoting the testcase count.<br>In each test case, a single line of a real number r (0.1 &#xFFFD;&#xFFFD; $r$ &#xFFFD;&#xFFFD; 0.9) will be presented. This is your target resistance.","type":"input_format","format":"html"},{"title":"Output","content":"For each testcase, first you have to print Case $i$: in one line, in which $i$ is the case number starting from 1. In the next line you should print two integers n and m (1 &#xFFFD;&#xFFFD; m &lt; n &#xFFFD;&#xFFFD; $10^4$ ) <b>in one line</b>, denoting the number of resistors you initially need and the total number of operations you wish to perform.<br>In the following $m$ lines, you have to print an operation in one line in the format of <br>op x y<br>where op should be 0 if you wish to perform a serial merge and 1 if you wish to perform a parallel merge. x and y are the numbers of the two graphs you wish to merge. Note that all graphs are numbered following the rule described in the statement automatically.<br>We assume the last graph obtained from your last operation is your final answer.<br><b>Do not print extra empty lines in your output.</b><br><br><b>Note</b><br>The solution is not unique. Your answer will be special judged and will be accepted if |$r$ - $your$_$answer$| &#xFFFD;&#xFFFD; $10^{-7}$.<br>The basic physics laws:<br><br><li>Ohm&#xFFFD;&#xFFFD;s law: the current through a conductor between two points is directly proportional to the voltage across the two points.</li><br><center>I=$\\frac{V}{R}$</center><br><li>Kirchhoff &#xFFFD;&#xFFFD;s law: the </li><br><center>$\\sum\\limits_{k=1}^n$ $I_k$ = 0</center>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n0.5\n0.6666666666666667</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1:\n2 1\n1 0 1\nCase 2:\n6 5\n1 0 1\n1 2 6\n1 3 4 \n1 5 8\n0 7 9</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2018CCPC%BC%AA%C1%D6%C8%FC%C7%F8%A3%A8%D6%D8%CF%D6%C8%FC%A3%A9-+%B8%D0%D0%BB%B1%B1%BB%AA%B4%F3%D1%A7&amp;source=1&amp;searchmode=source\"> 2018CCPC&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;- &#xFFFD;&#xFFFD;&#x43B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x467; </a> ","type":"source","format":"html"}]}