{"title":"Strength","time_limit":1000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6563","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6563&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6563","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6563"},"statement":[{"title":"Problem Description","content":"<i>Strength gives you the confidence within yourself to overcome any fears, challenges or doubts. Feel the fear and do it anyway! If you have been going through a rough time and feel burnt out or stressed, the Strength card encourages you to find the strength within yourself and keep going. You have got what it takes to see this situation through to its eventual end. You might also feel compelled to hold space for someone else who is going through a difficult period and needs your strength and support.</i><br><br>Alice and Bob are playing &#xFFFD;&#xFFFD;Yu-Gi-Oh!&#xFFFD;&#xFFFD;, a famous turn-based trading card game, in which two players perform their turns alternatively. After several turns, Alice and Bob have many monsters respectively.<br>Alice has n and Bob has m monsters under their own control. Each monster&#xFFFD;&#xFFFD;s strength is measured by a non-negative integer $s_i$ . To be specific, the larger $s_i$ is, the more power the monster has.<br>During each turn, for every single monster under control, the player can give a command to it at most once, driving it to battle with an enemy monster (given that opposite player has no monsters as a shield, the monster can directly attack him).<br>Additionally, the process of the battle is also quite simple. When two monsters battle with each other, the stronger one (i.e. the one with larger $s_i$) will overwhelm the other and destroy it and the winner&#xFFFD;&#xFFFD;s strength will remain unchanged. Meanwhile, the difference of their strength will produce equivalent damage to the player who loses the battle. If the player is directly attacked by a monster, he will suffer from the damage equal to the monster&#xFFFD;&#xFFFD;s strength. Notice that when two monsters have the same strength, both of them will vanish and no damage will be dealt.<br>Right now it is Alice&#xFFFD;&#xFFFD;s turn to play, having known the strength of all monsters, she wants to calculate the maximal damage she can deal towards Bob in one turn. Unfortunately, Bob has great foresight and is well-prepared for the upcoming attack. Bob has converted several of his monsters into defense position,<br>in which even if the monster is destroyed, he wouldn&#xFFFD;&#xFFFD;t get any damage.<br>Now you are informed of the strength of all the monsters and whether it is in defense position for each Bob&#xFFFD;&#xFFFD;s monster, you are expected to figure out the maximal damage that could be dealt in this turn.","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer $T$ &#xFFFD;&#xFFFD; 20 indicating the number of test cases.<br>For each test case, the first line includes two integer 0 &#xFFFD;&#xFFFD; $n$, $m$ &#xFFFD;&#xFFFD; 100000, representing the number of monsters owned by Alice and Bob.<br>In next three lines, the first two lines include $n$ and $m$ integers 0 &#xFFFD;&#xFFFD; $s_i$ &#xFFFD;&#xFFFD; $10^9$ indicating the strength of the $i$-th monster, separated by spaces. The last line contains m integers 0 or 1 indicating the position of Bob&#xFFFD;&#xFFFD;s $i$-th monsters.In other words, 0 represents the normal position and 1 represents the defense position.","type":"input_format","format":"html"},{"title":"Output","content":"For the ith test, output a single line in beginning of &#xFFFD;&#xFFFD;Case $i$:&#xFFFD;&#xFFFD;, followed by an integer indicating the answer, separated by a single space.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n4 2\n10 10 10 20\n5 15\n0 1\n4 2\n10 10 10 20\n5 25\n0 1</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: 25\nCase 2: 15</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2018CCPC%BC%AA%C1%D6%C8%FC%C7%F8%A3%A8%D6%D8%CF%D6%C8%FC%A3%A9-+%B8%D0%D0%BB%B1%B1%BB%AA%B4%F3%D1%A7&amp;source=1&amp;searchmode=source\"> 2018CCPC&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;- &#xFFFD;&#xFFFD;&#x43B;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#xFFFD;&#x467; </a> ","type":"source","format":"html"}]}