{"title":"The Magician","time_limit":1000,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6565","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6565&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6565","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6565"},"statement":[{"title":"Problem Description","content":"<i>In your quest to manifest your goals, it is essential that you establish a clear vision of what you wish to create and why you want to create it, before you take action. It is not simply enough to be motivated by ego (money, status, or fame) &#x2013; you need to have a soul connection to your goals and intentions.</i><br><br><b>Background</b><br>Magician Alice and Bob are playing Magic Duel, which is an amusing turn-based game. Here goes the tutorial to the game. Their strategy and the process of the game are determined and all you need to do is to figure out the result.<br><br><b>Game Structure</b><br>The game consists of four separate areas containing several cards:Deck,Hand, Field, Grave.<br><b>Deck</b><br>The library of your cards &#x2013; each turn you can draw a card from the top of the deck to your hand.<br><b>Hand</b><br>The collection of your available cards &#x2013; each turn you can place a card from your hand to your field.<br><b>Field</b><br>The set of your active cards - the key to victory.<br><b>Grave</b><br>The place of all the discarded or destroyed cards.<br>Notice that the <b>Field</b> and the <b>Grave</b> are public (i.e. known to each other), whereas the <b>Deck</b> and <b>Hand</b> are private. All these four areas are independent for each player.<br><br><b>Process of the Game</b><br>Initially, each player draws five cards from the top of the deck, and two players play their own turns alternatively (Alice goes first). Each turn includes the following three phases in order.<br><b>Draw Phase</b><br>Draw a card from deck into hand. If the deck is empty this phase is skipped.<br><b>Main Phase</b><br>Select a card from hand, placing it into field and dealing corresponding effect. Player can choose to skip this phase.<br><b>End Phase</b><br>If the victory condition is reached by the player, he is announced to win immediately. Otherwise, switch the turn to the opponent.<br><br><b>Card Introduction</b><br>Two players&#x2019; decks consist of same cards but in different order. In each deck lie 25 cards in 5 categories evenly. In other words, each kind of cards contains 5 identical cards. Here goes the introduction to the effects produced by these cards when played.<br><b>Plain</b><br>Draw a card from the deck (if the deck is empty it has no effect).<br><b>Swamp</b><br>Enemy player selects a card from his hand and discard it into his grave (if enemy&#x2019;s hand is empty it has no effect).<br><b>Mountain</b><br>Select a card inside enemy&#x2019;s field and destroy it, sending it into enemy&#x2019;s grave (if enemy&#x2019;s field is empty it has no effect).<br><b>Island</b><br>No effect. However, in enemy&#x2019;s turn, when enemy intends to play a card (notice that you don&#x2019;t know the card&#x2019;s type because it hasn&#x2019;t entered the field), you can discard an island from your hand firstly and discard another card from hand as cost to counter-attack the card, sending it to enemy&#x2019;s grave and preventing it from dealing any effects.<br><b>Forest</b><br>Select a card in his own grave and recycle it into his hand (if the grave is empty it has no effect).<br><br><b>Victory Condition</b><br>If the player has gathered five different kinds of cards in his field, he wins. If the game lasts 100 turns or both players have no cards in their decks or hands, it is a tie.<br><br><b>Strategy</b><br><b>Play Strategy</b><br>When selecting a card to play in Main Phase, the player labels his card in hand with three priority levels.<br><b>High Priority</b><br>There is no card of the same type in his own field and it has effect if played.<br><b>Medium Priority</b><br>There is no card of the same type in his own field but it has no effect if played.<br><b>Low Priority</b><br>There are cards of the same type in his own field.<br>For the cards with the same priority, the player selects them in the following order: Swamp, Plain, Mountain, Forest and Island. Notice that if the player only has low-priority cards in hand he will skip the Main Phase.<br><br><b>Discard Strategy</b><br>When player needs to discard a card from hand, this strategy works. The player will select the card with most occurrences in hand among all cards and discard it. For the cards with the same occurrences, player will select them in the following order: Island, Mountain, Plain, Swamp, Forest.<br><br><b>Destroy Strategy</b><br>When Mountain is played by player himself, he will select the card with the least occurrences in enemy&#x2019;s field among all cards in enemy&#x2019;s field and destroy it. For the cards with the same occurrences, player will select them in the following order: Forest, Island, Mountain, Plain, Swamp.<br><br><b>Counter-attack Strategy</b><br>When enemy intends to play a card, if enemy has gathered four kinds of card in his field and the number of the fifth kind of card in enemy&#x2019;s grave is less than 5, player will choose to counter-attack. Obviously, player is required to have an Island and another card in his hand to have this done. The choice of cost card also follows the Discard Strategy.<br><br><b>Recycle Strategy</b><br>When player plays Forest, he selects the card with the least occurrences in his own field and hand among all cards in his grave and recycles it into his hand. For the cards with the same occurrences, the player will select them in the following order: Forest, Swamp, Mountain, Island, Plain.","type":"description","format":"html"},{"title":"Input","content":"The first line contains a single integer $T$ &#x2264; 20000 indicating the number of tests.<br>For each test case, input contains two lines with 25 integers between 0 and 4 (inclusive) separated by spaces, representing the cards in Alice and Bob&#x2019;s decks from top to bottom. 0, 1, 2, 3, 4 respectively stand for Plain, Swamp, Mountain, Island, Forest.","type":"input_format","format":"html"},{"title":"Output","content":"For each test, start with &#x201C;Case $i$:&#x201D;, where $i$ indicates the number of the case, and then output a single line containing a string and an integer indicating the winner of the game (&#x201C;Alice&#x201D;, &#x201C;Bob&#x201D; or &#x201C;Draw&#x201D; if the game ties) and how many turns the game lasts, separated by spaces.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n0 0 0 0 0 1 1 1 1 1 2 2 2 2 2 3 3 3 3\n3 4 4 4 4 4\n0 0 0 0 0 1 1 1 1 1 2 2 2 2 2 3 3 3 3\n3 4 4 4 4 4\n4 3 2 1 1 3 1 2 1 3 2 3 0 0 4 0 3 4 0\n4 2 2 1 0 4\n0 0 3 2 4 3 4 0 2 4 1 2 4 3 1 1 3 2 2\n3 1 0 1 4 0\n4 0 0 3 1 2 4 4 1 3 1 3 0 4 0 2 2 1 2\n2 3 3 4 1 0\n4 0 4 1 4 1 4 1 4 0 0 2 3 1 3 2 3 2 1\n0 2 3 0 2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Case 1: Bob 36\nCase 2: Alice 17\nCase 3: Alice 9</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2018CCPC%BC%AA%C1%D6%C8%FC%C7%F8%A3%A8%D6%D8%CF%D6%C8%FC%A3%A9-+%B8%D0%D0%BB%B1%B1%BB%AA%B4%F3%D1%A7&amp;source=1&amp;searchmode=source\"> 2018CCPC&#x5409;&#x6797;&#x8D5B;&#x533A;&#xFF08;&#x91CD;&#x73B0;&#x8D5B;&#xFF09;- &#x611F;&#x8C22;&#x5317;&#x534E;&#x5927;&#x5B66; </a> ","type":"source","format":"html"}]}