{"title":"Game","time_limit":4000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6597","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6597&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6597","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6597"},"statement":[{"title":"Problem Description","content":"Alice and Bob are playing a game again. The game can be described as follows:<br><br>A chess board sized $3 \\times 3$ is used for the game. But some cells in it have been banned before the game, which implies that no one could place a chess piece onto it. And some chess pieces have been placed on some cells, while some other cells remain empty. In a word, a cell can be in $4$ states:<br><br>$\\quad$ $\\bullet$ &quot;.&quot; $\\space$ means that it is empty.<br>$\\quad$ $\\bullet$ &quot;O&quot; $\\space$ means that it contains a white chess piece.<br>$\\quad$ $\\bullet$ &quot;X&quot; $\\space$ means that it contains a black chess piece.<br>$\\quad$ $\\bullet$ &quot;#&quot; $\\space$ means that it is banned.<br><br>There is no doubt that no two chess pieces can be placed onto the same cell whenever. Alice can operate white chess pieces and Bob can operate black chess pieces.<br><br>If it is Alice&apos;s turn, she should choose some cell $(x,y)$ containing a white chess piece, and firstly ban the cell $(x,y)$, and then she must choose one of the following three additional operations:<br><br>$\\quad$ $\\circ$ $\\space$ ban the two cells next to the cell $(x,y)$ on the left and right.<br>$\\quad$ $\\circ$ $\\space$ ban the two cells next to the cell $(x,y)$ which lie above and below $(x,y)$.<br>$\\quad$ $\\circ$ $\\space$ operate both of the aforementioned two. <br><br>Note that if Alice chooses the first one, the two cells $(x,y-1)$ and $(x,y+1)$ could be not in the actually chessboard, she would just ban the cell(s) in the chessboard. But it is not meant that she cannot choose the first option. Namely, the actual effect of the three options could be the same.<br><br>If it is Bob&apos;s turn, he should choose some cell $(x,y)$ containing a black chess piece, and firstly ban the cell $(x,y)$, and then eat some melon seeds. Yes, actually he can do nothing additionally.<br><br>Whoever cannot operate on his turn loses, i.e. the other one is the winner of the game. As we all know, Alice and Bob always try their best to win and we can assume that they are smart enough.<br><br>The number of different states of the chessboard may be large. And for each one, we can make out who would be the winner and give some analysis before the game actually starts.<br><br>Today, Alice and Bob are playing many games simultaneously of the kind described above. Every someone&apos;s turn is to choose any game he can operate on to play. And no one can skip any his turn and do nothing.<br><br>You will be given a positive integer $n$, and $n$ states of games denoting the total state of the whole game. Make out who would be the winner.<br><br>If Alice always wins, no matter who is the first player, output &quot;$Alice$&quot; $\\space$ without quotes.<br><br>If Bob always wins, no matter who is the first player, output &quot;$Bob$&quot; $\\space$ without quotes.<br><br>If the first player always wins, no matter who is the first player, output &quot;$First$&quot; $\\space$ without quotes.<br><br>If the second player always wins, no matter who is the first player, output &quot;$Second$&quot; $\\space$ without quotes.<br><br>If none of the situations would output, then output &quot;$Others$&quot; $\\space$ without quotes please.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains the only integer $T$ denoting the number of the test cases.<br><br>Each case begins with an empty line and another line containing the only integer $n$ denoting the number of the states of the games. The following are the $n$ states.<br><br>For each state, you should read an empty line firstly, and then a $3 \\times 3$ chessboard.<br>To be beautiful and striking, the chessboard is actually a $3 \\times 5$ char-array. For each line, the chess pieces are separated by an additional character | as you can see in the following examples.<br><br>It is guaranteed that the sum of $n$ in all test cases is no larger than $1100000$.<br><br>See examples for better understanding.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output one line per testcase containing one word from the set $\\{$ ``Alice&apos;&apos; , ``Bob&apos;&apos; , ``First&apos;&apos; , ``Second&apos;&apos; , ``Others&apos;&apos; $\\}$. The words&apos; exact meannings have been explained as above.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n\n2\n\n#|X|O\nO|#|X\n#|.|X\n\nX|#|.\nX|#|O\nO|#|.</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Alice</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2019+Multi-University+Training+Contest+2&amp;source=1&amp;searchmode=source\"> 2019 Multi-University Training Contest 2 </a> ","type":"source","format":"html","require":["katex"]}]}