{"title":"Azshara's deep sea","time_limit":1000,"memory_limit":64,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6603","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6603&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6603","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6603"},"statement":[{"title":"Problem Description","content":"As a little Gnome Rogue, WW is a loyal player in World of Warcraft. Although the daily tasks of version 8.2 are so boring, he insists on going online every day.<br><br>Since the stealth skill of the Rogue can prevent him from being seen by the enemy, he always plays PVP in the wild. One night, on the way finding an elite monster on the map, he saw a shivering priest who is chased by the Rogue and a Demon Hunter. Then he decided to help the poor priest. Sure enough, with the helping of the most powerful specialization in the current version, the priest TT survived.<br><br>WW made friends with TT. In the conversation, WW found that the guild that TT takes part is preparing to raid the epic mode of the Dungeon &#x2018;Eternal Palace&#x2019;. As a core member of the union team, TT is worried with the last BOSS of the Dungeon.<br><br>According to Dungeon&#x2019;s Guide, the last BOSS Azshara will enter a hidden phase when her HP drops to 0%. At this time, the previous battlefield will be destroyed and all players will sink into a deep sea. The BOSS will strengthen to become the Azshara&#x2019;s soul.<br><br>Players need to fight within the range of the lights. The lights are tied to the wooden sticks. Therefore, we can assume that the player is fighting in a convex polygon made by wooden sticks.(The wooden sticks are distributed over the entire polygon.) Of course, players can not only stand on the wooden sticks, but also move freely within this area.<br><br>Azshara&#x2019;s souls has a skill to deliver stingers to the crowd in the battlefield. Each stinger would make a circle whose radius is R. Another skill of Azshara&#x2019;s soul is to choose two players randomly (Two players are a pair, and any two pairs do not contain the same person) and link them with an ice ray. If the ice ray passes through the circle formed by the stinger ( Including the case where the ray is tangent to the circle ) , all of the players will die. So we can&#x2019;t let the rays pass through these circles. There are some other requirements for the ice ray technique: 1. Two ice rays cannot intersect. (Ray intersection does not include the coincidence of endpoints of two different segments) 2. The two choosen players cannot be too close.<br><br>Eventually, the leader comes up with such a way to help players win this boss faster:<br><br>First, in order to influence other players that are not selected as small as possible, the selected players should stand at the outermost side of the battlefield.<br><br>Second, in order to find the position more accurately, the player needs to run to the outermost wooden sticks, that is, the coordinates (x,y) of the wooden sticks are the coordinates (x,y) of the player (a wooden stick can withstand multiple players).<br><br>Third, players in the same pair cannot stand on adjacent wooden sticks. In other words, if we number the outermost wooden sticks, the players in the same pair cannot have one person in the position of i and the other person in the position of i+1.<br><br>The leader now knows the position of the wooden sticks and the position of the center of the circle. What is the maximum number of the pairs he can arrange in the battlefield?","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The input includes several cases. The first line of input is a single line of integer T (1&#x2264;T&#x2264;10), the number of test cases.<br><br>For each case, the first line contains three space-separated integers: N(0&lt;=N&lt;=400), G(0 &lt;= G &lt;= 100) , and R (0&lt;=R&lt;=100)<br><br>Next there will be N lines. Each line contains two space-separated integers x,y that are the position of wooden sticks.<br><br>Next there will be G lines. Each line contains two space-separated integers x,y that are the position of stingers inside battlefield.<br><br>0&lt;=x,y&lt;=1e6","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Only one line includes a number indicating how many pairs of players can be arranged in the battlefield.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5 3 1\n6 10\n10 7\n9 1\n2 0\n0 3\n2 2\n5 6\n8 3\n5 0 0\n1 1\n2 1\n3 2\n1 3\n0 2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">1\n2</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2019+Multi-University+Training+Contest+3&amp;source=1&amp;searchmode=source\"> 2019 Multi-University Training Contest 3 </a> ","type":"source","format":"html","require":["katex"]}]}