{"title":"Acesrc and Hunting","time_limit":2000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6660","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6660&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6660","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6660"},"statement":[{"title":"Problem Description","content":"Acesrc is a famous hunter at Nanjing University second to none. Recently, he set $n \\times m$ traps in Yangshan Park, a park near Nanjing University Xianlin Campus, arranged in $n$ rows and $m$ columns. The rows are numbered $1$ through $n$ from bottom to up, and the columns are numbered $1$ through $m$ from left to right. The distance between two adjacent traps, both horizontally and vertically, is 1 meter.<br><br>Today, Acesrc happily finds that every trap he set has captured an animal. He decides to collect these hunted animals to make roast meat for his friends. However, collecting these animals normally is too boring, so he decides to find a route following the rules below:<br><br>1. Acesrc can choose any trap to start; every time he collects the animal in the trap, he moves to some unvisited trap and repeats until all captured animals  are collected;<br>2. The Euclidean distance he moves from one trap to the next trap should be between 1 meter and 3 meters exclusive; that is, the distance should be strictly greater than 1 meter and strictly less than 3 meters.<br><br>Acesrc has quickly collected all animals. Roo wonders how Acesrc collected these animals, but Acesrc buttons up his lip. Can you give a possible route to collect all the animals?","type":"description","format":"html"},{"title":"Input","content":"The first line of input consists of a single integer $T$ $(1 \\leq T \\leq 240)$, the number of test cases. Each test case is a single line of two integers $n, m$ $(1 \\leq n, m \\leq 100)$, denoting the size of the trap matrix.<br>","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, if it is impossible to find any valid route, print NO in a single line; otherwise, print YES in one line, followed by $n \\times m$ lines describing the route, each of these lines containing two integers $x, y$ $(1 \\leq x \\leq n, 1 \\leq y \\leq m)$, denoting the position of a trap visited. If multiple solutions exist, print any.<br>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n2 2\n2 3</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">NO\nYES\n1 1\n2 2\n1 3\n2 1\n1 2\n2 3</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2019+Multi-University+Training+Contest+8&amp;source=1&amp;searchmode=source\"> 2019 Multi-University Training Contest 8 </a> ","type":"source","format":"html"}]}