{"title":"Quailty and CCPC","time_limit":2000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6666","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6666&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6666","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6666"},"statement":[{"title":"Problem Description","content":"Considering the overall difficulty of other problems, we invite Quailty to propose an easy problem for this contest.<br><br>Quailty accidentally won both gold medal and silver medal in 2017 CCPC final. The reason is explained as follows. According to the official rule, the number of gold medals was 10\\% of the number of participating teams, rounded to the nearest integer. This is ambiguous when the fractional part of the result is exactly $0.5$. There were 115 participating teams, and the rank of Quailty&apos;s team was 12. The organizer originally decided to round down the number, so there were only 11 gold medals, and Quailty&apos;s team could only win the silver medal. Many people defended him against the organizer, saying that his team deserved a gold medal. Later, the organizer changed to round up the number, and Quailty&apos;s team finally won a gold medal.<br><br>Now, give you the scoreboard of a contest and the proportion of gold medal teams, could you determine whether there exists a team, such that they would win a gold medal were the number of gold medals rounded up when the fractional part is exactly $0.5$, and silver medal if rounded down?<br><br>A team ranks before another if they solved more problems or both teams solved an equal number of problems but they had less penalty time.<br><i><br>(Disclaimer: the background is fictitious and the problem is prepared by Nanjing University ICPC Training Team, not Quailty.)<br></i>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line of input consists of a single integer $T$ $(1 \\leq T \\leq 120)$, denoting the number of test cases.<br><br>Each test case starts with a line of two integers $n$ $(1 \\leq n \\leq 10^5)$, denoting the number of participating teams, and $d$ $(0 \\leq d \\leq 9)$, denoting that the proportion of gold medal teams is $10d\\%$. For the next $n$ lines, each containing a string $s$ and two integers $p, t$ $(0 \\leq p, t \\leq 10^9)$, denoting the name of the team, the number of problems solved and the penalty time of the team, respectively. The name of the each team contains at least 1 and at most 10 latin letters. The names are case sensitive. No two teams have the same name. No two teams have the same penalty time. The sum of $n$ over all test cases does not exceed $10^6$.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each test case, print the team name if there exists such team, or print $\\texttt{Quailty is very great}$ otherwise. It can be proved that there is at most one such team.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n5 1\nAce 1000 0\nLuffy 999 1\nSabo 998 2\nRoronoa 997 3\nSanji 996 4\n2 3\nYou 0 0\nI 10 1</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Ace\nQuailty is very great</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2019+Multi-University+Training+Contest+8&amp;source=1&amp;searchmode=source\"> 2019 Multi-University Training Contest 8 </a> ","type":"source","format":"html","require":["katex"]}]}