{"title":"Rikka with Defensive Line","time_limit":14000,"memory_limit":512,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6689","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6689&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6689","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6689"},"statement":[{"title":"Problem Description","content":"As an undergraduate student at Peking University, Rikka is always busy with her study. Therefore, to relax in the summer vacation, Rikka spends a lot of time playing computer games.<br><br>Today, Rikka is playing a game about a war between two tribes. As the player, Rikka controls the warriors of one tribe to attack the other tribe. The hostile tribe has $n$ strongholds, and the coordinate of the $i$th stronghold is $(x_i,y_i)$. A defensive line is built among the strongholds: it is a straight line on the coordinate system which divides the whole plane into two regions. The first goal of the game is to capture this defensive line.<br><br>As a sophisticated player, Rikka finds that if some of the strongholds are destroyed and all of the remaining strongholds are strictly lying on the same side of the defense line (lying exactly on the defensive line is not allowed), she can capture the defense line with a very small price. Therefore, Rikka will firstly achieve this condition by destroying the minimum number of strongholds at the beginning of the game.<br><br>After repeating the game $10^{100}$ times, Rikka finds that she can always achieve the goal by destroying at most $K$ strongholds. She is curious about this phenomenon. Therefore, Rikka asks Yuta, a master of information technology, to read the source code of the game and find out the reason.<br><br>Yuta finds that while initializing, the game will always choose two strongholds and make the defensive line be the only straight line passing through them. Then, to decrease the difficulty, the game will check whether the &quot;easy condition&quot; (i.e., the condition found by Rikka) can be achieved by destroying at most $K$ strongholds: If not, the game will repeat the initialize process until the chosen defensive line is valid.<br><br>After observing this secret, Rikka gives the map of the games to you, i.e., the coordinates of the strongholds. For each stronghold $x$, Rikka wants you to calculate the number of other strongholds $y$ so that line $x,y$ is a valid defensive line.","type":"description","format":"html"},{"title":"Input","content":"The first line of the input contains a single integer $T(1 \\leq T \\leq 50)$, the number of test cases.<br><br>For each test case, the first line contains two positive integers $n,K(1 \\leq n \\leq 5 \\times 10^4, 1\\leq K \\leq 50)$, the number of strongholds and the secret constant in the source code.<br><br>Then $n$ lines follow, each line with two integers $x_i,y_i(|x_i|,|y_i| \\leq 10^8)$, which represents the coordinates of the strongholds.<br><br>The input guarantees that there are no more than $2$ test cases with $n &gt; 1000$ and no two strongholds share the same $x$ coordinate or $y$ coordinate, i.e., for any two different strongholds $i,j$, $x_i \\neq x_j$ and $y_i \\neq y_j$.","type":"input_format","format":"html"},{"title":"Output","content":"For each test case, output the single line with $n$ integers which represent the answer for each stronghold.<br><br><div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>In the first two test cases, only the $(1,2),(2,3),(3,4),(1,4)$ are valid defensive lines where $(a,b)$ represents the straight line passing through the $a$th and $b$th strongholds.<br><br>In the third test case, any pair of strongholds can from a valid defensive line.<br></div>","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n5 2\n1 0\n4 1\n3 4\n0 3\n2 2\n5 3\n1 0\n4 1\n3 4\n0 3\n2 2\n5 4\n1 0\n4 1\n3 4\n0 3\n2 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2 2 2 2 0\n2 2 2 2 0\n4 4 4 4 4</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2019+Multi-University+Training+Contest+9&amp;source=1&amp;searchmode=source\"> 2019 Multi-University Training Contest 9 </a> ","type":"source","format":"html"}]}