{"title":"Escape","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6735","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6735&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6735","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6735"},"statement":[{"title":"Problem Description","content":"Given a maze of size n&#xD7;m. The rows are numbered 1, 2, &#xB7; &#xB7; &#xB7; , n from top to bottom while the columns are numbered 1, 2, &#xB7; &#xB7; &#xB7; , m from left to right, which means that (1, 1) is the top-left corner and that (n, m) is the bottom-right corner. And for each cell of size 1 &#xD7; 1, it is either blank or blocked.<br>There are a robots above the maze. For i-th robot, it is initially positioned exactly above the cell (1, pi), which can be described as (0, pi). And the initial moving direction of the robots are all downward, which can be written as (1, 0) in the vector form.<br>Also, there are b exits below the maze. For i-th exit, it is positioned exactly below the cell (n, ei), which can be described as (n + 1, ei).<br>Now, you want to let the robots escape from the maze by reaching one of the exits. However, the robots are only able to go straight along their moving directions and can&#x2019;t make a turn. So you should set some turning devices on some blank cells in the maze to help the robots make turns.<br>There are 4 types of turning devices:<br><li>&#x201C;NE-devices&#x201D; : make the robots coming from above go rightward, and make the robots coming from right go upward. Coming from left or below is illegal.</li><br><li>&#x201C;NW-devices&#x201D; : make the robots coming from above go leftward, and make the robots coming from left go upward. Coming from right or below is illegal.</li><br><li>&#x201C;SE-devices&#x201D; : make the robots coming from below go rightward, and make the robots coming from right go downward. Coming from left or above is illegal.</li><br><li>&#x201C;SW-devices&#x201D; : make the robots coming from below go leftward, and make the robots coming from left go downward. Coming from right or above is illegal.</li><br>For each cell, the number of turning devices on it can not exceed 1. And collisions between the robots are ignored, which allows multiple robots to visit one same cell even at the same time.<br>You want to know if there exists some schemes to set turning devices so that all the a robots can reach one of the b exits after making a finite number of moves without passing a blocked cell or passing a turning device illegally or going out of boundary(except the initial position and the exit).<br>If the answer is yes, print &#x201C;Yes&#x201D; in a single line, or print &#x201C;No&#x201D; if the answer is no.","type":"description","format":"html"},{"title":"Input","content":"The first line contains one positive integer T (1 &#x2264; T &#x2264; 10), denoting the number of test cases.<br>For each test case:<br>The first line contains four positive integers n, m, a, b (1 &#x2264; n, m &#x2264; 100, 1 &#x2264; a, b &#x2264; m), denoting the number of rows and the number of columns in the maze, the number of robots and the number of exits respectively.<br>Next n lines each contains a string of length m containing only &#x201C;0&#x201D; or &#x201C;1&#x201D;, denoting the initial maze, where cell (i, j) is blank if the j-th character in i-th string is &#x201C;0&#x201D;, while cell (i, j) is blocked if the j-th character in i-th string is &#x201C;1&#x201D;.<br>The next line contains a integers pi (1 &#x2264; pi &#x2264; m), denoting the initial positions (0, pi) of the robots.<br>The next line contains b integers ei (1 &#x2264; ei &#x2264; m), denoting the positions (n + 1, ei) of the exits.<br>It is guaranteed that all pis are pairwise distinct and that all eis are also pairwise distinct.","type":"input_format","format":"html"},{"title":"Output","content":"Output T lines each contains a string &#x201C;Yes&#x201D; or &#x201C;No&#x201D;, denoting the answer to corresponding test case.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3 4 2 2\n0000\n0011\n0000\n1 4\n2 4\n3 4 2 2\n0000\n0011\n0000\n3 4\n2 4</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Yes\nNo\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\n <center><img src=\"../../../data/images/C642-1005-1.PNG\"></center>\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=642ccpcQHD&amp;source=1&amp;searchmode=source\"> 642ccpcQHD </a> ","type":"source","format":"html"}]}