{"title":"Forest Program","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6736","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6736&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6736","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6736"},"statement":[{"title":"Problem Description","content":"The kingdom of Z is fighting against desertification these years since there are plenty of deserts in its wide and huge territory. The deserts are too arid to have rainfall or human habitation, and the only creatures that can live inside the deserts are the cactuses. In this problem, a cactus in desert can be represented by a cactus in graph theory.<br>In graph theory, a cactus is a connected undirected graph with no self-loops and no multi-edges, and each edge can only be in at most one simple cycle. While a tree in graph theory is a connected undirected acyclic graph. So here comes the idea: just remove some edges in these cactuses so that the remaining connected components all become trees. After that, the deserts will become forests, which can halt desertification fundamentally.<br>Now given an undirected graph with n vertices and m edges satisfying that all connected components are cactuses, you should determine the number of schemes to remove edges in the graph so that the remaining connected components are all trees. Print the answer modulo 998244353.<br>Two schemes are considered to be different if and only if the sets of removed edges in two schemes are different.","type":"description","format":"html"},{"title":"Input","content":"The first line contains two non-negative integers n, m (1 &#xFFFD;&#xFFFD; n &#xFFFD;&#xFFFD; 300 000, 0 &#xFFFD;&#xFFFD; m &#xFFFD;&#xFFFD; 500 000), denoting the number of vertices and the number of edges in the given graph.<br>Next m lines each contains two positive integers u, v (1 &#xFFFD;&#xFFFD; u, v &#xFFFD;&#xFFFD; n, u = v), denoting that vertices u and v are connected by an undirected edge.<br>It is guaranteed that each connected component in input graph is a cactus.","type":"input_format","format":"html"},{"title":"Output","content":"Output a single line containing a non-negative integer, denoting the answer modulo 998244353.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3 3\n1 2\n2 3\n3 1\n6 6\n1 2\n2 3\n3 1\n2 4\n4 5\n5 2</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">7\n49</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=642ccpcQHD&amp;source=1&amp;searchmode=source\"> 642ccpcQHD </a> ","type":"source","format":"html"}]}