{"title":"MUV LUV EXTRA","time_limit":1500,"memory_limit":256,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6740","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6740&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6740","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6740"},"statement":[{"title":"Problem Description","content":"One day, Kagami Sumika is stuck in a math problem aiming at calculating the length of a line segment with given statements and constraints. Since Sumika has no idea about it, she takes out a ruler and starts to measure the length. Unfortunately, the answer is an infinite decimal and she only got the first some digits of the answer from the ruler.<br>Sumika guesses that the answer is a rational number, which means that there exists two integers p, q that the answer equals $\\frac{q}{p}$. In this situation, the answer can be expressed as an infinte repeated decimal. For example, $\\frac{1}{2}$ = 0.500 ... , $\\frac{1}{3}$ = 0.333 .... , $\\frac{9}{10}$= 0.8999 ... ,$\\frac{36}{35}$= 1.0285714285714 ... .Sumika wants to guess the original number from the digits she got. Note that a number may has more than one way to be expressed such as 1.000 ... = 0.999 ... . Sumika won&#xFFFD;&#xFFFD;t transform the digits she got to another form when guessing the original number.<br>Furthermore, Sumika relizes that for a repeating part, either too long or the appeared length too short will make the result unreliable. For example, if the decimal she measured is 1.0285714285714, it is obviously unreliable that the repeating part is &#xFFFD;&#xFFFD;0285714285714&#xFFFD;&#xFFFD;, since it is too long, or &#xFFFD;&#xFFFD;428571&#xFFFD;&#xFFFD;, since the appeared length is too short, which equals 7, the length of &#xFFFD;&#xFFFD;4285714&#xFFFD;&#xFFFD;. In this case, the best guess is &#xFFFD;&#xFFFD;285714&#xFFFD;&#xFFFD;, whose length is 6 and the appeared length is 12. So formally, she defines the reliability value of a repeating part, whose length is l and the appeared length is p, as the following formula:<br><center>a * p - b * l</center><br>Where a and b are given parameters.<br>Last but not least, you can ignore the integer parts of the decimal. It is just for restoring the scene. And the repeating part you guess should be completely repeated at least once and is still repeating at the end currently.<br>Please help Sumika determine the maximum reliability value among all repeating parts.","type":"description","format":"html"},{"title":"Input","content":"The first line contains two positive integers a, b (1 &#xFFFD;&#xFFFD; a, b &#xFFFD;&#xFFFD; $10^9$), denoting the parameters.<br>The next line contains a string s (1 &#xFFFD;&#xFFFD; |s| &#xFFFD;&#xFFFD; $10^7$) in decimal form, denoting the first some digits of the accurate result.<br>It is guaranteed that there is exactly one decimal point in s and s is a legal non-negative decimal without leading &quot;-&quot;(the minus sign).","type":"input_format","format":"html"},{"title":"Output","content":"Output a single line containing an integer, denoting the maximum reliability value.","type":"output_format","format":"html"},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">5 3\n1.1020\n2 1\n12.1212</div></pre>","type":"example","format":"html"},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">9\n6</div></pre>","type":"example","format":"html"},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=642ccpcQHD&amp;source=1&amp;searchmode=source\"> 642ccpcQHD </a> ","type":"source","format":"html"}]}