{"title":"MUV LUV UNLIMITED","time_limit":1000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6741","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6741&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6741","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6741"},"statement":[{"title":"Problem Description","content":"There are few entertainments in United Nations 11th Force, Pacific Theater, Yokohama Base, the only pastime for squad 207 is gathering in PX to play games after supper. However, whatever they play, Shirogane Takeru is always the loser. So he decides to use the game theory knowledge from another world to become the winner. According to the knowledge he has learnt, Takeru introduces his army friends a game:<br>Given a rooted tree of size n, whose root is vertex 1. Two players do operations on the tree alternately. In each operation, a player should choose several (at least one) leaf vertices (which have no children vertices) and remove them from the tree. As can be seen, there might be some new leaf vertices after one operation. The player who cannot make a move in his/her turn loses the game.<br>But unfortunately, Takeru doesn&#x2019;t master the knowledge skillfully, so he has no idea whether the first player will win if the two players are playing optimally. Please help him determine that. <br>Assume that the two players are playing optimally to make themselves win, print &#x201C;Takeru&#x201D; in a single line if the first player will win, or print &#x201C;Meiya&#x201D; otherwise.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains one positive integer T, denoting the number of test cases.<br>For each test case:<br>The first line contains one positive integer n (2 &#x2264; n &#x2264; $10^6$), denoting the size of the given tree.<br>The next line contains n 1 positive integers pi (1 &#x2264; pi &#x2264; n), where i-th integer denotes the parent vectex of vectex i + 1.<br>It is guaranteed that the sum of n among all cases in one test file does not exceed $10^6$.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output T lines each contains a string &#x201C;Takeru&#x201D; or &#x201C;Meiya&#x201D;, denoting the answer to corresponding test case.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">2\n3\n1 1\n4\n1 2 3</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">Takeru\nMeiya\n\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nFor the first case, the first player can remove vertex 3 firstly. As a result, the second player has no\nchoice but to remove vertex 2. Finally, the first player removes vertex 1 and becomes the winner.\nFor the second case, the two players can only remove exactly one vertex in each operation alternately.\nAs can be seen, the winner, who removes vertex 1, will be the second player.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=642ccpcQHD&amp;source=1&amp;searchmode=source\"> 642ccpcQHD </a> ","type":"source","format":"html","require":["katex"]}]}