{"title":"MUV LUV ALTERNATIVE","time_limit":10000,"memory_limit":128,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6742","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6742&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6742","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6742"},"statement":[{"title":"Problem Description","content":"In order to cover the Tactical Armored Squadron withdrawing, the IJN Combined Fleet&#x2019;s 2nd Squadron is attracting attacks from Lux. After a while, the fleet is heavily damaged and some ships have been on fire. The soldiers on one fired ship are trying escaping from the cabin and reaching the board.<br>The cabin can be abstracted into a grid of n&#xD7;m, where rows are numbered 1, 2, &#xB7; &#xB7; &#xB7; , n from bottom to top and columns are numbered 1, 2, &#xB7; &#xB7; &#xB7; , m from left to right. The cabin is divided into 3 seated zones by 2 vertical corridors of width 1, where the left zone is of width l1, the middle zone is of width l2 and<br>the right zone is of width l3. Also, for the two corridors, one is between the left zone and the middle zone and the other one is between the middle zone and the right zone so that l1 + l2 + l3 + 2 = m always holds. Let&#x2019;s use (x, y) to denote the location of the cell in the x-th row and the y-th column.<br>Below the two corridors are the left exit and the right exit, which can be considered to be positioned at (0, l1 + 1),(0, l1 + l2 + 2) respectively. Following is the illustration when n = 4, l1 = l2 = l3 = 2.<br>There are k soldiers inside the cabin, each soldier is in a unique cell (xi , yi) in one of the three seated zones initially. A soldier in seated zones can only move leftward or rightward, while one in corridors can move not only leftward or rightward, but also upward or downward. And one soldier can stay still or move to an adjacent cell in one of the allowed directions according to its current position at every moment. Two cells are adjacent if and only if they share an edge. Each cell mustn&#x2019;t contain more than one soldier after each moment&#x2019;s movement.<br>For maintaining the order of escape, the soldiers who are initially in the left zone can only go to the left exit, while ones who are initially in the right zone can only go to the right exit. For ones who are initially in the middle zone, they can go to either the left exit or the right exit.<br>You want to know the minimum possible time that all the soldiers have reached one of the two exits.","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"The first line contains five positive integers n, l1, l2, l3, k (1 &#x2264; k &#x2264; 100 000, 1 &#x2264; n, l1, l2, l3 &#x2264; 109), denoting the number of rows, the three widths of the left zone, the middle zone, the right zone, and the number of soldiers respectively.<br>Next k lines each contains three positive integers ai , xi , yi (ai &#x2208; {1, 2, 3}, 1 &#x2264; xi &#x2264; n, 1 &#x2264; yi &#x2264; l1 + l2 + l3 + 2, yi = l1 + 1, yi = l1 + l2 + 2), denoting the initial position of a soldier, where ai denotes the zone index and xi , yi denotes the row index and the column index respectively.<br>It is guaranteed that input k positions are pairwise distinct and that (xi , yi) is indeed in the zone ai.","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"Output a single line containing a positive integer, denoting the minimum possible time.","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4 2 2 2 3\n1 2 1\n1 2 2\n2 2 4</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4\n<div style=\"font-family:Times New Roman;font-size:14px;background-color:F4FBFF;border:#B7CBFF 1px dashed;padding:6px\"><div style=\"font-family:Arial;font-weight:bold;color:#7CA9ED;border-bottom:#B7CBFF 1px dashed\"><i>Hint</i></div>\nOne possible scheme is as follows, where &#x201C;S&#x201D;, &#x201C;E&#x201D; denote soldiers and exits respectively:\n1. Moment 0: Initial status\n2. Moment 1: three soldiers move to (2, 2),(2, 3),(2, 5) respectively.\n3. Moment 2: three soldiers move to (2, 3),(1, 3),(2, 6) respectively.\n4. Moment 3: three soldiers move to (1, 3),(0, 3),(1, 6) respectively, where the second soldier has reached the left exit.\n5. Moment 4: the remaining two soldiers move to (0, 3),(0, 6) respectively, where the three sol\u0002diers have all reached the exits. So the cost time is 4 during the escape.\n</div><i style=\"font-size:1px\"> </i></div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=642ccpcQHD&amp;source=1&amp;searchmode=source\"> 642ccpcQHD </a> ","type":"source","format":"html","require":["katex"]}]}