{"title":"Tokitsukaze and Rescue","time_limit":8000,"memory_limit":512,"operation":{"submit":"http://acm.hdu.edu.cn/submit.php?pid=6797","submissions":"http://acm.hdu.edu.cn/status.php?first=&pid=6797&user=&lang=0&status=0","statistics":"http://acm.hdu.edu.cn/statistic.php?pid=6797","discussion":"http://acm.hdu.edu.cn/discuss/problem/list.php?problemid=6797"},"statement":[{"title":"Problem Description","content":"Princess CJB has lived almost her entire life in the isolated town of Ertona, where CJB uses her unique ability to recognize where crystals of materials are buried. By way of a fateful encounter, CJB learns of the Alchemy Exam and decides to take her first step into the outside world, setting off on a grand journey to become a certified alchemist and discover the mysteries that life has to offer!<br><br>In order to take part in the Alchemy Exam, CJB goes to the Reisenberg town without any partners. But the kingdom Adalet is unbelievably enormous so that there are many hidden risks. Claris, a powerful evil magician, wants to monopolize CJB for the extraordinary beauty of her. Due to the power limitation of CJB, she can&apos;t escape from Claris without any assistance. The alchemist Tokitsukaze has heard this savage act and wants to rescue the princess CJB.<br><br>There are $n$ cities numbered from $1$ to $n$ in the kingdom Adalet. Because of the excellent transportation, there is exactly a two-way road between any two cites. Tokitsukaze lives in city $1$. The Magician Claris lives in city $n$. Since the exam will be held soon, Tokitsukaze wants to rescue CJB as fast as possible, so she will choose the shortest path to reach city $n$.<br><br>Claris has also heard this news and is afraid of being punished, so he decides to slow Tokitsukaze down by making an explosion on $k$ roads he chose and causing these roads to lose their capability of two-way transportation, since it can pave the way for having enough time to prepare his powerful magic against Tokitsukaze.<br><br>Tokitsukaze knows some roads will be destroyed and can immediately recognize where they are, but she has no approach to prevent this explosion, so she chooses just to move along the shortest path after Claris completes his explosion.<br><br>Now Claris wants to know, after finishing his explosion, what the longest possible length is of the shortest path from city $1$ to city $n$.<br>","type":"description","format":"html","require":["katex"]},{"title":"Input","content":"There are several test cases.<br><br>The first line contains an integer $T$ $(1 \\leq T \\leq 100)$, denoting the number of test cases. Then follow all the test cases.<br><br>For each test case, the first line contains two integers $n$ and $k$ $(3 \\leq n \\leq 50, 1 \\leq k \\leq \\min(n - 2, 5))$, denoting the number of cities and the number of roads being exploded, respectively.<br><br>The next $\\frac{n (n - 1)}{2}$ lines describe all the roads, where each line contains three integers $u$, $v$ and $w$ $(1 \\leq u, v \\leq n, u \\neq v, 1 \\leq w \\leq 10^4)$, representing a two-way road of length $w$ between city $u$ and city $v$. It is guaranteed that for every two cities, there exists exactly one road whose length is randomly distributed between $1$ and $10^4$.<br>","type":"input_format","format":"html","require":["katex"]},{"title":"Output","content":"For each case, output in one line an integer, denoting the longest possible length of the shortest path after the explosion.<br>","type":"output_format","format":"html","require":["katex"]},{"title":"Sample Input","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">3\n5 1\n1 2 2990\n1 3 2414\n1 4 4018\n1 5 6216\n2 3 9140\n2 4 4169\n2 5 550\n3 4 6618\n3 5 3206\n4 5 105\n5 2\n1 2 2990\n1 3 2414\n1 4 4018\n1 5 6216\n2 3 9140\n2 4 4169\n2 5 550\n3 4 6618\n3 5 3206\n4 5 105\n5 3\n1 2 2990\n1 3 2414\n1 4 4018\n1 5 6216\n2 3 9140\n2 4 4169\n2 5 550\n3 4 6618\n3 5 3206\n4 5 105</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Sample Output","content":"<pre><div style=\"font-family:Courier New,Courier,monospace;\">4123\n5620\n6216</div></pre>","type":"example","format":"html","require":["katex"]},{"title":"Source","content":" <a href=\"/search.php?field=problem&amp;key=2020+Multi-University+Training+Contest+3&amp;source=1&amp;searchmode=source\"> 2020 Multi-University Training Contest 3 </a> ","type":"source","format":"html","require":["katex"]}]}